{"commentsData":[{"author":"calcorax","body":"new teeth","isChecked":true,"level":1,"score":"7482"},{"author":"1drlndDormie","body":"Yea I almost thought I could get some dental work done this year. Ha ha silly me.","isChecked":false,"level":2,"score":"1945"},{"author":"katiopeia","body":"Got dental insurance this year finally. Got a cleaning and scheduled for my one filling and an invisilign consult... for the end of March.","isChecked":false,"level":3,"score":"726"},{"author":"r3ign_b3au","body":"Finally got it as well. Have a wisdom tooth that has almost completely pushed out a healthy molar. Appointment for removal was April 10th","isChecked":false,"level":4,"score":"44"},{"author":"CSGOW1ld","body":"Most dentists/oral surgeons are still open for emergency procedures. If it's hurting badly I'm sure they'd love to take it out for you. Now is probably the best time too since everyone is home.","isChecked":false,"level":5,"score":"49"},{"author":"justzacc","body":"Yeah, I had a tooth that was killing me plus a wisdom tooth that was a problem and they got me in asap because of the pain. This was mid march. They only let one person into the surgeons office at a time, if it wasn’t your turn, just wait in the car","isChecked":false,"level":6,"score":"32"},{"author":"Gibborim","body":"> if it wasn’t your turn, just wait in the car\n\nNice, I like it.","isChecked":false,"level":7,"score":"26"},{"author":"SneedyK","body":"Well at least you didn’t get one of your two front teeth pulled prior to bridge work that is now currently postponed indefinitely.\n\nSilver lining optimism is this year isn’t requiring a lot of talking nor smiling. I guess if I lose the other one, I’ll find a practical use for the gap. Like a groove for a gun.\n\nPeople, don’t underestimate the effect of broken windows or teeth on your storefront of self-confidence.","isChecked":false,"level":5,"score":"20"},{"author":"ImLosingMyWill","body":"I feel you 1,000% I had lost a front tooth and didn’t laugh or smile for the better half of a year. I gotten so depressed in that time. I really don’t wish that on anyone! I’m sure you’re a great person, inside & out. ☮️ & ❤️","isChecked":false,"level":6,"score":"11"},{"author":"alwaysrightusually","body":"It’s still only enough for one or 2 procedures each year.  If you need a lot of work, dental insurance is a joke.","isChecked":false,"level":4,"score":"17"},{"author":"iwantawolverine4xmas","body":"Yeah dental insurance is not meant to catch someone up after not going to dentist for several years. It’s pretty much for a stable mouth that may need that one new crown or a few fillings a year. Insurance companies have not increased their annual portion in decades (usually its $1500-2000 per year), yet like anything else due to inflation the cost of getting work done has increased. Dental insurance companies have made more money this way, since they don’t help as much as they use to adjusted for inflation and still increase everyone’s premiums. They are crooks only looking out for their profits.","isChecked":false,"level":5,"score":"19"},{"author":"snowflakeaf","body":"I'm surprised this wasn't higher up. Really wish I could afford a dentist.","isChecked":false,"level":2,"score":"484"},{"author":"ray12370","body":"1. Live near the border to Mexico. I got braces and they have done wonders for my self-esteem. Even after just 4 months, night and day difference and I pay $25 the visit.\n\n2. Get fucked by medical bills in the US.","isChecked":false,"level":3,"score":"102"},{"author":"snowflakeaf","body":"That is insane. I live close enough now that I could probably actually do that.","isChecked":false,"level":4,"score":"13"},{"author":"Mr-Lincoln","body":"I wish more then anything. \nI’m in Canada and have struggled with spaced teeth.\nEven with the cost of braces up here (no be if it’s) I don’t think it will fix it. \nSelf esteem issues are through the roof. Especially with siblings who got braces...","isChecked":false,"level":4,"score":"9"},{"author":"TannedCroissant","body":"Kids sell their old ones pretty cheap dude, if you look under the right pillows, you can get them for a few bucks each.","isChecked":false,"level":2,"score":"50"},{"author":"ohsoradbaby","body":"I’m sorry, I hope you get to do this soon. \nI feel this so incredibly hard. My parents abused and neglected my whole childhood on aspects like dentistry, doctors, etc. When I finally moved out at 16, I had to fight every penny I earned towards rent and food. Had been taught my whole damn life I wasn’t worth medical bills or really anything. It’s taken me a while but this past year, I’ve had someone in my life who has taught me I am worth it. I was so ready this year to go to the dentist. Had a good job with good insurance. Lost that a week ago due to COVID. Sometimes life just doesn’t play out right m8.","isChecked":false,"level":2,"score":"16"},{"author":"aspankdmonkey","body":"12k on two implants. Good I got this done before the recession","isChecked":false,"level":2,"score":"14"},{"author":"sonicon","body":"I could also use a couple teeth and a crown.","isChecked":false,"level":2,"score":"8"},{"author":"Jacooooooooob","body":"A tablet to read online books slightly easier. Or lasik eye surgery.\n\nEdit: thanks to everyone who offered to send me one of theirs.","isChecked":true,"level":1,"score":"7230"},{"author":"tubby0789","body":"If you PM me a way to send you one I have several kindles","isChecked":false,"level":2,"score":"2866"},{"author":"Slothyflexibility","body":"Real mvp right here","isChecked":false,"level":3,"score":"555"},{"author":"IMTHATWE1RD0","body":"If you PM me a way to send you one I have several eyes","isChecked":false,"level":4,"score":"810"},{"author":"TheShadowPizza","body":"What? Nothing for this comment? Cmon Reddit!","isChecked":false,"level":5,"score":"40"},{"author":"rotatingwhale","body":"it's been 8 minutes...","isChecked":false,"level":6,"score":"25"},{"author":"amix16","body":"That’s so nice!! You’re incredible.","isChecked":false,"level":3,"score":"10"},{"author":"jerricka","body":"I was going to say, I have an older Samsun tablet I would send to someone who needs/wants it.","isChecked":false,"level":3,"score":"17"},{"author":"tubby0789","body":"Omg thank you all so much for the upvotes and awards!! We all need to help each other in this time of need!","isChecked":false,"level":3,"score":"18"},{"author":"Badloss","body":"Kindle paperwhite is the way to go for e-readers\n\n(plus if you're slightly less than ethical about how you get your books it's actually *cheaper* in the long run)","isChecked":false,"level":2,"score":"2103"},{"author":"keysersosayweall","body":"Get a library card and use Libby. I can borrow up to 20 books at a time. If you turn off WiFi you can keep them indefinitely.","isChecked":false,"level":3,"score":"1281"},{"author":"Generiss","body":"What????! Damn there was this one time I had 4 hours before a book was going to be returned and I read it as fast as I could. I had that book on hold for ages and then when I borrowed it I just wasted the time until the very last 4 hours. If I’d only known about this. Lol.","isChecked":false,"level":4,"score":"520"},{"author":"RiddleMeWhat","body":"Fyi, it depends on the age and what ereader you have. I have an older paperwhite where this works. I also have a newer fire tablet where it somehow knows when the borrow is up and returns it. \n\nAlso, there are a lot of services offering free access to books right now! Scribd and the National Emergency Library are two I know of.","isChecked":false,"level":5,"score":"146"},{"author":"Fed0raBoy","body":"Librarian here. Ebook expire on their own via a licence key with a set time, that is included in the file. Once this time is exceeded the key won't be accepted anymore. Most e-reader support this licencing method. And the most common is via Adobe ID. Some older Reader don't check for keys, hence them still working after expiration.","isChecked":false,"level":6,"score":"19"},{"author":"guscatero","body":"For me, as long as i don't leave the book (go back to homepage or whatever) I can keep reading it indefinitely, even after the return date. I don't have to turn off the wifi but if you accidentally go back to home it deletes the book from your kindle.","isChecked":false,"level":5,"score":"8"},{"author":"ImaginosBDesdinova","body":"If your library  doesn't support Libby look into Hoopla. It only offers 8 borrows a month but it's still good","isChecked":false,"level":4,"score":"229"},{"author":"RiddleMeWhat","body":"Depends on your library. I only get 3 a month from hoopla. But then unlimited with rbdigital and overdrive (libby).","isChecked":false,"level":5,"score":"14"},{"author":"RiddleMeWhat","body":"Also, there are a lot of services offering free access to books right now! Scribd and the National Emergency Library are two I know of.","isChecked":false,"level":5,"score":"12"},{"author":"GreenPixel25","body":"I downloaded the local library app, and it was pretty awful.  Their site also recommended Libby so I got that instead, and damn it’s a really good app, I’d recommend it to anyone. Super easy to use and you can do everything right within the app.","isChecked":false,"level":4,"score":"35"},{"author":"CanuckBacon","body":"Overdrive and Libby are by the same company. They created Libby because they recognized how bad overdrive looked.","isChecked":false,"level":5,"score":"11"},{"author":"InfanticideAquifer","body":"If you're pirating your ebooks (which I *wholeheartedly* support) then why a Kindle, specifically? At that point you don't care about the Amazon ecosystem. I went with a Kobo for ebook piracy and have been enjoying it a lot... what am I missing out on?","isChecked":false,"level":3,"score":"16"},{"author":"jordo-91","body":"Look into e-readers. Cheaper than a tablet, much more comfortable screen and the battery last for a month or so.","isChecked":false,"level":2,"score":"342"},{"author":"TannedCroissant","body":"Yeah, every time I see a Kindle it blows my mind how much it looks like paper.","isChecked":false,"level":3,"score":"182"},{"author":"MrPrius","body":"Electronic ink, baby","isChecked":false,"level":4,"score":"18"},{"author":"MadTouretter","body":"Electronic Ink Baby is a great band name.","isChecked":false,"level":5,"score":"29"},{"author":"JTswift","body":"So easy to read in the sun, too...if you’re into that kind of thing.","isChecked":false,"level":4,"score":"11"},{"author":"xorgol","body":"The first time I saw one in real life I thought there was a sticker on the screen.","isChecked":false,"level":4,"score":"12"},{"author":"shokalion","body":"Yeah these seem to have fallen a little out of the mainstream eye this last few years, but they're still the best way to read outside of a proper book, and they even beat that in some regards.","isChecked":false,"level":3,"score":"9"},{"author":"paleoterrra","body":"Definitely recommend a kindle over a tablet. They’re made to cause less eye strain, as they aren’t backlit like tablets/phones are. The new Oasis even has features to reduce eye strain even further (though I don’t have it so I can’t fully attest).","isChecked":false,"level":2,"score":"169"},{"author":"BawdyLotion","body":"doubling down on other's opinion. Dont use a tablet for reading. Go e-reader all the way. Tablets give tons of eye strain similar to a monitor.   \n\nE-readers are cheaper, last longer (no shitty updates/apps to break it), have crazy long battery life and are nicer to read on.","isChecked":false,"level":2,"score":"12"},{"author":"kantorr","body":"I have a Kindle Paperwhite I haven't used once (I still prefer paper textbooks for my eyes over any electronic reading), PM me and its yours shipping included.","isChecked":false,"level":2,"score":"10"},{"author":"decorama","body":"A healthy life. Not looking for pity here, but was just diagnosed with leukemia. Even WITH insurance the bills are already outrageous and it's only been a few months. My leukemia is chronic, so it's going to be around for the rest of my life. This will completely change my financial landscape.","isChecked":true,"level":1,"score":"1412"},{"author":"maybeCheri","body":"Reading through the comments, I think that Covid has made wishing for good health taken for granted since we are all hoping we don’t get it. But when you are faced with something so life changing in the middle of all this is kind of lost in this mess. The one good thing that may come from this is the need to really change our health care system. A for-profit healthcare system must be dismantled. I wish you had your good health back. If not that then good healthcare. Sending you positivity, prayers, and good luck.  Stay quarantined and safe.","isChecked":false,"level":2,"score":"262"},{"author":"p0yo77","body":"This is probably the nuclear option but... Why don't you move to a place that has a different schema for health insurance? Canada, England, European Union for free healthcare or Mexico working for a company where you get health insurance and the copay/deductible it's actually affordable","isChecked":false,"level":2,"score":"13"},{"author":"marauding-bagel","body":"Those places often don't let you move there if you know you have a health condition. I know that personally I could never move to Canada because they won't let people who have ASD immigrate and that needs a lot less (i.e. zero) treatment than cancer","isChecked":false,"level":3,"score":"12"},{"author":"barbiepinkbarbie","body":"Dental implants I'm missing 3 teeth in the back from failed root canals","isChecked":false,"level":1,"score":"748"},{"author":"Ricochet308","body":"A new dentist maybe, too","isChecked":false,"level":2,"score":"433"},{"author":"SaucyNuggetsNSkyrim","body":"Honestly. How do you have THREE failed root canals. I'd shit my pants and run out the moment they told me I needed two.","isChecked":false,"level":3,"score":"29"},{"author":"PM_ME_VEG_PICS","body":"Holy fuck, I've had 1 root canal and that was enough! I hope you get your dream teeth one day. My dad finally got his implants after 20 years of wishing, apparently kids cost a lot!!!","isChecked":false,"level":2,"score":"21"},{"author":"BeerBrat","body":"I'm with you. Currently missing a molar that I had pulled very quickly as soon as this corona mess started. A twenty year old root canal finally gave up and got a thin vertical fracture in one root, thing got all gross and abcess. Needed a bone graft and am currently healing from that. Let's just say that the insurance company paid almost jack shit for the extraction, nothing for the bone graft, and I do not look forward to the implant bill in a few months once the bone is healed and ready for that part. Because having an implant, or any type of replacement, is \"elective.\" Good luck!","isChecked":false,"level":2,"score":"12"},{"author":"VikingDeer","body":"A house\n\nEdit: itt people who have colourful ideas of their own dream real estate","isChecked":false,"level":1,"score":"16549"},{"author":"ilonelytylenoli","body":"Yeah, down payments are a pain. I don't know how people ever put down 20%. I've got a great job, student loans and car paid off, live on my own. I've got enough saved to put down like ... 4%.","isChecked":false,"level":2,"score":"3908"},{"author":"unimonkey73","body":"If you live in a rural area you can get USDA loans for first time home buyers that are 0% down, we got our house that way, we pay a little extra each month for insurance on the mortgage. We had solid jobs and just wanted a home but didn’t have any substantial down payment so this was a blessing for us.","isChecked":false,"level":3,"score":"829"},{"author":"Cjwithwolves","body":"I just closed on my first home on March 11th with  USDA loan. I 100% recommend it to anyone who qualifies :) No down payment, just some closing fees and a reasonable monthly payment. I'm happy as hell.","isChecked":false,"level":4,"score":"290"},{"author":"LeslieNope69","body":"I’m looking into that as well. What other fees did you pay when closing?","isChecked":false,"level":5,"score":"24"},{"author":"Cjwithwolves","body":"When our offer was accepted we put $1,000 down to hold our place sp the seller wouldn't back out. That was very first. Then a few weeks later we paid $300 for the inspection. Then when we closed it was 4,000 so my husband and I spilt that. Wasn't too bad, not for a whole ass house after living in overpriced apartments. We had a 2 bedroom apartment that was 1,000 sf for $1,453 + utilities. Now we have a 3 bedroom home with a BACKYARD AND A GARAGE AND A DRIVEWAY with a cute tree for $1,303 a month. I'm in heaven.","isChecked":false,"level":6,"score":"127"},{"author":"KingMoonfish","body":"I lucked out, the seller paid the closing costs for us on our home. Otherwise we did the exact same as you! 3 bedrooms, garage, backyard for around the same price. It's like you're me or something.","isChecked":false,"level":7,"score":"21"},{"author":"StickySnacks","body":"Most 'fees' are rolled into the mortgage loan. Usually the only thing you'll have to pay is earnest money deposit, inspection fees and possibly closing costs depending on the offer to purchase agreed upon. Sometimes the seller will pay closing costs, but not always.","isChecked":false,"level":6,"score":"10"},{"author":"ImCreeptastic","body":"We did the same with our first house. I loved it, EVERYTHING was rolled into the mortgage. I'll always suggest doing that type of loan if possible. And, PMI isn't permanent like FHA","isChecked":false,"level":4,"score":"10"},{"author":"Tis_But_A_Fake_Name","body":"This is what we did. 0% down with PMI, sold 3 years later after a $60k appreciation. Put 20% down on the next house with no PMI, then sold 2 years later  at $100k more than we paid for it. Then paid off all debt and put 35% down on our current house. Unfortunately this economy looks like it's going to wipe out our local real estate market. Might be here for a while. Ha.","isChecked":false,"level":4,"score":"8"},{"author":"TNTeggo","body":"Have you talked to a real estate person yet? When we did they hooked us up with a mortgage guy...we didnt like him, but the second guy she hooked us up with was great and it was surprising how little you can put down and get a house. Our credit was in the good range....low 700s...and the mortgage guy seemed very happy about that. \nWe DO pay PMI because we didnt put the 20% down- but its not a lot- and compared to how much you throw away renting, I feel okay about it. Also the sellers paid as much of our closing costs that are legally allowed...so that can help. \nWe ended up paying maybe 10% total of the cost of the house...that's the down payment, inspections, fees, and the rest of the closing costs. \nIf you haven't talked to a realtor or mortgage person yet, do it. It can at least let you know what you can work towards in real numbers. But talk to a few people. It sounds like you are in a better position than most!","isChecked":false,"level":3,"score":"1093"},{"author":"heiditbmd","body":"I wouldn’t buy anything right now, with the coming economic changes prices are going to go way down.","isChecked":false,"level":4,"score":"828"},{"author":"riversandhills","body":"It's also risky blowing a huge chunk of savings on a down payment when you could possibly lose your job due to the increasing economic crisis. Couple that with your mortgage going underwater because of a low down payment and a market drop, and you're in a world of hurt.\n\nEdit: this is the reason my wife and I put home shopping on hold a couple weeks ago. Neither of us has lost our job (so far), but we couldn't stomach that possibility while also dropping more than half our savings to make a 5% down payment and risking the equity being eaten up by a housing market downturn.","isChecked":false,"level":5,"score":"569"},{"author":"Leakyradio","body":"Then you would have to get roommates to pay the mortgage. \n\nProblem solved, and created!","isChecked":false,"level":6,"score":"27"},{"author":"moldymoosegoose","body":"Roommates - The cause of, and solution to, all of life's problems.","isChecked":false,"level":7,"score":"15"},{"author":"Suz1998","body":"FHA mortgages require only 3.5% down..","isChecked":false,"level":3,"score":"225"},{"author":"Viktorjanski","body":"With a garden","isChecked":false,"level":2,"score":"719"},{"author":"eyecarrumba","body":"And a pool","isChecked":false,"level":3,"score":"417"},{"author":"istefan24","body":"And a sexy maid","isChecked":false,"level":4,"score":"483"},{"author":"None","body":"[deleted]","isChecked":false,"level":5,"score":"489"},{"author":"SeNorSpiceyBoi","body":"And a real dungeon","isChecked":false,"level":6,"score":"441"},{"author":"fl3x4pi0","body":"And a dragon","isChecked":false,"level":7,"score":"386"},{"author":"texaschair","body":"And Tyrion Lannister","isChecked":false,"level":8,"score":"194"},{"author":"Cacophony_Of_Screams","body":"And that sexy dragon lady","isChecked":false,"level":9,"score":"251"},{"author":"VidE27","body":"And another dragon","isChecked":false,"level":10,"score":"120"},{"author":"FlipFlopFling","body":"And a Donkey","isChecked":false,"level":10,"score":"156"},{"author":"2003vrx","body":"And a Nissan skyline r33gtr in the garage","isChecked":false,"level":10,"score":"107"},{"author":"191213","body":"And a cinema room","isChecked":false,"level":6,"score":"73"},{"author":"throwawaynewc","body":"Came here to say this, I'm not optimistic that the housing market will show a significant dip after all this either.","isChecked":false,"level":2,"score":"303"},{"author":"Fakjbf","body":"I don’t know, probably gonna be a lot of foreclosures given the layoffs. A lot of people avoid buying foreclosures because they tend to be in disrepair, but a lot of these will be perfectly good houses that people just couldn’t maintain payments for. I don’t think the housing market is going to completely fall apart, but I wouldn’t be surprised if there’s a decent dip.","isChecked":false,"level":3,"score":"164"},{"author":"bubumamajuju","body":"The 15million people that will be out of work are almost entirely in retail or hospitality. Most of those people scrape by and don't own homes.","isChecked":false,"level":4,"score":"89"},{"author":"JonTheBon","body":"We aren’t seeing the late payments we would normally see before a real estate price drop.  People are generally handling the slow down well and most banks are deferring payment for those who can’t.  If the worst it gets is two weeks from now then things are looking pretty good a year from now.","isChecked":false,"level":4,"score":"17"},{"author":"Xav27_","body":"Maybe, but most banks are deferring payments and allowing forbearance to avoid foreclosures.  \n\nAlso, at least in my area, the market was booming before the virus, and they are even still building now, therefore when things smooth out I would expect it to go back to normal eventually. I was reading this article explaining how this is much different than the 2008 market catalysts so maybe we shouldn’t expect a crash or even a solid dip from this..guess we will find out for sure lol","isChecked":false,"level":4,"score":"27"},{"author":"dm_me_kittens","body":"In the middle of the street.","isChecked":false,"level":2,"score":"502"},{"author":"ThatBritishPleb","body":"That was where we used to sleep","isChecked":false,"level":3,"score":"209"},{"author":"davus_maximus","body":"It was our castle and our keep","isChecked":false,"level":4,"score":"164"},{"author":"ZotuX","body":"Our house","isChecked":false,"level":3,"score":"114"},{"author":"tommygunz007","body":"I want a house too... just don't have the $40,000 down payment.","isChecked":false,"level":2,"score":"206"},{"author":"skrenename4147","body":"Cries in Bay area","isChecked":false,"level":3,"score":"317"},{"author":"MandingoPants","body":"Those 40k are just for the shingles for the 3x6 Maid’s Quarters.","isChecked":false,"level":4,"score":"82"},{"author":"jigglypuffpufff","body":"LA crying along with you.","isChecked":false,"level":4,"score":"16"},{"author":"LLFD1982","body":"You don't necessarily need that much down payment. There are a ton of programs around the country, city/county/state sponsored programs that can help with down payment funds. Check your location's Housing website. Some are straight grants (no repayment), some are small 2nd liens (forgivable and non-forgivable). \n\nSource: I work in this industry","isChecked":false,"level":3,"score":"12"},{"author":"Magikalillusions","body":"I got the deposit and can more than afford it.\n\nBut computer says no.\n\nLook after your credit ratings people or else face computers wrath.","isChecked":false,"level":2,"score":"235"},{"author":"TripperDay","body":">I got the deposit and can more than afford it.\n>\n>But computer says no.\n>\n>Look after your credit ratings people or else face computers wrath.\n\nCould be worse. My credit score is a little north of 800, but I made 33k last year. Your credit score will improve faster than my income.","isChecked":false,"level":3,"score":"16"},{"author":"Merlottesangel","body":"Same here","isChecked":false,"level":2,"score":"28"},{"author":"rjmtl","body":"If you've saved,  survive this pandemic and you'll find yourself with cheaper homes. I'm already waiting for the collapse in home prices","isChecked":false,"level":2,"score":"83"},{"author":"Sammygface","body":"Just a day alone completely.","isChecked":true,"level":1,"score":"6192"},{"author":"sspine","body":"I want the opposite.  A day just to hang out with friends.","isChecked":false,"level":2,"score":"3069"},{"author":"themooseiscool","body":"Same. My brother is healthy and literally across the street but I'm not allowed to hang out with him.","isChecked":false,"level":3,"score":"807"},{"author":"Ivotedforher","body":"Does he know he is your brother?","isChecked":false,"level":4,"score":"834"},{"author":"zombierobotvampire","body":"yup, laugh caught me off guard.. solid work.","isChecked":false,"level":5,"score":"11"},{"author":"carlotta4th","body":"Covid, dude. I have siblings I'd love to visit as well but we're all just having to facetime or whatever to try and get that socialization in.","isChecked":false,"level":5,"score":"40"},{"author":"idiBanashapan","body":"A very under-rated comment. It’s so important to get some time out. Usually, it might be the car journey to and from work. Or that walk out to the shops. None of that is happening right now and there is someone there all the time. \n\nThis weekend, I booked off the Friday and Monday to give myself a 4 day weekend, alone. The opportunity for this happens maybe once a year. The wife and girls were booked to go away with a friend and her children for 3 days. Obviously, that has been cancelled.  I was soooooooo looking forward to it. \n\nNot that I don’t love the wife and kids massively, of course I do. But I need down time. Do my own thing, in my own time. No guilt for passing my attention to something else. And the ability to just concentrate on doing some little project or task I have in my head without having to stop every few minutes to stop the toddler doing something she shouldn’t be, or helping the teenager with some homework or cooking. \n\nI too, just want to be completely alone for a few days.","isChecked":false,"level":2,"score":"640"},{"author":"bumpercarbustier","body":"I'm a SAHP to a two and four year old. I had planned to visit and stay with a friend of mine over Memorial Day weekend. That's not going to be happening. I get to do this about twice a year and now I won't be able to, and it's hitting me hard.","isChecked":false,"level":3,"score":"50"},{"author":"sassyburrito4","body":"I feel this to my very core. I work in healthcare so I am still working, and honestly working more than normal to help cover shortages. So I deal with patients and co-workers all day long. My partner is working from home and I love him so much, but damn just a day of no one else sounds absolutely incredible. I've taken to going to my car on my breaks just to have some peace and quiet.","isChecked":false,"level":3,"score":"33"},{"author":"photo_a_day","body":"Yes! If I don't get time alone - I'm not tolerable. I need it weekly at least, but if I get an hour every day, it's magical for my mental health","isChecked":false,"level":3,"score":"12"},{"author":"emaciated_pecan","body":"This honestly makes me question if I want kids. I value my alone time so much and would go crazy without it","isChecked":false,"level":3,"score":"11"},{"author":"username1824","body":"Take up driving nowhere. Just go out for a drive around town and don't get out of your car until your are back home. You aren't risking getting/spreading infection since you won't be near or interact with anyone, but it really does help getting out and having a little alone time.","isChecked":false,"level":3,"score":"11"},{"author":"tornligament","body":"I had my annual alone time trip in February but got a giant migraine on the second day and came home. Next week was supposed to be my redo. Just want to be in my own head for a few days.","isChecked":false,"level":3,"score":"9"},{"author":"TBPT","body":"Wow this is me right now 100%","isChecked":false,"level":3,"score":"17"},{"author":"PosPasBubba","body":"What I do, I go out into the woods and smoke my joint. That's what I do. Even if I'm needed elsewhere. I don't give a single fuck. Me time is me time. That's how it is and always will be. But almost every day is me time for me... Kinda enjoy it though. Being alone. No girlfriend, no kids. Just my step dad and sister, but working shifts I often sleep while they are awake and vice versa. So, I totally get what you mean. I don't have your problem, but I do understand why you have the problem. Don't feel shame or anything else for this need of being alone.","isChecked":false,"level":3,"score":"9"},{"author":"rangoranger39","body":"Oh god yes, this the one right here.","isChecked":false,"level":2,"score":"12"},{"author":"clarko21","body":"This right here. My GF literally just stormed out because she said we haven’t been doing stuff together,  and that we need to go for a walk together, when we’ve been stuck inside a one bedroom apartment 24/7... I don’t get how some people just don’t value alone time and always need to be with others.","isChecked":false,"level":2,"score":"10"},{"author":"veronicatheartist","body":"fuckin eh, I miss alone time.","isChecked":false,"level":2,"score":"10"},{"author":"ImNotScaredNotAtAll","body":"I’d just like a job again so I can buy the things we need. Absolutely exhausted from the worry.\n\nEdit: thanks for the support and ideas. I applied for instacart and hopefully can start making some money with them. \n\nWe applied for state services over a week ago and still haven’t heard anything unfortunately, I’m sure they are ridiculously backed up. Really hoping it comes through this week. \n\nA ridiculously kind redditor has offered to paypal us a few bucks to get some essentials, so I think we will be ok through the next week. Thanks again for all your ideas and kind words. Stay safe everyone, we can beat this together.\n\nI gotta add that my wife is immunocompromised (T1D), she would likely die if she contracts COVID-19, so yes in spite of my uname, I am actually scared.","isChecked":true,"level":1,"score":"7146"},{"author":"jenze0430","body":"Not sure where you live but in the US right now, there’s a shortage in the Supply Chain. Look for food distributors. We’re hiring many to keep the chains moving and keep the shelves stocked.\n\nThere’s plenty of food and supplies for grocery stores. The problem is that people are emptying shelves faster than we can have products delivered to the stores. BUT THERE’S PLENTY OF SUPPLY! Panic buying is not helping!\n\nGood luck!","isChecked":false,"level":2,"score":"1498"},{"author":"spiffynid","body":"Yeah, I work in shipping and logistics, stuff is moving. A lot of stuff. And if the last 3 weeks are any indication, medical supplies are going to ramp up more, at least in our little corner.","isChecked":false,"level":3,"score":"394"},{"author":"jenze0430","body":"Yeah I work in Food distribution as a 3PL. We’re the middle man to the middle man.\n\nWe store for the manufacturers and ship to wholesalers that then sell to Grocery chains. The shelves are so bare that Grocery chains are working with manufacturers to cut out the wholesalers. We’re here to help to get food to where it needs to go and we’re working long hours and are essential just as the health workers. Nothing compares to the health workers so they deserve more than what they are getting. \n\nPeople, If you see them in stores, give them priority to purchase so they don’t have to go as often and keep the hospitals moving.","isChecked":false,"level":4,"score":"181"},{"author":"abillionbells","body":"Thanks for the crucial work you're doing! Without the steady supply chain we have in place, panic would be a serious threat. You're literally saving lives.","isChecked":false,"level":5,"score":"9"},{"author":"Esmeweatherwaxedlegs","body":"Seconded! We lost our livelihood and our now delivering fruit and veg boxes, it's not much but we're at least ticking over!","isChecked":false,"level":3,"score":"11"},{"author":"Soklam","body":"Personally we haven't done panic buying, but we were trying to get enough to go 2-3 weeks. That's difficult with a family of 4.","isChecked":false,"level":3,"score":"10"},{"author":"momentsofnicole","body":"I started doing Instacart... now I'm making more money than my other job (flight attendant, I took a voluntary leave).","isChecked":false,"level":2,"score":"20"},{"author":"AllergicToNarcan","body":"If you do a Facebook search for Udemy Courses Free, there are a couple decent pages with lot of promos right now. Some courses are always free. Some have discounts to bring them to a few bucks, and some are being given away when they normally cost a couple hundred bucks. Use any spare time you can to start building skills in IT (essential services). Let's say you can squeeze in 10 hours a week in study and a couple more practicing what you learn. In a couple months, you can have what you need to start working help desk and tech support. Look for courses on Windows, Linux, and Mac, and on servers and networks, and IT security especially. I just added about 10 courses to the tune of over $1,000 due to the assorted \"Stay At Home\" promos, and I'm already a well experienced IT guy. So I skipped over a lot of courses below my level. Being mostly self-taught, I now make well over $30/hour and there is never a shortage of jobs anymore.\n\nOr maybe branch over to graphic design and photography touch up (not essential, but it's another skillset and classes are often available for free).","isChecked":false,"level":2,"score":"10"},{"author":"NoTrickWick","body":"Check out your local cable contractor. Contracts to run fiber/mainline are EXPLODING and are considered essential business.","isChecked":false,"level":2,"score":"8"},{"author":"GoldGoblin95","body":"A new laptop, lost my job due to the covid-19 stuff. Trying to edit my CV and apply for jobs only on my phone is a pain.","isChecked":true,"level":1,"score":"19844"},{"author":"Seanwabha","body":"There's an app called Resume Builder that makes well formatted CVs. Hopefully it helps","isChecked":false,"level":2,"score":"5598"},{"author":"GoldGoblin95","body":"I'll give it a go, cheers","isChecked":false,"level":3,"score":"2384"},{"author":"tandaman1986","body":"By the way, if you need any tips and/or want your resume to be proof read, I'm happy to voluntarily provide my assistance. In times like these, I wont be thinking to charge or ask for anything in return. Happy to help!","isChecked":false,"level":4,"score":"2136"},{"author":"screaminpanties","body":"Same, if you'd like several different opinions on your resume don't hesitate to contact me. Obviously at no charge. Best of luck!","isChecked":false,"level":5,"score":"545"},{"author":"i_love_pencils","body":"It’s reassuring that people can look to you in their time of need u/screaminpanties.","isChecked":false,"level":6,"score":"197"},{"author":"Neuroshmuck","body":"Take my poor man's gold 🏅","isChecked":false,"level":5,"score":"20"},{"author":"orangegurg","body":"Same here. Just PM.","isChecked":false,"level":5,"score":"12"},{"author":"blackbeard12","body":"Google Docs also have great templates and the app is very functional.","isChecked":false,"level":4,"score":"454"},{"author":"fresh-cucumbers","body":"Google Docs is the bees knees for document creation.  To preview what it would like when sending, check out a print preview, then when you’re happy save as a PDF.","isChecked":false,"level":5,"score":"17"},{"author":"jean_tastic","body":"Thanks for the suggestion. I spent several hours this week redoing mine and the formatting was challenging. This makes it so easy!","isChecked":false,"level":3,"score":"162"},{"author":"mchrisl","body":"Dm your address I’ll send you a chromebook, I got it free with the new pixel but haven’t used it. Just pass it on to someone who needs it more after your done with it.","isChecked":false,"level":2,"score":"18495"},{"author":"JimHalpertSmirk","body":"You're a great person. Hope you have a good weekend.","isChecked":false,"level":3,"score":"3312"},{"author":"GKaplan0","body":"No kidding. If this is legit, you sincerely have a great heart. Please don't change. Humanity needs more folks like you.","isChecked":false,"level":4,"score":"1888"},{"author":"QuantumOfSilence","body":"/u/GoldGoblin95, if you actually receive the laptop, please post proof on a sub like /r/pics or something. I want to see more compassionate moments like these.","isChecked":false,"level":5,"score":"1633"},{"author":"GoldGoblin95","body":"I absolutely will!","isChecked":false,"level":6,"score":"939"},{"author":"that_one_dude7861","body":"Save the post. Just update this post with it. That'd be dope","isChecked":false,"level":7,"score":"268"},{"author":"YoungOrthodox95","body":"I am more emotionally invested in this than I am about any Netflix series.","isChecked":false,"level":6,"score":"316"},{"author":"GoldGoblin95","body":"It's a cliffhanger for now, waiting to hear back","isChecked":false,"level":7,"score":"18"},{"author":"PamBeasleysBarrette","body":"I see your username and I appreciate it.","isChecked":false,"level":4,"score":"18"},{"author":"CaptainDickFarm","body":"Is there a sainthood medal?","isChecked":false,"level":3,"score":"353"},{"author":"Reaper_Messiah","body":"No, but there’s sainthood.","isChecked":false,"level":4,"score":"20"},{"author":"Wishy-wash-pots","body":"r/wholesomecomments","isChecked":false,"level":3,"score":"34"},{"author":"laxxxi","body":"You sir are a true hero.....🥇🥇🥇","isChecked":false,"level":3,"score":"60"},{"author":"palishkoto","body":"Technological idiot here, but is it possible to link a phone to another screen like a TV?\n\nETA: To the people asking me what phone I have, this was a suggestion to the OP. I'm not trying to connect my phone to a screen.","isChecked":false,"level":2,"score":"678"},{"author":"Blueshark25","body":"You could cast your phone to a tv, but I can't think of that being helpful without a keyboard and mouse. I also am not sure if that means casting just video or the actual phone screen. I don't really feel like finding that out.","isChecked":false,"level":3,"score":"539"},{"author":"Holundero","body":"You can cast your screen to the TV and ad a wireless mouse and keyboard to your phone. That should work. A raspberry pi might also be a cheap alternative to a new laptop if you already own a TV or monitor.","isChecked":false,"level":4,"score":"436"},{"author":"Blueshark25","body":"There's the non-lazy answer I was looking for someone to spoon-feed me. Good job u/Holundero not all heros wear capes. You know, unless you're wearing a cape... I can't see what you're doing.","isChecked":false,"level":5,"score":"238"},{"author":"ThePerpetualGamer","body":"FBI agent here, I can confirm he is NOT wearing a cape.","isChecked":false,"level":6,"score":"28"},{"author":"Two-Ninety290","body":"Aren’t you supposed to be working from home?","isChecked":false,"level":7,"score":"11"},{"author":"lefthandedchurro","body":"That’s actually *all* they are wearing.","isChecked":false,"level":6,"score":"9"},{"author":"LameAttendant","body":"I know with a chromecast you can, screen mirroring. Nowadays I think smart tvs have that option on their own and it's good for watching movies however it's not as smooth as it is on your phone most of the time","isChecked":false,"level":3,"score":"70"},{"author":"Frankeex","body":"Happy to help you out if you want me to do it for you. PM me details if so.","isChecked":false,"level":2,"score":"179"},{"author":"sspine","body":"You can get a cheap laptop for 100-200. You aren't going to be able to do much with it but editing a text file is pretty easy.","isChecked":false,"level":2,"score":"88"},{"author":"peterfromfargo","body":"I just bought a chrome book on swappa for $86. My daughter is using it for at home school.","isChecked":false,"level":3,"score":"95"},{"author":"mama_meow","body":"I feel ya buddy","isChecked":false,"level":2,"score":"36"},{"author":"bannanainabucket","body":"I'll buy you a laptop","isChecked":false,"level":2,"score":"401"},{"author":"AthirstyLion","body":"I really wish this is true. \nAnd if it’s, accept the gift. Once you get a job, you can help someone else. That’s how the world should work.","isChecked":false,"level":3,"score":"328"},{"author":"BecauseItAmusesMe","body":"Upvoting for unconventional use of 'it's'","isChecked":false,"level":4,"score":"520"},{"author":"srcircle","body":"r/usernamechecksout","isChecked":false,"level":5,"score":"17"},{"author":"Bigmo4","body":"Upvoting for acknowledging","isChecked":false,"level":5,"score":"39"},{"author":"is_it_controversial","body":"it's unconventional, but is it correct? I have my doubts.","isChecked":false,"level":5,"score":"9"},{"author":"nmsjtb0308","body":"I'll help cover the cost.","isChecked":false,"level":3,"score":"8"},{"author":"Quipsilver","body":"Rent.","isChecked":true,"level":1,"score":"2598"},{"author":"PMForDickGraysonPics","body":"You'll get your rent when you fix this damn door!","isChecked":false,"level":2,"score":"1308"},{"author":"Perfide01","body":"Pizza time.","isChecked":false,"level":3,"score":"141"},{"author":"Ferriox","body":"I’m not paying for those","isChecked":false,"level":4,"score":"44"},{"author":"MrSemiFunny","body":"r/raimimemes","isChecked":false,"level":3,"score":"40"},{"author":"oatwife","body":"Asking my mom to let me borrow the rent money filled me with gratitude that I have that safety net, and sorrow (and shame, really) that I had to touch my 77-year-old little mom for $1000.","isChecked":false,"level":2,"score":"491"},{"author":"VilleKivinen","body":"If she requires you to touch her your rent, your relationship might not be the healthiest.","isChecked":false,"level":3,"score":"567"},{"author":"BarkingDogey","body":"Mom has needs too okay","isChecked":false,"level":4,"score":"210"},{"author":"Accurate_Praline","body":"Now shut up and give her a nice long hug.","isChecked":false,"level":5,"score":"16"},{"author":"sofingclever","body":"I feel you so much on that one.  I take pride in the fact that I've never asked my parents for a penny in my adult life.  I had to do it for the first time a couple days ago.  I'm both so grateful to have that safety net and so ashamed I had to do that.","isChecked":false,"level":3,"score":"20"},{"author":"Sochitelya","body":"I still feel mildly guilty that my mom had to loan me nearly $2K a few years back for unexpected car repairs (as in, my brakes literally fell apart when the mechanic went to inspect them so I couldn't exactly put off the repairs).  I paid her back, of course, but it was a bit embarrassing to be in my thirties and need to hit up my mom for cash.\n\nI do my best to pay her back in other ways too.  Before all this COVID shit, I'd go up every couple of weeks to cook her and my brother dinner, I pick up treats for her when I'm out shopping and see something she likes on sale, I bring her ARCs of books from my job.","isChecked":false,"level":3,"score":"10"},{"author":"SFButts","body":"DM me your address and I'll send you the DVD","isChecked":false,"level":2,"score":"10"},{"author":"allihaveiswords","body":"Therapy and the proper meds","isChecked":false,"level":1,"score":"3199"},{"author":"strangekittykat","body":"Preach. I could only ever afford crappy therapists. Went to a psychiatrist a few months ago but boy, it is EXPENSIVE. The fact that my family doesn't know makes it worse, since they wouldn't support me taking meds. Life is tough.","isChecked":false,"level":2,"score":"550"},{"author":"eltibbs","body":"This is me, my family doesn’t know and would never support the medication I take for depression and anxiety. I’m lucky that my husband is on board with it and is very supportive.","isChecked":false,"level":3,"score":"89"},{"author":"astro_tuff","body":"I feel y'all. I was stuck with the state programs for a long time and it almost did as much damage as it did good. I finally saved up to work with someone to get my medications straight and I've never been better. Thankfully state insurance covers medications or I'd be paying 600$ a month for them.","isChecked":false,"level":3,"score":"11"},{"author":"T00Bytoon","body":"I take meds so I can function like a person. Thanks to the American medical system my antipsychotics cost HUNDREDS for no good reason than “the deductible”. \nAnd if I do pay that, it’ll just go up hundreds next year! Ugh...","isChecked":false,"level":2,"score":"48"},{"author":"thatniceguy_","body":"Everyone who says to go to therapy, are they aware how expensive it is?","isChecked":false,"level":2,"score":"35"},{"author":"meltingeggs","body":"If they have good insurance, they probably don’t know how much it actually costs. I have no idea what my therapist actually charges, but I know I wouldn’t be able to afford it without insurance.","isChecked":false,"level":3,"score":"37"},{"author":"OhCrapItsCori","body":"Therapist here! If you have Medicaid, therapy and med management are free in agencies that offer both that take Medicaid- you have to get a referral through your doctor. Also, alot of us are doing telemental health right now, and some insurances are waiving copays right now (my copay for my own personal counseling is usually $16 😬). Worth looking into during this crappy time.","isChecked":false,"level":2,"score":"7"},{"author":"simosaurrrrr","body":"To pay off my student debt","isChecked":true,"level":1,"score":"10477"},{"author":"sinclairish","body":"This probably should have been my first response.","isChecked":false,"level":2,"score":"1107"},{"author":"BadgerTheWitless","body":"Too late, one wish per person","isChecked":false,"level":3,"score":"19"},{"author":"Still_Fat_Man","body":"I've given up on that.  \n  \n\"I DECLARE BANKRUPTCY!\"  \n  \nEdit: Guys, I am well aware that the student loan debt I have will follow me to the grave. It's a joke from The Office I wanted to make. Relax or I'm going to lose my freakin mind!","isChecked":false,"level":2,"score":"2117"},{"author":"GiantWhiteCohc","body":"You can't just say it.","isChecked":false,"level":3,"score":"760"},{"author":"malogan82","body":"He didn't just say it, he declared it.","isChecked":false,"level":4,"score":"1317"},{"author":"heartbeats","body":"Nobody just picks up “Get Out of Jail Free” cards. Those things cost thousands!","isChecked":false,"level":5,"score":"34"},{"author":"xLabGuyx","body":"*laughs in billion dollar corporation*","isChecked":false,"level":6,"score":"7"},{"author":"IpromithiusI","body":"Student Loans don't get written off with bankruptcy, think they closed that around 2004.\n\nEdit: This was referring to the UK at least.","isChecked":false,"level":3,"score":"479"},{"author":"Lvgeecoleman","body":"Does student loans ever go away? Maybe I should fall in love with it.","isChecked":false,"level":4,"score":"305"},{"author":"atstory1","body":"Only in death","isChecked":false,"level":5,"score":"205"},{"author":"DaveNay","body":"Unless there is a co-signer","isChecked":false,"level":6,"score":"143"},{"author":"termest","body":"Nope. For federal loans it discharges on death and doesn't transfer to the endorser or cosigner. The only catch is that the discharge is treated as income and taxes on that are applied to the estate.\n\nFor private loans, it depends on the lender. In my case, I refinanced, and there is a provision in the contract where my wife is removed as a cosigner upon providing proof of my death, and the loan is discharged just like a federal loan.","isChecked":false,"level":7,"score":"29"},{"author":"somethingclever76","body":"I was able to get my parents released as cosigners on my private loans a few months ago. Had to meet the company's requirements and then do the proper paper work, a one page document asking to release them. My brother has loans from the same company, but got denied in his request.","isChecked":false,"level":8,"score":"12"},{"author":"ElizabethDangit","body":"If you’ve got a federal student loan and are in an income based repayment plan, then after 25 years the remaining debt is forgiven, BUT the forgiven amount is taxed as income for that year.","isChecked":false,"level":5,"score":"86"},{"author":"SimilarOrdinary","body":"So... what happens if you can’t afford that either? Another payment plan? Asking for a me.","isChecked":false,"level":6,"score":"12"},{"author":"ikyikthe1st","body":"Payment plan to the IRS...yayyyy","isChecked":false,"level":7,"score":"10"},{"author":"iscream80","body":"Wait, is this for real?  I’ve definitely never heard about this.  I’m doing the income based repayment plan, but not for the entire 12-14 years I’ve been paying it off - would it still count? \nI’ll go google but I feel like I’ve looked for every loophole there is and have never came across this possibility.","isChecked":false,"level":6,"score":"7"},{"author":"Doit2it42","body":"Paid off my student loan about a year early.  They bank had the gall to send my a statement saying I still owned $1.86.  I sent them a small box with 186 pennies.  It cost more in postage than the amount, but it was worth it for the catharsis.","isChecked":false,"level":2,"score":"163"},{"author":"Alrik","body":"Me too. I'm a little over halfway there. Only $120k to go!","isChecked":false,"level":2,"score":"76"},{"author":"Dave1mo1","body":"$240k for a law degree? Yikes. How long have you been out of school?","isChecked":false,"level":3,"score":"38"},{"author":"Alrik","body":"Graduated in 2010.\n\nIt was about $160k when I graduated, ballooned up because I was unemployed (then seriously underemployed) but still accruing that 8.5% interest for a few years.\n\nTaught media law for a few years (really loved teaching, but I wasn't tenure track, so I was making like $17k/yr), eventually fell back on my math degree and did other things. I'm a data scientist now.","isChecked":false,"level":4,"score":"50"},{"author":"manfromanother-place","body":"I'm looking to become a data scientist! Do you mind if I ask you a couple questions? (student loan/salary related)","isChecked":false,"level":5,"score":"13"},{"author":"lurkinmcdurkin","body":"It feels SO good when you do. Knocked out $103k and I REFUSE to take debt again. Except maybe a house.","isChecked":false,"level":2,"score":"23"},{"author":"brin722","body":"How long did it take?","isChecked":false,"level":3,"score":"9"},{"author":"goobermouth","body":"I feel you :( why did I get myself into 80k debt just to be a teacher? This is my life now","isChecked":false,"level":2,"score":"25"},{"author":"jerrygergichsmith","body":"That’s how much I have left after 8 years. Got an Engineering degree but I’m an Analyst now. I have to say Student Debt and the fear of $1k of my paycheck always going to loans is an eternal stress of my life.","isChecked":false,"level":3,"score":"14"},{"author":"ginajeans","body":"Same. Without this crippling debt I could actually be a valuable member of society.","isChecked":false,"level":2,"score":"9"},{"author":"TheDapperChangeling","body":"While I can *afford* it, I've been craving some good ol fashion strip mall chinese.\n\nYou know the type, the real shitty, one room with the mass bought chinese food, run by the crankiest chinese folks you ever met, always with some combination of lucky, dragon, and garden?\n\nMine closed a week into CV19, and I've been jonesing hard.","isChecked":true,"level":1,"score":"3699"},{"author":"deadlydimples25","body":"Fuuuck this made me crave a specific meal from a mall food court SO BAD. One day again","isChecked":false,"level":2,"score":"689"},{"author":"Strange_Vagrant","body":"I so want orange chicken and fried rice.","isChecked":false,"level":3,"score":"26"},{"author":"moongirli","body":"Yes! Our local closed as well, and I had gotten to the point where I was willing to order Panda Express online, only to find out that the mall where said Panda Express  is, has closed. Now the nearest Chinese Chinese anything is P.F. Chang's, which is good enough, but it's not the same.","isChecked":false,"level":2,"score":"173"},{"author":"MrVonJoniHimself","body":"Not sure why but the best chinese food usually always has a young boy and a young girl hanging out in a room seperated by make shift curtains using the education game device LeapFrog.","isChecked":false,"level":2,"score":"28"},{"author":"Ashrita2099","body":"I feel that. The moment this all started it seems like every place in my city that sold Chinese food closed over night. And I’ve wanted it so badly.","isChecked":false,"level":2,"score":"68"},{"author":"Raed-wulf","body":"We have a local place, called Seasoned Wok, and it’s run by the nicest lil ol lady you ever did meet and they closed shop right around the first CV case hit the East Coast. \n\nIf you’re out there Sushi Grandma, I miss you.","isChecked":false,"level":2,"score":"9"},{"author":"Flowerz4life","body":"Nintendo Switch.....","isChecked":true,"level":1,"score":"6155"},{"author":"69fatboy420","body":"I was in the same boat, until last year. My wife's good friend gave me a Nintendo Switch for my birthday. Such a wholesome dude! The best part is when they take their \"besties\" weekend trips away, I get tons of time to myself to enjoy it to its fullest.","isChecked":false,"level":2,"score":"4565"},{"author":"spratisafish","body":"Who's gonna tell him?","isChecked":false,"level":3,"score":"2929"},{"author":"forestfluff","body":"You implying that my man 69fatboy420 is being cheated on?","isChecked":false,"level":4,"score":"2491"},{"author":"JustThatGamer2006","body":"Ay, atleast he got the switch, right?","isChecked":false,"level":5,"score":"1271"},{"author":"Strange_Vagrant","body":"He probably cheats on it.","isChecked":false,"level":6,"score":"402"},{"author":"DyleanCuisine","body":"With an xbox","isChecked":false,"level":7,"score":"274"},{"author":"blundercrab","body":"It's the only one for him","isChecked":false,"level":8,"score":"111"},{"author":"MrColdArrow","body":"A small price to pay for salvation","isChecked":false,"level":6,"score":"66"},{"author":"hushhushsleepsleep","body":"Hey man, I’d just about let someone fuck my husband for a switch and some quiet time right now too.","isChecked":false,"level":4,"score":"547"},{"author":"Ayn_Otori","body":"That's what I did. Will recommend.","isChecked":false,"level":5,"score":"147"},{"author":"Freakychee","body":"I mean, getting cheated on sucks because of the betrayal and stuff but if you get at least something out of it that’s at least something.\n\nNow purposefully pimping out your spouse for a current gen game console sounds like somewhat of an even trade.","isChecked":false,"level":5,"score":"36"},{"author":"scratchy_mcballsy","body":"Let them do it twice. Might be the only way you get time to play it.","isChecked":false,"level":6,"score":"12"},{"author":"MrSpindles","body":"This reminds me of a post a few days ago where the poster mentioned \"my wife's boyfriend\" and then never came back while people speculated about consensual swinging and so on.","isChecked":false,"level":4,"score":"77"},{"author":"bigfatbaryon","body":"Sounds like he’s the one enjoying that switch to the fullest...","isChecked":false,"level":3,"score":"308"},{"author":"Ranwulf","body":"You are giving too much credit to the wife and very little to the Nintendo Switch.","isChecked":false,"level":4,"score":"24"},{"author":"jim_deneke","body":"He gave you a switch all right.","isChecked":false,"level":3,"score":"119"},{"author":"LynchMaleIdeal","body":"The ol’ switcheroony","isChecked":false,"level":4,"score":"10"},{"author":"Xelisyalias","body":"Did he let you sleep in the basement at their place too? Chad is such a nice guy I swear","isChecked":false,"level":3,"score":"238"},{"author":"WhackOnWaxOff","body":"Dale Gribble, is that you?","isChecked":false,"level":3,"score":"115"},{"author":"ShyGift","body":"My wife’s boyfriend said I could play switch all weekend!!","isChecked":false,"level":3,"score":"18"},{"author":"vietnams666","body":"Yep. My mom offered to pay for one for an early birthday present today and now they are all sold out haha. Just my luck.","isChecked":false,"level":2,"score":"204"},{"author":"Bozarn","body":"Try calling up local brick-and-mortar stores, or checking on sites like Brickseek if you're in the US.  If you're lucky, one of them might have some in stock.","isChecked":false,"level":3,"score":"15"},{"author":"bites","body":">brick-and-mortar stores\n\nI don't know where you are but video game stores aren't an essential company and are all shut down in this state.\n\nThey might have them in the store but they can't legally be open.","isChecked":false,"level":4,"score":"21"},{"author":"AmIajerk1625","body":"They could be talking about target, best buy, walmart etc.","isChecked":false,"level":5,"score":"13"},{"author":"andysaurus_rex","body":"Target, Best Buy, Walmart, etc all sell Switches and are open (I think Best Buy is open?)","isChecked":false,"level":5,"score":"10"},{"author":"mufasa526","body":"Target and Best Buy are 100% sold out as of a few days ago. Walmart has the price gouged 3rd party sellers.","isChecked":false,"level":6,"score":"13"},{"author":"WhiskyAtNoon","body":"Psst, hey tell ur mom to get me one....","isChecked":false,"level":3,"score":"28"},{"author":"fatcatavenger","body":"I kept refreshing Gamestop every hour last week and was able to get 2 for me and my friend. Just check!","isChecked":false,"level":3,"score":"8"},{"author":"CmdrTwig","body":"With Animal Crossing","isChecked":false,"level":2,"score":"730"},{"author":"aevirg","body":"Wow. Same.","isChecked":false,"level":3,"score":"147"},{"author":"beemolikes","body":"Me too to your same","isChecked":false,"level":4,"score":"62"},{"author":"Rhyzemz","body":"Omg sameeee exactly","isChecked":false,"level":3,"score":"13"},{"author":"arutakiarutaki","body":"I wanted to buy one due to boredom of self-isolation but then they are like $200 more expensive than the pre-corona price here in Japan.","isChecked":false,"level":2,"score":"122"},{"author":"WeirdOctopus","body":"Yes. They are sold out everywhere so people are selling them used for 500€+. I'm not desperate or willing to support this greed. So, well, no Switch for me.\n\nEdit: I just checked and they're 560€+ today.","isChecked":false,"level":2,"score":"65"},{"author":"_Supernaltub99","body":"I can afford one they’re just sold out everywhere near me :(","isChecked":false,"level":2,"score":"16"},{"author":"awkook","body":"Dont buy a marked up one either. Sucks tho i could buy one too, but all sold out","isChecked":false,"level":3,"score":"10"},{"author":"redheaddomination","body":"SAME.  all of my friends are playing animal crossing and i'm just... alone doing laundry","isChecked":false,"level":2,"score":"28"},{"author":"thephotographer321","body":"When I so this tread right away I thought of commenting a nitendo switch.","isChecked":false,"level":2,"score":"11"},{"author":"Bangersss","body":"Yeah I really can't justify buying one right now, seeing as I'm currently out of work with slim chance of finding anything in my industry thanks to Covid.","isChecked":false,"level":2,"score":"28"},{"author":"Autumn-Moon","body":"I can afford one just can't find one","isChecked":false,"level":2,"score":"10"},{"author":"DiasJ9589","body":"A dog","isChecked":false,"level":1,"score":"1412"},{"author":"NebuLiar","body":"Me too! I could afford the dog, but I have to work all the time and my house is too small for a big fluffy one.","isChecked":false,"level":2,"score":"66"},{"author":"Teacup_Cannibal","body":"In the meantime, please enjoy my big fluffer [dogs](http://imgur.com/gallery/WiUJgcW)","isChecked":false,"level":3,"score":"56"},{"author":"st0pmakings3ns3","body":"Consider them enjoyed","isChecked":false,"level":4,"score":"24"},{"author":"oliwekk","body":"For many years a thought of being able to afford a dog one day kept me going. My family and friends were telling me it's a terrible idea and I won't be able to do it by myself and the dog will end up with my parents. Almost a year ago, I was feeling so alone and I decided to create a temporary home for a dog. I adopted her forever after few weeks and it has been great, my life has become so much better and having her gives me so much joy during this trying times. Dog tax : http://imgur.com/gallery/MwDtbAU","isChecked":false,"level":2,"score":"19"},{"author":"Lurkymclurkering","body":"A couch. The only furniture I own is my desk chair and some random dining chairs I got at a yard sale.\n\nActually, I don’t have a table either, but I need a couch. I don’t even want a new one - just a comfy one will do.\n\nNot in a hurry though. I’ll get one eventually.\n\nEdited: I went for a nap - holy fuckadoodle, Reddit! 9000+ upvotes, over 300 comments and close to 40 messages.\n\nI love all of you! To answer the zillion questions: I’m in central Alberta, Canada. I thank you for your offers and suggestions, but I’m self-isolated due to lung and brain issues (I’m healthy now and need it to stay that way!). I didn’t expect such a crazy outpouring of suggestions and offers. \n\nYou are all incredible. Stay healthy!!","isChecked":true,"level":1,"score":"12392"},{"author":"ixtothesiren","body":"Check facebook market. People locally might be giving away furniture for free if they're moving. I found that frequently, and it's how I got all my first furniture sets. Just make sure you check it all thoroughly for any signs of bed bugs, and never take anything that's been sitting outside. \n\nYou'd be surprised by the quality of stuff people just want to throw away.","isChecked":false,"level":2,"score":"3636"},{"author":"Josh_The_Joker","body":"Came here to say this. When my wife and I moved into our first apartment we checked Facebook market constantly. Ended up getting a pretty nice sectional for $250. New it would have been $1000-1500+. And like others said, a lot of times it’s free. I got a super nice hardwood desk for free. Felt like I was taking advantage of them by not paying.","isChecked":false,"level":3,"score":"1171"},{"author":"jewsNbrews","body":"Some people look at it as better than paying someone to trash it or move it if not truly needed. I have usually offered to give them money to buy dinner on me. Some take it, some don't.","isChecked":false,"level":4,"score":"483"},{"author":"nomorerainpls","body":"I’d rather give something to someone who can get use from it than toss it or pay someone to haul it away.\n\nFunny thing is whenever I post stuff on Craigslist for free i either get no response at all or people are just really flaky, saying they’ll come at a certain time and then don’t show up. I found if I post the same thing but for like $5 people will beat a path to my door believing they’re getting an amazing deal.","isChecked":false,"level":5,"score":"125"},{"author":"clickx3","body":"This is true. I have a lot and I would rather give it away then see it trashed.","isChecked":false,"level":5,"score":"80"},{"author":"thebigenlowski","body":"Some people get satisfaction out of giving something away for free.","isChecked":false,"level":5,"score":"9"},{"author":"Grimmginger","body":"I mean I'd wait till this all blows over","isChecked":false,"level":3,"score":"10"},{"author":"A7MOSPH3RIC","body":"Craigslist has them for free","isChecked":false,"level":2,"score":"375"},{"author":"resistible","body":"The free ones sometimes come with bed bugs.  Just a heads up.","isChecked":false,"level":3,"score":"528"},{"author":"JustMyAura","body":"And, Sofas come with a resident pet snake that for some reason the previous owner just couldn't dislodge it therefrom. So, at night when you're sitting on it enjoying your latest binge-watch and you notice something slithering from thereunder and across your floor, you will finally make the connection as to why the sofa was free!","isChecked":false,"level":4,"score":"161"},{"author":"Bastrat9","body":"Free snake would be cool tbh","isChecked":false,"level":5,"score":"12"},{"author":"Sulfate","body":"A free boop noodle? Sign me up!","isChecked":false,"level":5,"score":"11"},{"author":"Raiptwice","body":"Open the door. Let the critter crawl outside. Close the door. Done.\n\nMore seriously, how have you handled it?","isChecked":false,"level":5,"score":"19"},{"author":"Aneargman","body":"Put it in the tub and clean him up","isChecked":false,"level":6,"score":"16"},{"author":"Bananacowrepublic","body":"But him dinner, open a bottle of Pinot noir, add some smooth jazz to the mix and what happens happens","isChecked":false,"level":7,"score":"13"},{"author":"ellewoodsismyhero","body":"Snake jazz","isChecked":false,"level":8,"score":"11"},{"author":"SC487","body":"Went to look at a free couch on CL. Landlord had a tenant leave it. If I were homeless, I would have slept on the ground before touching that thing.  Pretty sure sitting on it would have give me 4 STD’s and gotten me pregnant...and I'm a guy.","isChecked":false,"level":4,"score":"17"},{"author":"Lurkymclurkering","body":"I think Craigslist is an American thing? I’ve never used it.","isChecked":false,"level":3,"score":"185"},{"author":"is_a_cat","body":"Where in the wod are you? Here in Australia we have gumtree. Canada, nz  have their own version too. I'm sure every country has something. Maybe freecycle","isChecked":false,"level":4,"score":"146"},{"author":"Not_aMurderer","body":"Generally in canada you have better luck with kijiji than craigslist","isChecked":false,"level":5,"score":"135"},{"author":"A_random_bi_girl","body":"Yup. I almost got a kitten from kijiji. They have like  everything","isChecked":false,"level":6,"score":"8"},{"author":"732","body":"A kijijitten you say?","isChecked":false,"level":7,"score":"21"},{"author":"A_random_bi_girl","body":"Omg totally a kijijiten. I cant believe I dodnt think of that. You, are a genius!","isChecked":false,"level":8,"score":"7"},{"author":"i-swallow-lightbulbs","body":"Drawing tablet. I want to draw, yet erasing ruins my drawings, since I make alot of mistakes","isChecked":false,"level":1,"score":"1162"},{"author":"PoopyKlingon","body":"This might sound weird, but don’t erase. If you don’t like the drawing, just move onto the next page in your sketchbook, thats what a sketchbook is for. I draw for a living, and trust me I don’t like everything I draw.","isChecked":false,"level":2,"score":"777"},{"author":"forestfluff","body":"This is a good idea if you can afford to buy a lot of sketchbooks. :(","isChecked":false,"level":3,"score":"249"},{"author":"Agent_staple","body":"Buy the cheapest pack of a4/a3 printer paper and use that. They're sketches not fine art.\n\n&#x200B;\n\nIf you havent burnt through a pack of printer paper you probably shouldn't be buying sketchbooks.\n\n&#x200B;\n\nFrom someone who's wasted way too much money on nice sketchbooks and not enough time drawing. Besides all my favourite pieces are on random leafs of paper in a box, sketchbooks just add pressure, this urge to make things perfect","isChecked":false,"level":4,"score":"373"},{"author":"addro19","body":"Came to say this, my son draws and burns through paper so stopped buying sketch pads","isChecked":false,"level":5,"score":"106"},{"author":"C-Rock","body":"I loved the story about Chuck Jones (famous Warner Bros. animator) on paper when he was a kid.  He never ran out of paper to draw on b/c his father tried and failed at numerous job/businesses.  Every time he ordered new stationary and letterhead.  When things fell apart the paper would get passed on to Chuck.  So he was constantly drawing while growing up.","isChecked":false,"level":5,"score":"40"},{"author":"thebestdogeevr","body":"I used cue cards, there were hundreds of them in my desk, back side has no lines. Only downside is they're small","isChecked":false,"level":5,"score":"14"},{"author":"Boo_Jay","body":"\\>  Besides all my favourite pieces are on random leafs of paper in a box,  sketchbooks just add pressure, this urge to make things perfect \n\nTHIS","isChecked":false,"level":5,"score":"12"},{"author":"anjilanaka","body":"Don’t think of it as a one piece per page deal assuming that’s what you might be doing.  Just draw in empty space wherever you find it.  I look back at my old sketchbooks from middle school and high school and cringe at the amount of wasted paper because I thought if a piece was going to be good it needed to have its own page but that is not what sketchbooks are for.\n\nIMO don’t erase and don’t retrace.","isChecked":false,"level":4,"score":"11"},{"author":"Rikkalizer","body":"&#x200B;\n\nThere are cheap ones out there, great for those who just starting to get into digital arts.","isChecked":false,"level":2,"score":"86"},{"author":"is_a_cat","body":"You can get a usb lightbox for under $10. Then do your sketch on one sheet of paper, put it on the lightbox with another sheet for your clean art","isChecked":false,"level":2,"score":"77"},{"author":"colbiekellay","body":"I have an old wacom bamboo fun tablet (CTE450K) if you’re in the US and want it (free, i’ll cover shipping!). Not the most cutting edge model but works fine if you want something simple.","isChecked":false,"level":2,"score":"23"},{"author":"aFineMadness","body":"Draw lighter lines and get a good eraser. Draw the lines that make you feel good, then go over them again in the end to darken them up.","isChecked":false,"level":2,"score":"9"},{"author":"Mourning_Gecko","body":"Uhh don't know if you'll see this, but I have an xp pen artist 12 tablet that I'm not going to be using. Far as I know works well. If you can pay shipping I can send it to you.","isChecked":false,"level":2,"score":"9"},{"author":"ginydapig","body":"Draw with a pen. You'll get better at hiding your mistakes opposed to fixing them","isChecked":false,"level":2,"score":"9"},{"author":"EtherealSkyy","body":"Electric guitar","isChecked":false,"level":1,"score":"729"},{"author":"My_Friend_Johnny","body":"Just sent you an air guitar. During the next thunderstorm stand outside for the electric feeling.","isChecked":false,"level":2,"score":"805"},{"author":"Bad-Brains","body":"Just venmoed air pedals.","isChecked":false,"level":3,"score":"197"},{"author":"archa1c0236","body":"*Bill and Ted air guitar sound effect*","isChecked":false,"level":3,"score":"17"},{"author":"ladymonro9","body":"The most underrated comment I’ve seen in a very long time.","isChecked":false,"level":3,"score":"10"},{"author":"DrRickSanchezPHD","body":"DM me. I have several and I can’t use all of them. If you are close or we can work something out I’d be happy to send you one for free","isChecked":false,"level":2,"score":"148"},{"author":"EtherealSkyy","body":"That's so awesome! But I just wouldn't feel right about it as I'm sure there is someone else out there who wants to play even more and doesn't have the chance. Thank you so much for the offer though!","isChecked":false,"level":3,"score":"14"},{"author":"blanklanklank","body":"Half the people that can afford a guitar won't treat it right. The ones that do treat them right would rather give them to a good home then sell them to the wrong one.","isChecked":false,"level":4,"score":"23"},{"author":"Gerryislandgirl","body":"Have you tried a pawn shop. A lot of guitars end up there.","isChecked":false,"level":2,"score":"80"},{"author":"Beeg_Beeg_Beeg_Yoshi","body":"Always, always check out pawn shops. Got my first electric guitar and combo amp for $110 there.","isChecked":false,"level":2,"score":"21"},{"author":"MomsSpaghetti589","body":"If you're just learning, Amazon sells a very budget brand called Glarry. Their guitars are not anything a professional would be impressed by, but they actually aren't bad at all. Certain colors you can get for like $70, with everything you need included.","isChecked":false,"level":2,"score":"15"},{"author":"DemonLinus","body":"Whats your favorite riff?","isChecked":false,"level":2,"score":"10"},{"author":"diverfan88","body":"I have an extra electric guitar I don't play. In great condition. I don't even know how to play, and I have 3 guitars! I'm in metro Detroit, let me know!","isChecked":false,"level":2,"score":"9"},{"author":"daltonwright4","body":"Where are you located?","isChecked":false,"level":2,"score":"7"},{"author":"MimikyuToo","body":"Living... like we have rent. No money for other bills or groceries. We’re eating shit I throw together or expired stuff 🤷‍♀️","isChecked":false,"level":1,"score":"761"},{"author":"leleisgreat123","body":"Send me your paypal I'll paypal you some $$$ for food or buy you a voucher from somewhere just let me know.","isChecked":false,"level":2,"score":"876"},{"author":"PotaTribune","body":"r/humansbeingbros","isChecked":false,"level":3,"score":"208"},{"author":"Idiotian","body":"There's so much wholesomeness in this entire askreddit, I love it.","isChecked":false,"level":4,"score":"63"},{"author":"KronosX3T","body":"You a real one","isChecked":false,"level":3,"score":"12"},{"author":"KronosX3T","body":"You a real one","isChecked":false,"level":3,"score":"8"},{"author":"baitnnswitch","body":"Have you signed up for SNAP food stamps (if you're in the us) or found local food banks?  Both can be a godsend","isChecked":false,"level":2,"score":"179"},{"author":"Shitty-Coriolis","body":"This!!! It's not that hard! You can do it online and you get a little debit card so it doesn't feel awkward at the store. \n\nPlease don't go hungry. We all need help sometimes.","isChecked":false,"level":3,"score":"65"},{"author":"LynnisaMystery","body":"We have this months rent and next without relying solely on my gf’s student loans (tuition was covered by financial aid but school materials and living costs not) to keep the apartment. Her school has a small food pantry that won’t feed you for the week but it gives you some nice splurge items (we got a single can of pepsi this week and we were both really excited) and I’m about to go to a food distribution event today to stock up some more. Google your city and food distribution and see what you can find. A lot of churches are also handing out things like Panda Express or sandwiches daily. You can hop between different mega churches to take advantage of these and get lunch taken care of.","isChecked":false,"level":2,"score":"17"},{"author":"TabbazKon","body":"A Hasselblad camera","isChecked":false,"level":1,"score":"813"},{"author":"Aethien","body":"When I was in photography school we got to play with those old hasselblad cameras, god they have [the most satisfying shutter sounds](https://www.youtube.com/watch?v=rHE0_jmB-F0) in the world.","isChecked":false,"level":2,"score":"276"},{"author":"Echo63_","body":"Ever heard the soft “thwap” of a cloth shuttered Leica ?\n\nWould love a Hassy too, but I prefer digital to film, and adapting a digi back to a classic black/chrome hasselblad is a pain, and the newer digi models are a bit soulless.","isChecked":false,"level":3,"score":"112"},{"author":"thekrisnelson","body":"ooooh, I love the quiet \"shhhhush\" of a Leica shutter. first time I used my grandpa's M3, I fell in love","isChecked":false,"level":4,"score":"13"},{"author":"divat10","body":"My dad has one \n\nI only know it is hella expensive and that i can't touch it","isChecked":false,"level":2,"score":"12"},{"author":"alice_austen","body":"I know you’ve probably gotten this advice 1000 times, but it really pays off to just watch eBay every day. And consider buying it in pieces. I was able to get the body of my Mamiya RZ 67 for $100.","isChecked":false,"level":2,"score":"8"},{"author":"paisleyhaze","body":"Not a photographer, so I'm curious. What are the advantages of a Hasselblad?","isChecked":false,"level":2,"score":"8"},{"author":"joesmith0789","body":"It’s essentially the Rolex of cameras. Simple, well-built, reliable, and well expensive.","isChecked":false,"level":3,"score":"18"},{"author":"MainSteamStopValve","body":"Also iconic, there's no mistaking a 500c.","isChecked":false,"level":4,"score":"10"},{"author":"HighsandLows-Bipolar","body":"Mental healthcare","isChecked":false,"level":1,"score":"2047"},{"author":"HighsandLows-Bipolar","body":"And blue hair","isChecked":false,"level":2,"score":"463"},{"author":"ETST3V3","body":"blue hair is mental healthcare 😗","isChecked":false,"level":3,"score":"463"},{"author":"itxhamad","body":" \n\nTo not have to have a job.","isChecked":false,"level":1,"score":"2000"},{"author":"ilonelytylenoli","body":"Right there with you.\n\nI openly admit the job I've had for the past six years has not been good for me. Physical health is okay, but not good. Social life is non-existent.\n\nBut at the very least it does pay well. If I make it another 5 or so years, I might be able to stop working entirely. Or at least take low paying, lower stress job I enjoy and still not worry about money. Not sure I can do it, but it sure is tempting to try.\n\nI've got 6 weeks paid vacation in the bank, go from accumulating 3 weeks PTO to 4 weeks PTO next year, and have the option to take a 3 month (unpaid) sabbatical somewhere in there. So almost a year of that 5 years wouldn't even be actual work.\n\nHard to imagine switching to a new job and getting that good of a deal.","isChecked":false,"level":2,"score":"394"},{"author":"red-panda-escape","body":"I love my job and I’d still rather not work","isChecked":false,"level":3,"score":"51"},{"author":"zach8vb","body":"I recently quit a job that paid great, had incredible benefits, and was straight up easy because the boss was a psychopath. My mental health was so fucked with that I started going to therapy to deal with it. If I had stayed, I probably could've bought the business.\n\nI took a 20k pay cut and work a job that's much more involved and has poorer benefits. 1000000% worth it.\n\nNo amount of money I'd worth your personal well being. Get after it, friendo. Good luck!","isChecked":false,"level":3,"score":"17"},{"author":"howdoichangemywife","body":"I am from Nepal I wanted to economically serve for those people who are suffering badly by this covid crisis.","isChecked":false,"level":1,"score":"741"},{"author":"poopellar","body":"You're a good dude, howdoichangemywife","isChecked":false,"level":2,"score":"397"},{"author":"sometimesimakeshitup","body":"Divorce","isChecked":false,"level":3,"score":"16"},{"author":"HouseCarder","body":"Rimjobsteve","isChecked":false,"level":3,"score":"9"},{"author":"Adhi_Sekar","body":"A PC that will support cyberpunk 2077.","isChecked":false,"level":1,"score":"842"},{"author":"reee576","body":"But. Not the actual game right?","isChecked":false,"level":2,"score":"43"},{"author":"Adhi_Sekar","body":"I can afford the game.","isChecked":false,"level":3,"score":"74"},{"author":"Idan7856","body":"I can't afford a PC that can run solitaire dude","isChecked":false,"level":2,"score":"10"},{"author":"Terradactyl87","body":"Well, currently I'd like to afford the $4,200 a month rent for my small business while we're closed due to coronavirus... But my big dream/goal is to buy and restore a castle in France or Italy.","isChecked":false,"level":1,"score":"1048"},{"author":"tickettoride98","body":"Do you have employees? You can apply for a SBA Payroll Protection Program (PPP) loan. The loan is forgiven (so free money) as long as it's spent (for the 8 weeks after receiving it) on payroll and/or rent and utilities. There's also the Economic Injury Disaster Loan (EIDL), which currently has up to a $10k advance which doesn't have to be repaid.\n\nTake advantage of the relief bill.","isChecked":false,"level":2,"score":"518"},{"author":"ridicalis","body":"Second that, the money is there for helping businesses like yours survive. I looked into it, but it felt wrong to try claiming it since my business (sole proprietorship) is not suffering very much, and I would rather the limited funds go to those in need.","isChecked":false,"level":3,"score":"246"},{"author":"colellasj","body":"You actually don’t even have to have employees to apply for this program! I work for the SBDC (a program of the SBA) and have literally taught hundreds of people about this program this week.\n\nOP - if you have questions about this program please let me know and I will help however I can.","isChecked":false,"level":3,"score":"17"},{"author":"ChickenAndGin","body":"Watch a programme called 'escape to the chateau'. It's a British couple who buy a rundown chateau in France and do it up. Its brilliant. The guys an engineer and his wife's a designer and the end result is absolutely unbelievable. Well worth a watch.","isChecked":false,"level":2,"score":"15"},{"author":"-basedonatruestory-","body":"To be debt free.","isChecked":false,"level":1,"score":"273"},{"author":"franckdemda","body":"Pray for hyperinflation. wait...","isChecked":false,"level":2,"score":"7"},{"author":"lucagumede","body":"This will probably get buried but for me its food and shelter\n\nI live in South Africa and the current lockdown could not have come at a worse time for me. I had just landed a new job and haven't even made 3 months and we had to close. I have 2 bowls of cereal left and only money to post next months rent. I'm not baiting for handouts,  I just wanted to vent and let people know that this pandemic is affecting people beyond health wise.\n\nEdit: wow! I am overwhelmed by the help I've received from strangers from all over, rand-to-dollar exchange means I have enough to cover another month's rent, food and utilities \n\nI cannot stress how much this means to me, and hope others will see and help them appreciate what they have, I will sleep well for the next few weeks. Thank you and stay safe","isChecked":false,"level":1,"score":"510"},{"author":"dontdoughtyphysics","body":"My daughter also lives in South Africa and is in the same boat you are in, I feel your pain...and miss my daughter.","isChecked":false,"level":2,"score":"143"},{"author":"stanriA5","body":"I'm also in ZA. PM me your bank details and I'll EFT you some cash. I know how hard it can be.","isChecked":false,"level":2,"score":"137"},{"author":"lucagumede","body":"I cannot thank you enough for this. Many blessings to you and your family","isChecked":false,"level":3,"score":"77"},{"author":"Iam_Wannabe","body":"Holy shit this is like third comment about helping people. I love you guys. You're the heroes of this society.","isChecked":false,"level":3,"score":"45"},{"author":"new_mexicunt","body":"Do you have Venmo? I don't have much myself, but I have food. I figure that means I have enough to offer.","isChecked":false,"level":2,"score":"17"},{"author":"Olde94","body":"This thread is north and south. Just saw “a new gaming pc”. To see these back to back really shows how our lives are certainly not always the same","isChecked":false,"level":2,"score":"9"},{"author":"None","body":"[removed]","isChecked":false,"level":1,"score":"159"},{"author":"AgentPurple","body":"Hear me out - try applying for a job at the store. If you get the job, you can help them while they’re there and probably get a employee discount, and take them home! It’s a stretch considering unemployment just hit over 6million but if you’re on furlough what do you have to lose!","isChecked":false,"level":2,"score":"100"},{"author":"ShadoeKittay","body":"My furlough means I work 4 days instead of 5. But that’s a really good plan","isChecked":false,"level":3,"score":"22"},{"author":"Rosssquared2011","body":"See if you can do pt, like 1 or two days a week.","isChecked":false,"level":4,"score":"14"},{"author":"AgentPurple","body":"That’s great! A 4-day work week sounds fantastic.\n\nI worked at a small mom&pop pet shop fresh out of high school, it was one of my favorite jobs ever. I learned SO much. I highly recommend it if you could swing it :) If not, I hope you can save those little birdies once things go back to normal <3","isChecked":false,"level":4,"score":"8"},{"author":"cianne_marie","body":"Proposal to crowdfund the rescue of these poor little birds.","isChecked":false,"level":2,"score":"12"},{"author":"guttermooseuwu","body":"Therapy.","isChecked":false,"level":1,"score":"166"},{"author":"westcoastsiren","body":"A car that actually fits my family of 4 comfortably","isChecked":false,"level":1,"score":"540"},{"author":"elkhorn","body":"Actually, I’m good. But thanks for asking.","isChecked":false,"level":1,"score":"743"},{"author":"Antonv2","body":"After reading the responses. Im good as well. At least there is 2 of us.","isChecked":false,"level":2,"score":"268"},{"author":"furmal182","body":"Count me in, i am sure we all have some desire and needs but being thankful in your current situation is also a blessing .      \nالحمد لله for everything.","isChecked":false,"level":3,"score":"46"},{"author":"Kingjay814","body":"Same here, I was laid off but I'm in a decent place financially. Now if things don't turn around by the end of the year I might be singing a different tune","isChecked":false,"level":4,"score":"19"},{"author":"alextheawsm","body":"Also got laid off cuz of Covid-19. Luckily, I got a new job with an increase in pay the following Monday. No more dealing with my abusive sociopath boss anymore. My wife was thrilled when she heard I was let go 😂","isChecked":false,"level":5,"score":"16"},{"author":"guywithanusername","body":"There's three, actually (does someone know that meme?). I'm a student without debt and a nice apartment, everything is going well","isChecked":false,"level":3,"score":"8"},{"author":"Ensvey","body":"This thread is depressing, your response helped mitigate the sadness. I too am grateful for what I have, given the circumstances.","isChecked":false,"level":2,"score":"18"},{"author":"youlikespiders","body":"We are doing well also...I’m a bit ashamed of the list of things that I want but can’t afford right now...my bills are paid, my kids are fed, and my job is secure...I’m good.\n\nI wish I could help out all of these others with basic needs...","isChecked":false,"level":2,"score":"10"},{"author":"Sarpanitu","body":"A sense of security","isChecked":false,"level":1,"score":"234"},{"author":"WanderingDoe62","body":"To be debt free.","isChecked":false,"level":1,"score":"139"},{"author":"Xordormi","body":"A switch. I suppose I can afford it (assuming I don’t get laid off...), but I just want to play the new Animal Crossing game and that’s a steep buy in.","isChecked":false,"level":1,"score":"471"},{"author":"lifelongfreshman","body":"There's a lot of good games on the Switch, and the library is only getting better with time.\n\nEven if you only buy it for Animal Crossing, just keeping an eye on the regular sales in the store, and maybe keeping an ear out for what games people recommend, will cause your library to grow anyway.","isChecked":false,"level":2,"score":"73"},{"author":"MasterOfComments","body":"Yeah I bought a switch for animal crossing. My so and I already have put in more than 100 hours between the two of is. Totally worth it","isChecked":false,"level":2,"score":"122"},{"author":"tuannamnguyen290602","body":"dumbass here. what the hell is animal crossing about? I've seen a lot of memes about it lately but still don't understand what's the goal of the game.","isChecked":false,"level":3,"score":"17"},{"author":"ibchiln","body":"It’s a simulation game where you get your own randomized island with randomized villagers that live on the island with you. You start off with next to nothing and the “meat” of the game is you collecting items and catching bugs and fish, as well as building up your islands community. It gives you the ability to realistically do whatever you want, as there’s no real linear gameplay, one of the reasons Minecraft is as popular as it is. It has a lot of customizable features in it and is basically a chill type of game that you can either pick up and play for a short time, or get invested in and play for hours.","isChecked":false,"level":4,"score":"19"},{"author":"tuannamnguyen290602","body":"oh okay thanks. I literally thought it was about animal crossing the road lmao","isChecked":false,"level":5,"score":"14"},{"author":"hockeyandquidditch","body":"Think The Sims with cute animals instead of more people for NPCs. It's a cute, fun, relaxing game that you can put hours into, which is perfect if you're under a stay at home order and want a world to escape to. I got given a 3DS and Animal Crossing New Leaf a few weeks into stay at home and it's made it so much more tolerable.","isChecked":false,"level":4,"score":"8"},{"author":"reee576","body":"And then theres me who hasnt touched his switch in months. My brother who lives with me bought the game on my switch but I just havent had the want or ability to sit down and play it. Working 72 hours a week is putting a strain on my mental wellbeing. But I just tell myself I should be lucky to have a job during these tough times........wow why did I type this out? Lol.","isChecked":false,"level":2,"score":"44"},{"author":"meltingeggs","body":"72 hours is a LOT. that would put a strain on anybody. I’m very glad I still have a job, especially because I left food service less than a year ago. But when I’m actually working from home, it’s like *Uggghhh* bc working remotely takes all the fun out of my job.","isChecked":false,"level":3,"score":"9"},{"author":"JehovasFavourite","body":"I bought the switch when it came out to play Breath of the Wild. It was worth all 400 bucks, and now my grandma got me Animal Crossing. Do it, it's so worth it. Keeps me from going insane right now haha","isChecked":false,"level":2,"score":"9"},{"author":"crash11b","body":"A washer and dryer and a couch. My wife and I went from living in a 29 ft camper for about year, to living in a 2 bedroom apartment. I can afford rent, but some of the necessities I'm dragging on. Shit, we don't even have a microwave yet. \n\nRegardless, I'm grateful we have a roof over our heads, food in our stomachs, and I'm actually still working with all this going on.","isChecked":false,"level":1,"score":"43"},{"author":"AlphaTundra","body":"Toilet paper, can’t even find the bloody stuff innit","isChecked":false,"level":1,"score":"262"},{"author":"superjesstacles","body":"You probably don't want the toilet paper if it's bloody.","isChecked":false,"level":2,"score":"198"},{"author":"ljackstar","body":"Yeah my annual toilet paper purchase came at a bad time this year.","isChecked":false,"level":2,"score":"9"},{"author":"Melgitat_Shujaa","body":"A house.","isChecked":false,"level":1,"score":"345"},{"author":"Gothilawn","body":"Oscilloscope","isChecked":false,"level":1,"score":"83"},{"author":"Iomis","body":"I've seen those at thrift stores. As long as you don't mind it being used.","isChecked":false,"level":2,"score":"16"},{"author":"fyretech","body":"My teeth fixed. Tired of living in pain every day.","isChecked":false,"level":1,"score":"42"},{"author":"blindgirlandherguide","body":"A Braille note taker. Think of a tablet but for the blind and visually impaired.","isChecked":false,"level":1,"score":"39"},{"author":"Sanmartian41","body":"To quarantine for 2 weeks","isChecked":false,"level":1,"score":"81"},{"author":"jozefiria","body":"A Covid-19 test.","isChecked":false,"level":1,"score":"37"},{"author":"IAmSupremeRuler","body":"To move back out of my parents house. I moved away for college and never wanted to come back to this town. Had to drop out early 2019 to have 3 major surgeries - including open heart surgery in November. Recovery from that alone is 1 year. Just got a job and worked one day before being laid off bc of COVID.\n\nEdit: Im only 22","isChecked":false,"level":1,"score":"74"},{"author":"juju_cubes","body":"Fajitas :<","isChecked":false,"level":1,"score":"145"},{"author":"diesel_time","body":"Spotify premium, I miss it but had to cut back on services like that for a while.","isChecked":false,"level":1,"score":"30"},{"author":"sirdabzey","body":"See if you have friends that have it as well and go in on a family plan. $15/mo for 6 people is much more affordable.","isChecked":false,"level":2,"score":"17"},{"author":"JohannaBlau","body":"A new tablet, this one dies every ten minutes.","isChecked":false,"level":1,"score":"57"},{"author":"eskimopenguin","body":"A couple of children. My hysband and I are looking to  adopt at some point from foster care.  We're looking to fix up the house first and he's up for a promption soon at work.  I'm looking to further my career a little as well so we can have a little cushion.  For now i'm settling for just spoiling my baby nephew.","isChecked":false,"level":1,"score":"110"},{"author":"notyourmatebuddy","body":"It's a very responsible decision you have made mate. Money troubles during childhood are destructive to both kids and parents. I applaud you for waiting it out","isChecked":false,"level":2,"score":"9"},{"author":"codingCoderCoding","body":"A US green card","isChecked":false,"level":1,"score":"115"},{"author":"satansayssurfsup","body":"To go back to school","isChecked":false,"level":1,"score":"28"},{"author":"DadAsFuck","body":"n95 masks","isChecked":false,"level":1,"score":"223"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"46"},{"author":"bearboyjd","body":"A better computer for my girlfriend,  we both game and I built mine a long time ago (high end parts, it still runs like a champ) she just got into pc gaming and is using some of my old parts (6+ years old) so her pc is lacking. I plan on upgrading her pc for her birthday tho.","isChecked":false,"level":1,"score":"188"},{"author":"ukrainian-laundry","body":"To retire","isChecked":false,"level":1,"score":"21"},{"author":"Chili_Maggot","body":"Animal Crossing! I wanna make cute clothes 😡😡😡 it's all anybody is posting about online but I've been out of work due to coronavirus so I can't spare the cash.\n\nAlso some sushi.\n\nAlso if we're just throwing things out there, my rent.\n\nEdit: /u/mnemonicxslayer is a gentleman and a prince and I will fight anyone who says bad things about him","isChecked":false,"level":1,"score":"546"},{"author":"mnemonicxslayer","body":"PM your cashapp or Venmo and I’ll send you the money for the game.","isChecked":false,"level":2,"score":"538"},{"author":"IhaveapetTurnip","body":"That is so nice of you.Thank you for being such a selfless person, we need more people like that.","isChecked":false,"level":3,"score":"95"},{"author":"mnemonicxslayer","body":"I’m not selfless brother. This is just a hard time and I’m a piece of shit so I want to help a bit. Thank you for the love and stay strong.","isChecked":false,"level":4,"score":"166"},{"author":"IhaveapetTurnip","body":"Well, consider this a step in the right direction.  First step of many. Thank you, and you as well, be safe.","isChecked":false,"level":5,"score":"42"},{"author":"turtlesryummy","body":"I like how rent is below sushi on your priority list","isChecked":false,"level":2,"score":"116"},{"author":"Great1122","body":"Can’t eat rent and can’t physically move without eating. His priorities are set straight.","isChecked":false,"level":3,"score":"64"},{"author":"Vohdre","body":"Rent isn't nearly as delicious.","isChecked":false,"level":3,"score":"26"},{"author":"VitriolicWyverns","body":"I’ve been dying to play Animal Crossing. But I need a switch first 🙃","isChecked":false,"level":2,"score":"30"},{"author":"larryfellows","body":"To move out of NYC","isChecked":false,"level":1,"score":"96"},{"author":"CPJ1776","body":"Considering the current state of things, I would say that it must be difficult. That being said, I can't imagine there are many places out there that cost more to live than that place. (Not just financially  either). For example, where I live, I pay under $1K a month for a three bedroom, 1-1/2 bath house with a 2 car garage. Pollution is less than NYC, Crime is less than NYC, traffic is less than NYC.......... Covid 19 is less than NYC. You name it. My highly non essential job is still going strong as are most in the area primarily because we are so far removed from a condensed population. I've lived in Detroit, Cleveland and a few other decent sized cities and I can say, with all sincerity that I don't miss them.","isChecked":false,"level":2,"score":"10"},{"author":"InternationalOne0","body":"Hookers and blow","isChecked":false,"level":1,"score":"478"},{"author":"dredabeast24","body":"Join us brother r/wallstreetbets","isChecked":false,"level":2,"score":"239"},{"author":"Zophyael","body":"tldr:\n\nPUTS PUTS PUTS PUTS!!!!!","isChecked":false,"level":3,"score":"46"},{"author":"wanderingwonderer25","body":"A fragle stick car.","isChecked":false,"level":1,"score":"41"},{"author":"bubba9019","body":"My wife and I have been trying to have a kid for years. But the injections are expensive and we have to stop and save up for about a year, to try for a few months at a time","isChecked":false,"level":1,"score":"367"},{"author":"haberv","body":"Good luck with that, seriously. Did 4.5 yrs of fertility and even have a picture of my daughter as a blastocyst. That was 17 years ago but man was it hard. Hated to give the IM shots in my poor wife’s beautiful butt.","isChecked":false,"level":2,"score":"26"},{"author":"dedido","body":"> shots in my poor wife’s beautiful butt.  \n  \nNo wonder she wasn't getting preggers.","isChecked":false,"level":3,"score":"15"},{"author":"Sence","body":"Look into Czech Republic, my family member went there multiple times for in  vitro. It's cheaper to fly there, have a little vacation to take the stress off and get your injections. \n\nThis family member is also in the medical field here in the states which should ease some fears regarding the quality of care you will receive. Hope it helps, good luck!","isChecked":false,"level":2,"score":"16"},{"author":"caltalaltbeat","body":"A mastectomy","isChecked":false,"level":1,"score":"18"},{"author":"lostexpatetudiante","body":"An AC for my room. In Texas and we don’t really have AC, we keep the windows open year round, and it’s gonna start getting so hot soon.","isChecked":false,"level":1,"score":"18"},{"author":"Csguzman","body":"An iced coffee","isChecked":false,"level":1,"score":"18"},{"author":"kmbbt","body":"rent, yay.","isChecked":false,"level":1,"score":"33"},{"author":"ComicInterest","body":"Just my basic bills. Fuck Coronavirus","isChecked":false,"level":1,"score":"34"},{"author":"vpsdudley","body":"A Tesla model x","isChecked":false,"level":1,"score":"69"},{"author":"Slayer5227","body":"I’d be cool with a 3. Need a house first though.","isChecked":false,"level":2,"score":"12"},{"author":"frijolita_bonita","body":"a Ventilator","isChecked":false,"level":1,"score":"65"},{"author":"rickwill14","body":"To pay off my student debt and go back to college.","isChecked":false,"level":1,"score":"88"},{"author":"eltibbs","body":"I did this. Was a high school math teacher for five years and was miserable and depressed. Hated my job and lived dirt poor but got my loans almost paid off in those five years. I did a loan forgiveness program for teaching at a title one school where majority of kids live in poverty, requires you teach at title one school for five years otherwise I’d have quit teaching much sooner. Went back to school for electrical engineering and now I owe like $52k in loans but it was worth it.\n\nBest of luck, hang in there!","isChecked":false,"level":2,"score":"15"},{"author":"slapchaz1","body":"Grad school.","isChecked":false,"level":1,"score":"16"},{"author":"Mundee366","body":"A cave update for minecraft :(","isChecked":false,"level":1,"score":"14"},{"author":"Vector678-","body":"A VR headset","isChecked":false,"level":1,"score":"15"},{"author":"thickJimmy85","body":"A lawyer so I can stop this craziness of my ex lirtelty hiding my kids for the last 6 months.... But hey I ain't got 20k to burn right now...","isChecked":false,"level":1,"score":"44"},{"author":"saabismi","body":"Flatnose saab 900 2 door sedan with red interior and carbureted engine","isChecked":false,"level":1,"score":"85"},{"author":"slothbarns7","body":"To be able to get food delivered to me everyday","isChecked":false,"level":1,"score":"15"},{"author":"_EliteAssFace_","body":"I'm 16, and other then wanting cars which I literally can't right now. The whole family has what they want. So there's nothing, feeling pretty great full right now.","isChecked":false,"level":1,"score":"14"},{"author":"edging_but_with_poop","body":"Electricity.\n\nI bought some cheap property in the mountains. Moved onto it in a trailer with plans and a timeline to get stuff built. I didn’t have near enough money to install septic system, water well/system, electrical, and build the cabin. So now I have a cabin, septic, I get my water tank filled by a company and I run a loud generator for electricity.","isChecked":false,"level":1,"score":"13"},{"author":"groovychick","body":"To travel the world constantly","isChecked":false,"level":1,"score":"40"},{"author":"DreizenZaWaldo","body":"A psychiatrist and psychologist who can help me fix my problems.","isChecked":false,"level":1,"score":"13"},{"author":"VengefulKulak","body":"Your mother, she's a high-class lady.","isChecked":false,"level":1,"score":"171"},{"author":"Swish_Fate","body":"tell me about it","isChecked":false,"level":2,"score":"86"},{"author":"Ilovebabyyoda0727","body":"Baby Yoda plush","isChecked":false,"level":1,"score":"13"},{"author":"RooshunVodka","body":"To get my bathroom redone. It’s a 1954 original with the trendy tile color scheme of salmon pink and poop brown. The setup is pretty poorly utilized. The lighting is wonky— I’m betting the wiring is also original. But haha affording something so luxurious as a remodel in this day and age","isChecked":false,"level":1,"score":"12"},{"author":"avoir-baby","body":"To get my masters","isChecked":false,"level":1,"score":"12"},{"author":"gunnarspunk","body":"Rent/ peace of mind. This month is fine but I’m so confused about how I’m supposed to go about this. I got laid off but there’s a stay at home order. I need a job but I don’t want to go outside and bring it home to my wife or her mother.  Crime rate in my city has gone up so much I’m scared to go out on public transit even if I get an interview somewhere.","isChecked":false,"level":1,"score":"12"},{"author":"gnarley_quinn","body":"To buy shares on the stock market.","isChecked":false,"level":1,"score":"23"},{"author":"sycodubby","body":"My ex wife.","isChecked":false,"level":1,"score":"41"},{"author":"JoanneKerlot","body":"New car.","isChecked":false,"level":1,"score":"20"},{"author":"jarjar-binks-ismydad","body":"the ability to not make people hate me and a friend that will always be there for me and support me that I can trust with anything.","isChecked":false,"level":1,"score":"46"},{"author":"vanimae","body":"I think it's hard for everyone to make friends like this. What I've found is it takes time. You need to make time to cultivate little friendships, and some of them won't work out, but some will grow into what you're describing. Good luck, it's a lot of effort but well worth it.","isChecked":false,"level":2,"score":"10"},{"author":"PicklesTickle91","body":"A Nintendo Switch, along with the new Pokemon games and the DLC.","isChecked":false,"level":1,"score":"10"},{"author":"ilostmyotheraccount_","body":"Animal crossings","isChecked":false,"level":1,"score":"11"},{"author":"unensurable","body":"The crappy old farm house and land I grew up on, to restore it and give my children the glorious life and childhood freedom I had.","isChecked":false,"level":1,"score":"10"},{"author":"tirednothigh","body":"The baby that I'm having hopefully this week","isChecked":false,"level":1,"score":"19"},{"author":"darknep","body":"Animal Crossing New Horizons\n\nIt seems like everyone but me has it\n\nEdit: TYSM Reddit!","isChecked":false,"level":1,"score":"71"},{"author":"PicklesTickle91","body":"I don't have it either, if it helps.","isChecked":false,"level":2,"score":"21"},{"author":"DylanDog86","body":"I don’t have it. But don’t want it","isChecked":false,"level":2,"score":"46"},{"author":"lime_marmalade","body":"same. i always wanted a nintendo switch but it's too much of a luxury for me.","isChecked":false,"level":2,"score":"9"},{"author":"berserker_1","body":"New clothes...","isChecked":false,"level":1,"score":"10"},{"author":"tjcowell96","body":"I want to pay off the 4000 I owe in medical Bill's for the slight fracture on my hand","isChecked":false,"level":1,"score":"8"},{"author":"yisque","body":"an iPad+Apple pencil set to help my parents work from home easier","isChecked":false,"level":1,"score":"41"},{"author":"future_space_citizen","body":"A Switch, so I can play Animal Crossing.","isChecked":false,"level":1,"score":"18"},{"author":"TatooineLight","body":"Adobe After Effects / Sony Vegas","isChecked":false,"level":1,"score":"6"},{"author":"yodas_bestfriend","body":"Yo ho a pirates life for me","isChecked":false,"level":2,"score":"10"},{"author":"dullsarcasm","body":"The thing I am passionate about, my family have been struggling financially and all the choices I will make should consider our financial situation - I started working at 18 to make a living because my mother couldn't work anymore, I want to study a lot of things but unfortunately all of 'em are expensive AF. I just cannot afford anything, right now - I wish I could get at least a chance to de-stress and heal myself to lessen my worries.","isChecked":false,"level":1,"score":"8"},{"author":"noellaj20","body":"To be able to pay for my dad's heart surgery. And to pay for college. Corona put me out of the 3 part time jobs I was working, and my mom can't tutor anymore so we basically have no income right now for a 4 person family + my 2 cousins living with us.","isChecked":false,"level":1,"score":"9"},{"author":"Dr_Octahedron","body":"* Therapy\n* Dental surgery","isChecked":false,"level":1,"score":"8"},{"author":"Meme_Duif","body":"Peace of mind. Or just bread, that's fine as well I guess...","isChecked":false,"level":1,"score":"7"},{"author":"DarrlingCoco","body":"A place to live that isn’t a motel 6.","isChecked":false,"level":1,"score":"7"},{"author":"haganwills","body":"A coffee pot would be nice. After just recently moving in with my boyfriend, losing my job, and being unsure about income, that's a luxury at this point. \n\nI cant stand instant coffee but that'll have to get me by.","isChecked":false,"level":1,"score":"8"},{"author":"janbrunt","body":"A new kitchen. We fixed up this one when we were young and broke. We made a lot of naive mistakes doing DIY for the first time in our first house. Before quarantine, I took our little toddler to the kitchen design showroom and we pretended that we had a beautiful, clean, fancy kitchen too. Some day!","isChecked":false,"level":1,"score":"9"}],"id":"fuoji0","submissionData":{"author":"Swish_Fate","body":"","score":"27457","subreddit":"AskReddit","title":"What do you want but can't afford currently?"},"url":"https://www.reddit.com/r/AskReddit/comments/fuoji0/what_do_you_want_but_cant_afford_currently/"}