{"commentsData":[{"author":"DarthMalgus3701","body":"When me and my basketball coach met some scouts. He introduced me as his son. \n\nI almost broke down on the spot.","isChecked":true,"level":1,"score":"4736"},{"author":"Jonvoll","body":"DAMN!!! Now that is an honor!","isChecked":true,"level":2,"score":"927"},{"author":"DarthMalgus3701","body":"My dad has been pretty absent my whole life, and he has another family who he’s really happy with. \n\nMy coach been a father figure my entire life, I’m not exaggerating when I say when I legitimately worship that man. \n\nHe helped me grow into a much better person, and was there for me when my best friend died. \n\nIt’s a massive honor indeed.","isChecked":true,"level":3,"score":"1827"},{"author":"lifelongfreshman","body":"Have you told him how much he and his support have meant to you?","isChecked":false,"level":4,"score":"105"},{"author":"DarthMalgus3701","body":"Most definitely. Multiple times. \n\nOne of the many things he taught me was that “people do not give a damn about words, they only care about actions” \n\nI try my best to let him know by doing things that would make him proud.","isChecked":false,"level":5,"score":"250"},{"author":"d1retz","body":"You made me smile today, thanks awesome human!","isChecked":false,"level":4,"score":"297"},{"author":"DarthMalgus3701","body":"Glad I was able to 🙏","isChecked":false,"level":5,"score":"164"},{"author":"None","body":"[deleted]","isChecked":false,"level":6,"score":"40"},{"author":"DarthMalgus3701","body":"I do theatre at school, Hollywood after the NBA ain’t such a stretch 😳","isChecked":false,"level":7,"score":"41"},{"author":"ReubenZWeiner","body":"Aim high!","isChecked":false,"level":8,"score":"15"},{"author":"evel333","body":"I will venture to say coach is lucky to have you in his life as well. To make such an impact in a someone’s life that in return they are held with such reverence is just as much an honor for the teacher.","isChecked":false,"level":4,"score":"82"},{"author":"ayesadler","body":"Just proves how important coaches are. Makes me wanna watch #coachcarter again","isChecked":false,"level":4,"score":"27"},{"author":"dayungbenny","body":"You both sound like good people I’m really happy for you both.","isChecked":false,"level":4,"score":"4"},{"author":"brobinnen","body":"I feel you bro I’m happy for you","isChecked":false,"level":4,"score":"4"},{"author":"Idahosausage","body":"One of my old bosses referred to me as his moppy headed son in front of his real son.. His son was a piece of shit.\n\n&#x200B;\n\nI miss you Rodney.","isChecked":true,"level":2,"score":"6"},{"author":"Xxxwild_willyXxx","body":"I can suck my own dick","isChecked":true,"level":2,"score":"97"},{"author":"DarthMalgus3701","body":"Pics or I’m not believing","isChecked":false,"level":3,"score":"52"},{"author":"Xxxwild_willyXxx","body":"Ok where do I send them","isChecked":false,"level":4,"score":"36"},{"author":"DarthMalgus3701","body":"My inbox","isChecked":false,"level":5,"score":"34"},{"author":"damnthetorpedoes1245","body":"r/suddenlycreepy","isChecked":false,"level":6,"score":"39"},{"author":"Xxxwild_willyXxx","body":"Ok cool give me a bit","isChecked":false,"level":6,"score":"23"},{"author":"TickleMyPiano","body":"Um what happened here","isChecked":false,"level":7,"score":"35"},{"author":"CallMeEzra","body":"Magic happened my friend. Sweet, beautiful, sensational magic.","isChecked":false,"level":8,"score":"62"},{"author":"Rough-Culture","body":"I would like to know if he did it... but not by seeing it... aLeo can you imagine trying to take that picture?","isChecked":false,"level":8,"score":"8"},{"author":"TickleMyPiano","body":"This entire thread needs Jesus","isChecked":false,"level":9,"score":"11"},{"author":"FlyingSquidMonster","body":"Does he have the pictures?","isChecked":false,"level":10,"score":"4"},{"author":"wolves_hunt_in_packs","body":"impromptu sausage party","isChecked":false,"level":8,"score":"5"},{"author":"redylang","body":"Bro i wanna see too","isChecked":false,"level":7,"score":"6"},{"author":"JediMindChickJess","body":"To me","isChecked":false,"level":5,"score":"5"},{"author":"hurbnam","body":"Pics I don’t believe ether","isChecked":false,"level":5,"score":"3"},{"author":"cappilla","body":"That's awesome bud","isChecked":false,"level":2,"score":"9"},{"author":"-SugarHigh-","body":"Twist: He is his son.","isChecked":false,"level":2,"score":"3"},{"author":"kingnicks","body":"In 2009 I walked in a commencement ceremony for my bachelor’s degree, but later found out I didn’t pass my last 2 classes so I didn’t receive my degree. I never told anyone, and life happened so I put it off. I started going back to school and had to take a few extra classes, but I finally finished my last classes and filled out my graduation application today!\n\nEdits: typos","isChecked":true,"level":1,"score":"2096"},{"author":"Fredredphooey","body":"Omg! I \"walked\" in my college graduation knowing I was short a couple credits because hello? I'd already been to 3 schools in 4 years so there was no way could tell my parents. \n\nLuckily, I went to a very large state school so \"walking\" meant standing up when they said \"the college of liberal arts and sciences.\"","isChecked":false,"level":2,"score":"390"},{"author":"MasteringTheFlames","body":"My second semester of senior year of high school, only one class I was taking I actually needed in order to graduate. Unfortunately, I hated the class, and for me, that means I didn't do any of the work. By the time the final exam came around, I had a 39% in the class. I needed something like a 160% on the final to pass, which is obviously impossible. So I resigned myself to the idea of summer school, and put very little effort into that final, instead choosing to focus on studying for other finals.\n\nAfter I finished that exam, the teacher gave me the opportunity to make up pretty much all of the homework that I didn't do over the entire semester. After she entered all those assignments into the grade book, I only needed a 59% on the final in order to pass the class. Considering I got something like a 55% on the midterm (that I actually kind of cared about) a few months earlier, that was not at all a guarantee.\n\nAt the time of the graduation ceremony, I still didn't know if I'd passed the class. My high school allows people who didn't graduate to still walk across the stage and pick up the cover for their diploma, but then after the ceremony we go pick up the actual diploma, assuming you passed. I walked the stage having no idea it I passed that class. It wasn't until I went to the area to pick up the diploma that I would find out. I told the woman my name, she looked me up in a binder, handed me my diploma, and said congratulations. She had no idea that she was breaking the news to me that I would, in fact, graduate on time.\n\nI mentioned I needed a 59% on the final in order to pass the class. When I got home after the ceremony, I went online to check my grades. On the final, I got a 61%","isChecked":false,"level":3,"score":"287"},{"author":"minimartbutter","body":"I almost just started crying for you","isChecked":false,"level":4,"score":"50"},{"author":"MasteringTheFlames","body":"Don't feel too bad for me. I was terrible student and I didn't deserve that teacher giving me the chance to make up all the assignments. I really should've gone to summer school","isChecked":false,"level":5,"score":"7"},{"author":"BandNerdCunt19","body":"My dad always told me this story about high school (he graduated in 1969). Everyone could walk the stage and they would hand you your diploma rolled up and tied with string. But if you didn’t graduate they would hand you the same paper but blank. Most people would just take their paper and leave the stage. His buddy wasn’t sure if he graduated so he stood in the middle of the stage, unrolled it and looked. He held it up for everyone to see and shouted “look guys, I graduated!” He was so relieved.","isChecked":false,"level":4,"score":"3"},{"author":"Gibborim","body":"At UW Madison, any rando could definitely just show up in a cap and gown to walk and have their name called.","isChecked":false,"level":3,"score":"4"},{"author":"crankyandhangry","body":"That is so cool!! That must have gotten harder and harder with every yet that passed, so after 11 you deserve another round of applause. \n\n[Clap clap clap]","isChecked":false,"level":2,"score":"36"},{"author":"kingnicks","body":"Thank you!","isChecked":false,"level":3,"score":"3"},{"author":"JeromesNiece","body":"A Wikipedia article to which I contributed significantly got over a million views earlier this year","isChecked":true,"level":1,"score":"2604"},{"author":"tofu_tot","body":".... why can’t you tell anyone?\n\nWas it hitler? Sounds like Hitler","isChecked":false,"level":2,"score":"809"},{"author":"JeromesNiece","body":"Thanks to Weird Al, \"I edit Wikipedia\" certifies me as White & Nerdy. I don't want people to know I'm white & nerdy.","isChecked":false,"level":3,"score":"902"},{"author":"feminismsucks123","body":"Believe me\n\nThey probably already know","isChecked":false,"level":4,"score":"457"},{"author":"garenisfeeding","body":"Some things are hard to hide...","isChecked":false,"level":5,"score":"114"},{"author":"ishzlle","body":"Man you gotta own your interests. Like whatchu wanna like.","isChecked":false,"level":4,"score":"104"},{"author":"MUK99","body":"So youre black and gangsta?","isChecked":false,"level":4,"score":"92"},{"author":"lhssucksass_69","body":"The cultured reference means you're a man of many wisdoms. Flaunt it girlfriend.","isChecked":false,"level":4,"score":"4"},{"author":"song_of_ur_comment","body":"👋 [I wrote a song of your comment!](https://youtu.be/N6pkYrX8IIQ) 🎸🎤\n\nHere's the lyrics so you can sing along!\n\n    Some folks like to run the fastest time\n    Others like to climb the highest climb\n    Some folks like to win awards and they'll be recognised\n    But some of us are heroes in disguise\n\n    You might have some knowledge in your brain\n    But I've got knowledge I just can't contain\n    Thankfully I know a place to go\n    Where everyone will read the words I wroooooote\n\n    'Cause I! Am! A Wikipedian!\n    I got a lotta facts an' I cannot keep 'em in\n    And I tried my best but it doesn't work, cause I just gotta tell the world all the things\n    That I know!\n\n    I! Am! A Wikipedian!\n    I got a lotta facts an' I cannot keep 'em in\n    And a million people read my stuff, cause I just gotta tell the world all the things\n    That I knooooooow\n\n    I! Am! A Wikipedian!\n    I know a lotta stuff, but cannot tell my friends\n    'Cause I don't know what they'd think of me...\n    But I don't care, I got a million hits, so many people wanna know all the things\n    That I knoooow\n\n    I! Am! A Wikipedian!\n    I got a lotta facts an' I cannot keep 'em in\n    But a million people read my stuff, so I'm just gonna tell the world all the things\n    That I knooooooow","isChecked":false,"level":2,"score":"322"},{"author":"DramaticBush","body":"What the fuck","isChecked":false,"level":3,"score":"251"},{"author":"not9anymore","body":"Yes","isChecked":false,"level":4,"score":"7"},{"author":"song_of_ur_comment","body":"Agreed","isChecked":false,"level":5,"score":"7"},{"author":"song_of_ur_comment","body":"A song based on /u/JeromesNiece's comment, the fuck ;)","isChecked":false,"level":4,"score":"15"},{"author":"813kazuma","body":"Username saved 👍","isChecked":false,"level":5,"score":"7"},{"author":"song_of_ur_comment","body":"Haha thanks :D","isChecked":false,"level":6,"score":"4"},{"author":"junglesurfersteve","body":"Please tell us what it is!","isChecked":false,"level":2,"score":"3"},{"author":"seeasea","body":"I'm very proud of the fact that I got two lines in the header paragraphs (whatever the pre-contents part of articles is called) on the Facebook article. Got it added in 08/09 - still there. Extremely proud of that. \n\nHad a whole section I added to Barack Obama's article. Lasted a couple of months, was proud of that at the time.","isChecked":false,"level":2,"score":"3"},{"author":"meepbotl","body":"I wrote a fanfic that got almost 10k kudos on archiveofourown. And if that wasn't embarrassing enough, it was also absolutely filthy smut.\n\nEdit: to people who want the story, I don't want to expose myself more than I already have :'). You can still find it on AO3 but I really am quite embarrassed about it.","isChecked":false,"level":1,"score":"1557"},{"author":"funky_mugs","body":"What fandom was it?","isChecked":false,"level":2,"score":"201"},{"author":"meepbotl","body":"harry potter lmfao","isChecked":false,"level":3,"score":"470"},{"author":"XplodiaDustybread","body":"...it wasn’t my immortal was it?","isChecked":false,"level":4,"score":"136"},{"author":"meepbotl","body":"don't sully my ears with that name","isChecked":false,"level":5,"score":"124"},{"author":"Ich_Liegen","body":"I'll have you know, my immortal is a sacred piece of internet literature.","isChecked":false,"level":6,"score":"82"},{"author":"XplodiaDustybread","body":"I’m sorry, I just had to know!","isChecked":false,"level":6,"score":"28"},{"author":"funky_mugs","body":"Fabulous! I have to admit I've been rereading some Harry Potter fanfics during the quarantine. They remind me of being a teenager and give me lots of comfort.","isChecked":false,"level":4,"score":"178"},{"author":"Spicycatlady_","body":"I've been thinking about doing the same. I read so many Harry Potter fics a few years ago.","isChecked":false,"level":5,"score":"15"},{"author":"Mr_A","body":"Have you read the one called \"The Augeretis Fons\"? It's really good.","isChecked":false,"level":5,"score":"4"},{"author":"Raiquo","body":"Hey, wanna hear something worse? I used to devour humanoid Five Nights At Freddy’s fanfics, and before you ask; Yes. The smutty kind. \n\nMy absolute favourite was just starting to pick up in terms of romance when the author just sorta... kinda... started... gradually slowed then stopped posting. Heart breaking. She was so good at writing too! That was 2013 and I still check back every couple years, just in case.\n\nWriting touches us, it feeds our imagination, our fantasy, our hearts. It touches on our desires and our traumas. \n\nTo have written something that resonated so strongly with so many is truly an achievement. Regardless of what unexplainable fascinations it may have held. I’m proud of you.","isChecked":false,"level":4,"score":"4"},{"author":"OP-RandomBystander","body":"Link please!","isChecked":false,"level":4,"score":"3"},{"author":"Asmallcupofcoff33","body":"The moment you said AO3 I already knew it was Harry Potter LOL Now which ship was it??? #dramione4life","isChecked":false,"level":4,"score":"4"},{"author":"Gasnia","body":"Malfoy and Harry find Hagrid's bush.","isChecked":false,"level":4,"score":"3"},{"author":"WrenIchora","body":"Ah yes, I’m now a published author but every now and then I get an email from AO3 saying my absolutely disgusting smutty Hannibal story got yet another Kudos and I wither a little inside knowing what my stepping stones were.","isChecked":false,"level":2,"score":"123"},{"author":"xindori07","body":"I think I may have read it , if so it was great.","isChecked":false,"level":3,"score":"6"},{"author":"tenth","body":"I'm more curious about your published work?","isChecked":false,"level":3,"score":"6"},{"author":"ameretauri","body":"Please, plenty of published authors nowadays started on fan fiction sites. I’m not saying post your smutty Hannibal fic on your professional profile, but no shame in what got you where you are!","isChecked":false,"level":3,"score":"3"},{"author":"Stopman","body":"What’s archiveofourown?","isChecked":false,"level":2,"score":"34"},{"author":"karl2025","body":"Archive Of Our Own is a fanfiction website. It's less popular than fanfiction.net, but has better functions.","isChecked":false,"level":3,"score":"85"},{"author":"goldxoc","body":"From my pov it's much more popular now","isChecked":false,"level":4,"score":"59"},{"author":"Taleya","body":"Oh honey. Honey no.  No one uses The Pit any more.","isChecked":false,"level":4,"score":"14"},{"author":"Ni__ers","body":"It's like fanfiction.net but fewer restrictions on the....fun stuff.","isChecked":false,"level":3,"score":"29"},{"author":"Taleya","body":"It's also owned an run by writers, not a commercial honeytrap that leaks user details.\n\nMy fandom life predates ff.net.  that site is a fucking plague pit that acted like a saviour just to monetise, censor and arserape us all.  I saw the whole fucking debacle unfold start to finish.   As a DIRECT result of ff.net a03 was born to protect the community and keep our works in the hands of the creators.","isChecked":false,"level":4,"score":"7"},{"author":"knopflerpettydylan","body":"Congrats, that's excellent! Similarly, someone recently favorited a short fic I wrote on ff.net a few years ago, I was quite surprised to say the least lol- I think it has *maybe* 10 views total","isChecked":false,"level":2,"score":"23"},{"author":"AsTheStarsLookedOn","body":"We're gonna need a title here!","isChecked":false,"level":2,"score":"4"},{"author":"meepbotl","body":"I think I've exposed myself enough already :)","isChecked":false,"level":3,"score":"8"},{"author":"JediMindChickJess","body":"This is awesome! And it sounds similar to a plot of Episode 3, HBO’s Euphoria where ‘Kat’ starts writing fan fiction Tumblr smut and gains like 40k followers overnight, and she can’t tell anybody at her school about it. It’s a really well done show and she becomes internet famous but nobody in her real life pays her much attention until she... well I don’t want to be a spoiler, it sounds like you have real talent though <3","isChecked":false,"level":2,"score":"4"},{"author":"h--afuri","body":"This one hit me LOL. I used to run a blog and write fanfiction, some of which I'm actually pretty proud of, but I'd be MORTIFIED if someone in my real life actually found it. Not being able to share things you're proud of actually sucks, but I'll take it over the sheer embarrassment of someone I know reading my writing.","isChecked":false,"level":2,"score":"5"},{"author":"blessedtheloops","body":"My mom died 13 years ago and I became a teacher about 10 years ago. I work in a district with a lot of families in need. I use the money that I would have used to buy her a gift and buy something for a child in need. \nNormally it is a winter coat or hats and gloves for Christmas and in the summer I buy gift cards or send someone to camp. \n\nNone of my coworkers or family members know I do this.","isChecked":true,"level":1,"score":"1786"},{"author":"StratPlyr","body":"You are someone’s answer to a prayer.  Very nice.","isChecked":false,"level":2,"score":"443"},{"author":"surepman9","body":"That's one of the best compliments I've ever heard","isChecked":false,"level":3,"score":"6"},{"author":"theMothmom","body":"That’s really special. What a beautiful tribute to your mother.","isChecked":false,"level":2,"score":"91"},{"author":"dayungbenny","body":"Almost made me cry it’s morbid to prepare but think I would like to do something like this in the distant future when I lose my mother. Beautiful gesture.","isChecked":false,"level":2,"score":"7"},{"author":"Meek_Militant","body":"Jaysus. \n\nAngels walk the earth.","isChecked":false,"level":2,"score":"39"},{"author":"msfortunateone","body":"When I graduated college I got a job offer with the CIA. I didnt actually take it but it's a pretty dope flex that I can't tell people for obvious reasons, most notable one is that I dont wanna come off as a pretentious asshole.","isChecked":true,"level":1,"score":"238"},{"author":"Obscu","body":"Nice try, person who definitely took the CIA job.\n\nAlso, can I ask why you turned it down?","isChecked":false,"level":2,"score":"122"},{"author":"msfortunateone","body":"Lol u got me. No but forreal the biggest thing that stopped me from moving on was that have to go through a serious of hoops: polygraph test, interviews, and a 16 month security clearance before you actually get sworn in at their central office. I did research and apparently 9% of people who get a conditional offer,(which I got) actually make it through, and at any point in the 16 month clearance the CIA can rescind your offer. I had a colorful college experience that I knew would come back to haunt me so it was kinda one of those \"I'm going to reject them before they can reject me\" ordeals. I do wonder how far along I could have gone if I actually followed through, but tbh the CIA was never a goal of mines, moreover an opportunity I lucked into so I'm cool.","isChecked":false,"level":3,"score":"136"},{"author":"Nidaime_EroSennin","body":"Wtf did you study in college?","isChecked":false,"level":2,"score":"6"},{"author":"canecandle","body":"This'll probably get buried but not committing suicide. Seriously contemplated it for a few months and made a plan but didn't go through with it, ended up being the best decision I've ever made.\n\nSorted my life out and found something I enjoy doing, also met my wonderful girlfriend and became an auntie!","isChecked":true,"level":1,"score":"861"},{"author":"Iamkracken","body":"I got dangerously close too. I had a plan a where and when a note and the day was coming close, but I got way to drunk and made a half assed attempt and everyone found out and made sure I was safe and cared for. If I had succeeded I would have missed out on a lot of stuff.","isChecked":false,"level":2,"score":"52"},{"author":"sunsetautumn","body":"sending virtual hugs.","isChecked":false,"level":3,"score":"18"},{"author":"Iamkracken","body":"Thank you, all is good now. That experience is coming up on 4 years now and I think I've found my balance.","isChecked":false,"level":4,"score":"4"},{"author":"Fredredphooey","body":"Congratulations!! Good luck with everything!","isChecked":false,"level":2,"score":"8"},{"author":"AmbitiousRow9","body":"Send more love to you <3","isChecked":false,"level":2,"score":"7"},{"author":"lalayla_marie","body":"I am really glad you are still with us, and that life has gotten better for you! Keeping fighting, I am sure you are a wonderful auntie. :)","isChecked":false,"level":2,"score":"9"},{"author":"ShaynaChaos","body":"You are never alone. I am so happy you decided to stay. From someone who has been there: I love you.","isChecked":false,"level":2,"score":"9"},{"author":"TheChris87","body":"This is wonderful! 💙","isChecked":false,"level":2,"score":"7"},{"author":"doct0rm0bius","body":"You’re and absolute legend and fuck what anyone else thinks. Keep killing in and then you can come back here in 20 years and gloat about all your achievements! All the best.","isChecked":false,"level":2,"score":"6"},{"author":"JacksChocolateCake","body":"Hey congrats on becoming an auntie! 🥰 And it's not a small thing to keep surviving and living. I'm so proud of you ♥️","isChecked":false,"level":2,"score":"5"},{"author":"insert-username12","body":"Who cares if this gets buried. The fact that you wrote it means you were not buried, and that’s everything!!\n\n\nProud of you","isChecked":false,"level":2,"score":"5"},{"author":"nomoresmoothies","body":"I’ve lost 4 pounds in the last 2 weeks! Only 243 more to lose!","isChecked":false,"level":1,"score":"1047"},{"author":"lancerevo98","body":"I like to imagine your starting weight was 247 and you're seeking to consolidate into a singularity","isChecked":false,"level":2,"score":"326"},{"author":"is_it_controversial","body":"There are more efficient (and quicker) ways to do that.","isChecked":false,"level":3,"score":"34"},{"author":"whittlingcanbefatal","body":"Keep it up 👍 Everyone is cheering for you 👏🏻","isChecked":false,"level":2,"score":"162"},{"author":"Pedantichrist","body":"Hear, hear.","isChecked":false,"level":3,"score":"4"},{"author":"jgpdvs","body":"It gets easier with the more weight you lose. Just make sure the calories coming in is less than then the calories going out.","isChecked":false,"level":2,"score":"8"},{"author":"F-ZEROGX","body":"I'm cheering for you!! On my weight loss journey as well and lost 5 pounds since this week. You got this!!!","isChecked":false,"level":2,"score":"4"},{"author":"KazRow","body":"I've been 100% nicotine free since January 3rd, 2020 after being addicted since I was 16.\n\nI technically can tell people I know, but most people, including family, didn't know about it in the first place.","isChecked":false,"level":1,"score":"1928"},{"author":"sidewinder15599","body":"Congratulations! Great job!","isChecked":false,"level":2,"score":"192"},{"author":"KazRow","body":"Thank you very much :)","isChecked":false,"level":3,"score":"72"},{"author":"vvalrus44","body":"Incredible, I did the same thing Jan 25th, started at the same age. Congrats!","isChecked":false,"level":2,"score":"51"},{"author":"KazRow","body":"It really sucks you in, especially that young. Congrats yourself, and stick with it!","isChecked":false,"level":3,"score":"5"},{"author":"quiet0n3","body":"You're doing great! All the hard work is done. Nicotine leaves your body after 3 months :) you should be getting your sense of smell and taste back to a better level along with no more blocked nose and lots of lung/heart benifits. \n\nThe big issue now is habit, so things you're used to doing that involve smoking. Along with your stress outlet, it's important to plan for how to handle these now :) \n\nI recommend chewing gum to help through the habit things, but you will find one that works for you. The stress one is a big one. Most smokers enjoy just sitting for a bit and thinking as their stress relief, if that's you trial meditation or breathing exercises, something physical that lets your mind decompress for a bit. \n\nI'm still on the smokes but total respect for getting off them!","isChecked":false,"level":2,"score":"10"},{"author":"QuadrumanousCuddler","body":"I quit February of 2011\n\nI had smoked off and on since I was 16, it was a very situational habit. I could easily smoke a pack a day at work and far more during an evening at the bar, but I never smoked at home. Even if I had a headache and obviously needed a cigarette I'd  feel ill if I stepped in to the back yard and lit up. I'd have to go for a drive or just deal with the headache.  \n\nAnyway, I had tried to quit several times and always failed. I came up with a new strategy - I saved up all my vacation time and sick days for an entire year and used them leading up to my hire anniversary when I'd get more days and used all of those, too. I went on a long road trip with my wife who I really never smoked around and got out of my regular environment and changed my routine.  \n\nEverything was fine until my first day back to work. I put on my work clothes, got a cup of coffee, hit the freeway, and immediately knew I had failed because I *needed* a cigarette more than I had ever needed a cigarette in my entire life. I wasn't jonesing, I was *fiending* for a smoke. I dug around in my center console and found a partial pack and my lighter wouldn't light. It sparked and sparked and sparked and finally spit out a tiny globe of flame, but it was fickle and went back out. It was low on gas and too cold to light. I held it against the warm air coming out of my dash vents, but it wouldn't light. I rubbed it in my hands for what seemed like an eternity and it still wouldn't light. I felt like I was dying - I needed my nicotine but I couldn't get it. I looked at my hot cup of coffee and knew it was the only way. I dipped my dirty ass lighter in and warmed it up enough to light. I inhaled a tiny gulp of smoke and it was 6 weeks old and stale and nasty and burned my lungs and kicked off a coughing fit. I tried another drag, slowly, gently, but it was so nasty I couldn't stop coughing. I abruptly took an offramp and coughed until the light turned green and didn't go, it went red and green again and I was still coughing. I turned on to the street and pulled in to a parking lot and coughed until I was dry heaving. A drink would have been great, but my coffee had a slight sheen of nasty old lighter funk floating on the surface and the thought of drinking it made me gag harder. I dry heaved until I threw up and finally stopped coughing. I threw the stale old partial pack out the window and went to work and got a fresh cup of coffee and have never had the slightest urge to smoke since.","isChecked":false,"level":2,"score":"7"},{"author":"shelcod","body":"I have a lot of respect for people who quit smoking. Smoking is one of the dumbest things I think a human can do. I hope you're able to keep it up!","isChecked":false,"level":2,"score":"6"},{"author":"sanitarySteve","body":"congrats dude! as some one who quit 6 times before he actually did it I know how hard it can be.  when you have the urge dont go back cuz every time you start itll be just that much harder and it only takes a couple minutes to get over the urge.  I belive in you!","isChecked":false,"level":2,"score":"2"},{"author":"jkpeaches","body":"You did a great job, and I know it wasn't easy. We are super proud of you!","isChecked":false,"level":2,"score":"4"},{"author":"I_hate_traveling","body":"I've all but eliminated my problems with erectile dysfunction that have plagued me all my life.\n\nStaying in shape and being well mentally makes a  huge difference. And obviously so does experience and knowing my body.","isChecked":false,"level":1,"score":"689"},{"author":"Solo_is_dead","body":"How did you eliminate the problems? How long did it take?","isChecked":false,"level":2,"score":"93"},{"author":"AccordingSpecific2","body":"u/I_hate_traveling please answer","isChecked":false,"level":3,"score":"17"},{"author":"DeusExBlockina","body":"Yes, all our friends need to know the answer!","isChecked":false,"level":4,"score":"9"},{"author":"hellvibes","body":"Asking for a friend","isChecked":false,"level":3,"score":"17"},{"author":"meddleman","body":"If you look a bit closer, the answer lies in his second paragraph. Might take a while to spot.","isChecked":false,"level":3,"score":"1"},{"author":"Dragonheart123","body":"thats awesome, keep it up mate","isChecked":false,"level":2,"score":"63"},{"author":"BB8Lexi","body":"I see what you did there.","isChecked":false,"level":3,"score":"5"},{"author":"insertstalem3me","body":"I have basically the opposite problem, a near constant boner","isChecked":false,"level":2,"score":"81"},{"author":"smartassguy","body":"That’s called being a teenager.","isChecked":false,"level":3,"score":"209"},{"author":"OP-RandomBystander","body":"Username checks out.","isChecked":false,"level":4,"score":"70"},{"author":"CaptainDepressed44","body":"Do you mind sharing your path to success? I’m also having erection problems and they’re significantly impeding my sex life / mental well being. I guess I’m looking for hope","isChecked":false,"level":2,"score":"6"},{"author":"Aequitas_et_libertas","body":"Not OP, but I have ED as well. First course is always trying to determine if it’s psychological in origin. Best way to determine that from what I’ve read is if you’re able to achieve an erection during masturbation. Also, if you aren’t getting morning erections, which is pretty much an automatic process, then that is an indicator it’s likely *not* psychological in origin.\n\nAs always, if you suspect this issue, it’s best to consult your primary care and see if they can refer you to a urologist.\n\nIn the meantime, kegels are always a great place to start—even if you don’t have ED.","isChecked":false,"level":3,"score":"5"},{"author":"Rachelle2208","body":"A few of my close friends and my boyfriend know but no one else, especially not my family. I have been clean from drug addiction for a year and a half!","isChecked":true,"level":1,"score":"817"},{"author":"yehawwyeeye","body":"Congratulations!!!! That’s huge!","isChecked":false,"level":2,"score":"9"},{"author":"Rachelle2208","body":"Thanks! That means a lot ❤️","isChecked":false,"level":3,"score":"5"},{"author":"hairygoosetesticles","body":"Way to go! Keep it up 👍","isChecked":false,"level":2,"score":"15"},{"author":"Rachelle2208","body":"Thank you ♥️","isChecked":false,"level":3,"score":"7"},{"author":"Nymphsayer","body":"Congrats!","isChecked":false,"level":2,"score":"5"},{"author":"skunktzoxoiros","body":"🎂🎂🎂🎂","isChecked":false,"level":3,"score":"4"},{"author":"Annuit7713","body":"Word of warning. Don’t go back.\nMy friend was drug free for three years. He went back. He never came back. Found dead in a park the next morning after his first hit. \nDon’t go back.\nIt isn’t worth it.","isChecked":false,"level":2,"score":"8"},{"author":"Shigpossposs","body":"20 years ago Dan Savage responded to a letter suggesting someone name the act of a woman fucking a man with a strap on. He started a reader's vote which eventually came up with the term \"pegging.\"\n\nI wrote that original letter. Proudest thing in my life, helping come up with a new word in the English language - and helping name my favourite sex act - and other than a select few I can't tell anyone!","isChecked":false,"level":1,"score":"513"},{"author":"crankyandhangry","body":"That's really awesome!! I remember that letter. My friends and partners use that term quite naturally as do people on the internet when talking about the act; it's become quite integrated into the language of sex! Well done. :D","isChecked":false,"level":2,"score":"97"},{"author":"IntoThatFarGalaxy","body":"Hey, now that's something to be proud of.\n\nOn the other side, be glad you're not Rick Santorum...he has a gross sexual substance byproduct named after him.\n\nFor the uninitiated, \"Santorum\" is the frothy, chunky yet slimy mix of shit, cum and lube that is the result of almost every act of anal sex.\n\nYou're welcome.","isChecked":false,"level":2,"score":"57"},{"author":"EraRide","body":"That’s really fucking cool! I’d be so shamelessly proud of inventing a new word!!! Especially if it’s NSFW because it keeps things spicy and interesting.\n\nGood for you!","isChecked":false,"level":2,"score":"8"},{"author":"openlyjaywalking","body":"I always preferred \"lassfucked\", but you can't have everything.","isChecked":false,"level":2,"score":"5"},{"author":"pichael288","body":"That's actually pretty awesome","isChecked":false,"level":2,"score":"5"},{"author":"strange_glitter","body":"I’m in college, and I just published a book of short essays with my class. My name was under a pseudonym because I didn’t want my family to read my story—I opened up a lot about my messy family history, as well as the domestic and sexual abuse I faced growing up. \n\nI hope I touched someone’s life out there.","isChecked":false,"level":1,"score":"172"},{"author":"shreksleftknee","body":"I've been clean for 2 month, and that's the longest I've been clean since I've started self harming","isChecked":false,"level":1,"score":"635"},{"author":"WHALE__SHARK","body":"I’m very glad for you!","isChecked":false,"level":2,"score":"56"},{"author":"SincerelyTheUniverse","body":"Awesome! I got clean recently too. I’m so proud of you.","isChecked":false,"level":2,"score":"4"},{"author":"CurlSagan","body":"I have a hole and marks on my penis that, when viewed from the front, look like an axolotl. I only learned of this recently because I had never seen my own penis from that angle. So I got a picture and it really cracks me up. As far as dick picks go, I gotta say, it's top rate in the comedy category of the Penis Oscars. This whole time, I had no idea. I'm so proud of that little photogenic guy and there's no way I can tell anyone because then they'll ask to see, and there's no way I'm letting that image out into the world. I mean, sure, when I have nothing left to lose, I'll finally share my axolotl penis with the world. But until then, I just have to be quietly proud. Hell, I'll probably sober up and delete this post in a bit.","isChecked":false,"level":1,"score":"333"},{"author":"AccordingSpecific2","body":"Damn, I've never wanted to see a picture of a penis so badly in my entire life.","isChecked":false,"level":2,"score":"153"},{"author":"AnEarthPerson","body":"Let it be known that u/CurlSagan has an axolotl penis","isChecked":false,"level":2,"score":"136"},{"author":"pichael288","body":"I know what an axolotl looks like and I know what a penis looks like... I can't get these two things to merge in my mind","isChecked":false,"level":2,"score":"46"},{"author":"PickledSpaceHog","body":"Axolotl penis","isChecked":false,"level":2,"score":"28"},{"author":"justonemom14","body":"Now I have to Google axolotl.","isChecked":false,"level":2,"score":"20"},{"author":"kkkkkkkkkkkkkkkwhat4","body":"On the off chance that you haven't done that yet, it's basically just a weird salamander","isChecked":false,"level":3,"score":"6"},{"author":"yarowdyhooligans","body":"This is the level of content I'd pray for from someone with your caliber of username.","isChecked":false,"level":2,"score":"33"},{"author":"cantbelieveitsnotjes","body":"Well you’re definitely right about people wanting to see. Because now I’m intrigued.","isChecked":false,"level":2,"score":"5"},{"author":"internetownboy","body":"That despite my childhood family being abusive cold hateful and spiteful toward me, I’m proud of the fact that I’m super loving  and nobody will ever change this. I don’t want to drag this into my adult life. My kids will never know my sadness. They are amazing and they will never carry what I carry. They will only carry joyful memories. This makes me more proud than anything.","isChecked":false,"level":1,"score":"1089"},{"author":"avidly_yours","body":"Congrats on breaking that cycle!!!","isChecked":false,"level":2,"score":"176"},{"author":"claudifornia21","body":"“My kids will never know my sadness” <~~~ this got me... same here. I only have one but dammit I love him so!","isChecked":false,"level":2,"score":"104"},{"author":"neurophilos","body":"Hell yes. I admire the fuck out of you.","isChecked":false,"level":2,"score":"64"},{"author":"thesupersoap33","body":"Because of the quarantine, I've had a lot of time to reflect and it's been brutal. Both of my parents were extremely abusive and we cut ties about 13 years ago this month. I haven't talked to any of my family and I dont have kids of my own for fear I would drag my subconscious baggage into their lives somehow or just not be strong enough to support them the way they need to. But I do have a dog, and I love him and most days, I feel like I dont deserve such an incredible doggo.\n\nKudos to you, man.","isChecked":false,"level":2,"score":"5"},{"author":"OScyllarus_","body":"Good on you","isChecked":false,"level":2,"score":"4"},{"author":"eddyathome","body":"Family are the people who you choose to have in your life, not just a family genealogical record that claims they are your family.","isChecked":false,"level":2,"score":"3"},{"author":"pebble255","body":"This is what I want. My brother commited suicide 4 years ago and I'm super miserable. My step Dad is such a miserable pos. I'm angry at him, but I'm scared of how I will treat others, so I feel like isolating. I'm scared of being with someone and hurting them.","isChecked":false,"level":2,"score":"3"},{"author":"thesupersoap33","body":"Heard. You're not alone. If I had better parents, I'm sure i would have felt secure enough to have children. Maybe its important to know your limits.","isChecked":false,"level":3,"score":"4"},{"author":"Raiquo","body":">That despite my childhood family being abusive cold hateful and spiteful toward me, I’m proud of the fact that I’m super loving and nobody will ever change this. \n\nYeah boi! They couldn’t fucking break you. Proud of you man.","isChecked":false,"level":2,"score":"3"},{"author":"daisysim","body":"I’ve lost 120 lbs. I can tell people but I’m ashamed  that I let myself get that big in the first place","isChecked":false,"level":1,"score":"417"},{"author":"kestrelle","body":"Whoa.. that's some hard work and discipline.  Good job!","isChecked":false,"level":2,"score":"81"},{"author":"lancewithwings","body":"I only lost half that but I totally get what you mean. I've met so many people since I lost the weight, and they're so nice and congratulate me on it, but it feels so undeserved because I shouldn't have let myself get to the point where I needed to lose 70 pounds :( \n\nThat said, losing 120 pounds is incredible and I'm really happy for you - it's not an easy journey!","isChecked":false,"level":2,"score":"38"},{"author":"DannyBlind","body":"You shouldn't have let yourself as much as I should've planted a tree in my backyard 20 years ago for some shade.\n\nSome things happen, and it is the reactions to those things that make us, us. Yes you got fat, was it lack of discipline or mental stress? Doesn't matter, you got rid of 70lbs now! That is an achievement. You got dealt a shitty hand but still managed to play. Now you need to win the game and lose the rest and keep it off. Keep it up!","isChecked":false,"level":3,"score":"5"},{"author":"_pob","body":"Kind of dumb, but I made a Mario Maker 2 level that I really like. No one I know plays MM2 so they wouldn't really care about it, but I am proud as it's fun (for me).","isChecked":true,"level":1,"score":"286"},{"author":"phase1006","body":"Whats the code? I want to play it now","isChecked":false,"level":2,"score":"70"},{"author":"_pob","body":"FYH-WTJ-2HF\n\nLet me know if you have any feedback!","isChecked":false,"level":3,"score":"87"},{"author":"iamerror87","body":"Going to try your level now just because of this comment\n\nEdit: Can't get past the second set of chompers(or whatever they're called at the beginning of the level but yet I can't stop playing because it seems so obvious)","isChecked":false,"level":4,"score":"32"},{"author":"phase1006","body":"Really fun and challenging level! Also above my skill level. But seriously, its really fun. I'll have to try more of it later","isChecked":false,"level":4,"score":"28"},{"author":"brackmastah","body":"Phew that’s hard! But Hard is good","isChecked":false,"level":4,"score":"9"},{"author":"_THE_asshole","body":"Not for me! It HURTS!!","isChecked":false,"level":5,"score":"6"},{"author":"MLPorsche","body":"send it to ryu and hopefully it can be featured on youtube","isChecked":false,"level":2,"score":"19"},{"author":"pichael288","body":"My son loves that game, I'll have him download it","isChecked":false,"level":2,"score":"3"},{"author":"x_Trip","body":"Very cool","isChecked":false,"level":2,"score":"3"},{"author":"Stanky3000","body":"About 10 years ago I was at a gas station getting gas (what a surprise!) I was inside going to pay in cash with a $20 when the lady in front of me who had a small coffee and 5 bucks in gas was trying to pay with her card. It kept getting declined and she looked so rattled. Bot to sound rude but by what she drove and how she looked, you could tell she didnt have a lot of money. So i just told the cashier that I got her and she was so thankful. I never told anyone because it would feel like it did it to brag but I was just happy to help someone who needed it.","isChecked":false,"level":1,"score":"1037"},{"author":"Wexylu","body":"About 10 years ago I was at Target and a young girl in line of front of me had a 4-6mth old baby. \n\nShe had 12 cans of baby formula in her cart, that was it nothing else. \n\nShe tried to pay with food stamps but they weren’t valid or they were expired or something. Anyways she was visibly broken but trying not to fall apart in public. \n\nShe was going to walk out of the store with nothing, all she was trying to do was feed her baby. \n\nSo I bought them for her. I had no idea how expensive baby formula was but she was so grateful and bawled her eyes out. \n\nI never get to share that story, thank you!","isChecked":false,"level":2,"score":"379"},{"author":"donbanana","body":"I did this for an elderly lady with dementia. I was working as the duty manager, covering tills while my staff was on break. She was a bit confused and didn't have enough left of her pension to cover basic stuff (soap, toilet rolls, milk). I think her total came to about £15ish, she tried to put some stuff back seeing as if offered to pay it for her but I paid the majority and let her just have som of the rest... who's gonna know right? Anyway as she's leaving she's adamant she'll be back after her pension goes in again to pay me back and I tell her ok and thats fine...\n\nA week later im at work and told that one of our regular customers had passed away and it was her","isChecked":false,"level":2,"score":"199"},{"author":"AsianEggMcMuffin","body":"Sad to see she died, well done on your part though :)","isChecked":false,"level":3,"score":"37"},{"author":"donbanana","body":"She was honestly lovely, always told me I was cute and hoped I'd find a lovely girl to have a family with one day","isChecked":false,"level":4,"score":"8"},{"author":"jeakri","body":"I've done something similar too! I was walking through town during peak hour after work and came across a teenage girl who had emptied out her whole duffle bag on the busy footpath. I think she had torrets syndrome or something because she kept hitting herself in the head in a way like she was punishing herself for being stupid. Everyone was looking at her like she was a psycho but no one was helping. I approached her and asked her if she was ok. Turns out she had lost her bus card and was trying to find it in her bag but her ticks weren't letting her logically think about the situation. So we packed up her bag, went to the bank so I could give her some cash to get home on the bus and walked her to her dance class.\nFirst time I've told this story as I too haven't wanted to come across as bragging.","isChecked":false,"level":2,"score":"109"},{"author":"Hayisha31","body":"I did something like that once. Walking home from the t and came across a woman kneeling by a tree huddled and crying. I stopped and talked her through the panic attack and waited until the next bus came. I have panic attacks often myself and it felt so so good to be able to be the calm person for once.","isChecked":false,"level":3,"score":"30"},{"author":"-poogle-","body":"I've done this a couple of times in the grocery store, I agree it feels really weird to bring up and tell people about, but it is a good feeling to help others.","isChecked":false,"level":2,"score":"53"},{"author":"Akyrael","body":"I've done something similar in a grocery store once. Sometimes people just need a few bucks to get them through until the next payday.","isChecked":false,"level":2,"score":"102"},{"author":"ElDiario","body":"I bought a few bags of groceries for some girl on Reddit who asked for help a few years ago. Definitely can't bring that up in real life conversation.","isChecked":false,"level":2,"score":"175"},{"author":"MostGuest7","body":"My MIL did that at the grocery store the other day and I’ve already heard about it multiple times. Thank you for doing the right thing for the right reasons. I wish more people had this approach. I can’t help but roll my eyes at celebrities announcing their charitable donations..","isChecked":false,"level":2,"score":"35"},{"author":"Shryxer","body":"Daniel and Henrik Sedin made a large donation to the local children's hospital a few years back with a request that they remain anonymous. Someone let it slip and it got into the news. It worked out since their fans started pouring in loads of donations of $22 and $33 (their jersey numbers), but when they learned they'd been outed, the twins were pretty upset. The whole point was to give for the sake of doing good, not gathering metaphorical asspats.","isChecked":false,"level":3,"score":"4"},{"author":"eddyathome","body":"Something similar.  Some little old lady was buying groceries many years ago and she was short a couple of bucks.  She didn't have anything lavish in her meager cart and had to make the decision of what to put back.  It was a loaf of bread and back then it was maybe $1.17 or something like that.  I took out two dollars and told the cashier to ring it up.\n\nThe cashier did so and then tried to give me the change.  I looked at her and said \"what are you giving it to me for, she obviously needs it more than I do.\" and gestured to the little old lady who looked like she was about to cry over a damned loaf of bread.\n\nWe need to change the economic system in this country.","isChecked":false,"level":2,"score":"56"},{"author":"drumingisfun","body":"One time a friend and his wife were visiting for a week, so one day I invited them to eat at whatever restaurant they wanted, another friend heard and asked me if he could join us and he would pay half of the check, I agreed but I had the intention to pay all of it. So he invited a girl who at the time I did not know very well. So at the end I pay for everything but I didn't mind, my friend did try to pay half of it but I didn't let him, so the girl never knew that I paid for her, she always thought that my friend was the one that paid, obviously I never told her.","isChecked":false,"level":2,"score":"6"},{"author":"MasteringTheFlames","body":"I once asked my server to add another customer's bill to mine. For several months, I had been receiving countless incredible acts of kindness, both random like that and some planned, and I wanted to pay it forward. The look on his face when his server told him was absolutely worth the $20","isChecked":false,"level":2,"score":"8"},{"author":"squinla3","body":"Similar story, I was in the airport sitting at the bar waiting for my flight, the gentlemen next to me realizes that they are calling for his flight so he goes to settle up but his card gets declined. I can see the look of panic on his face, he tries to call his bank but hes put on hold, pretty sure his card got locked for fraud as he seemed generally distraught. By the time \"final boarding\" was called the man was in near tears so I quietly got the attention of the bartender and told her that I would take care it, but not to tell him it was me, I didnt want the attention. The look on his face when he found out and began scanning the bar to try and figure out who it was, was worth every penny, I just hope he caught his flight.","isChecked":false,"level":2,"score":"6"},{"author":"nickir27","body":"I did this for someone at Togo’s a few months ago. She was trying to buy food for her kids and her card kept declining. She seemed really stressed so I stepped forward and paid for it. She offered to pay me back, but I declined. Never told anyone but my husband.","isChecked":false,"level":2,"score":"4"},{"author":"Lexasauras1","body":"I do these type of things a lot but I don’t tell my boyfriend cause he’s against stuff like that","isChecked":false,"level":2,"score":"5"},{"author":"RenegadeWild","body":"I've been sober since February 21.","isChecked":false,"level":1,"score":"265"},{"author":"hippityhoppityhopety","body":"Amazing!!! The first few weeks are the hardest! Now sobriety is my normal and I’ve never felt better. You’ve got this!! Congrats!","isChecked":false,"level":2,"score":"4"},{"author":"facundoalvarado9","body":"Yes!","isChecked":false,"level":2,"score":"3"},{"author":"yehawwyeeye","body":"Congratulations!","isChecked":false,"level":2,"score":"3"},{"author":"WhiskeyDickens","body":"There was a guy with Downs syndrome ahead of me in line at a mom and pop's sub sandwich restaurant, trying to pay for his (already prepared) meal with a Subway gift card. The people running the store didn't speak much English and couldn't get through to the guy that he wasn't in a Subway. I just paid for his meal, much to the relief of the people behind the counter.","isChecked":false,"level":1,"score":"243"},{"author":"pokemonprofessor121","body":"Is has made both incredibly happy and sad at the same time. It's a hilarius story in some ways.","isChecked":false,"level":2,"score":"39"},{"author":"cobiacaine","body":"i woke up before 4pm today and got myself out of bed","isChecked":false,"level":1,"score":"246"},{"author":"ameretauri","body":"Good job! Proud of you! It’s near impossible somedays I know.","isChecked":false,"level":2,"score":"13"},{"author":"cobiacaine","body":"thank you :)","isChecked":false,"level":3,"score":"6"},{"author":"thatwunngirl7","body":"I’m proud of you <3","isChecked":false,"level":2,"score":"4"},{"author":"cobiacaine","body":"i really appreciate that homie","isChecked":false,"level":3,"score":"4"},{"author":"NeutralityTsar","body":"I can tell it, but nobody would really care. Also, a ton of others have done it. I can name every country and point it out on a map. But hey, I'm still allowed to be proud of that, right?","isChecked":false,"level":1,"score":"119"},{"author":"ShaynaChaos","body":"I can name all the States and their Capitals, so I am pretty damn proud of you stranger! Welcome to the \"Worthless Info Brain Club\" or WIB for short.","isChecked":false,"level":2,"score":"25"},{"author":"muck_hard","body":"If I bend my penis it can touch my butthole","isChecked":false,"level":1,"score":"399"},{"author":"dlordjr","body":"You afraid they'd tell you to go fuck yourself?","isChecked":false,"level":2,"score":"206"},{"author":"Stopman","body":"Are you kidding?? Tell everyone!","isChecked":false,"level":2,"score":"180"},{"author":"tofu_tot","body":"Happy cake day :)","isChecked":false,"level":3,"score":"25"},{"author":"jtrdrew","body":"I never knew how cold my butthole was until you made me try this","isChecked":false,"level":2,"score":"64"},{"author":"NWGABoi","body":"\\[NSFW) r/selffuck","isChecked":false,"level":2,"score":"35"},{"author":"ameer1322","body":"Noo I dont want this to be my new fetish NOOOOOO","isChecked":false,"level":3,"score":"12"},{"author":"BaddestofUsernames","body":"I'v heard about this sub and I'm NOT clicking it.","isChecked":false,"level":3,"score":"5"},{"author":"model1966","body":"your bending a stiffie?","isChecked":false,"level":2,"score":"9"},{"author":"iamnnyu","body":"It would've been a useful skill, but unfortunately you'll probably get too excited about it","isChecked":false,"level":2,"score":"15"},{"author":"marques33","body":"That's one big penis.","isChecked":false,"level":2,"score":"3"},{"author":"MalKendov","body":"Really? I have no sense of scale in regards to penises","isChecked":false,"level":3,"score":"3"},{"author":"nwch500","body":"I stopped with an addiction by myself that i had for a long Time, but no one knows about my ex addiction so im alone in this","isChecked":false,"level":1,"score":"576"},{"author":"Mmckel","body":"That’s awesome! Kicking an addiction is hard enough as it is, but doing it alone is a feat you should be so proud of! Stay strong, fam.","isChecked":false,"level":2,"score":"108"},{"author":"nwch500","body":"Thanks , is hard but i know that i can","isChecked":false,"level":3,"score":"28"},{"author":"smartassguy","body":"Was this addition the drug kind or some kind of other addiction?","isChecked":false,"level":2,"score":"14"},{"author":"nwch500","body":"Is other kind of addiction","isChecked":false,"level":3,"score":"25"},{"author":"smartassguy","body":"I see, well congratulations on beating it. Takes a lot of will power to do it yourself.","isChecked":false,"level":4,"score":"27"},{"author":"DevilsAggregate","body":">I see, well congratulations on beating it. Takes a lot of will power to do it yourself.\n\nI really hope it wasn't a masturbation addiction.","isChecked":false,"level":5,"score":"27"},{"author":"old---woman---help","body":"Well done, stay strong.","isChecked":false,"level":2,"score":"11"},{"author":"tofu_tot","body":"Gives me hope","isChecked":false,"level":2,"score":"8"},{"author":"Savvaloy","body":"Some kudos for hanging on by the barest of threads would be nice. Don't want to worry people though.","isChecked":false,"level":1,"score":"410"},{"author":"cicalino","body":"It's ok if you only save one person.\n\nAnd it's ok if that one person is you.","isChecked":false,"level":2,"score":"224"},{"author":"Razorrix","body":"This one hit me hard. But I have a son so...","isChecked":false,"level":3,"score":"17"},{"author":"Caedro","body":"“The best you can is good enough”\n\n\nhttps://m.youtube.com/watch?v=COUaNmm53VA","isChecked":false,"level":2,"score":"15"},{"author":"neurophilos","body":"Been there. I have so much respect and admiration for you. All the kudos. You are killing it. I would hug you in a huge bear hug right now if I could.","isChecked":false,"level":2,"score":"5"},{"author":"GiegerSubject12","body":"I recently got a promotion at work that makes me an exec sous chef and I get a raise that works out to be about a $3 per hour increase. I'm a very lucky person that gets to stay employed for now, and I've been blessed with so many amazing opportunities at my new spot.\n\nThis all came after me and my old lady split up. I moved across the country so we didn't have to do the whole long distance relationship thing, but it's all good. I wanted to move, and now I have the job of my dreams, an exponential amount of possibilities, and I live in a temperate rainforest compared to a high alpine desert \n\nI know this will get buried, but I hope we can all get through this weird period of anticipation on our feet.","isChecked":false,"level":1,"score":"85"},{"author":"WhoIsBud","body":"I’ve been smoking less and less weed","isChecked":false,"level":1,"score":"230"},{"author":"Astrocytera777","body":"Nicely done, is your goal to quit or to smoke less or did you start smoking less naturally?","isChecked":false,"level":2,"score":"29"},{"author":"WhoIsBud","body":"Well with corona, I’ve just kinda been thinking about smoking more. I’ve just found it takes more effort to get high and I’d rather just keep laying in bed.","isChecked":false,"level":3,"score":"16"},{"author":"aitigie","body":"Please send the excess to me for disposal","isChecked":false,"level":2,"score":"31"},{"author":"MY-DICK-FELL-OFF","body":"I'm pregnant again. we lost our triplets in January and I was terrified it was going to be as hard to get pregnant again as it was to get the first one but it looks like this one might be easier and the pregnancy so far is 100% better. We have our first ultrasound on monday and I'm excited to hear their heartbeat.","isChecked":false,"level":1,"score":"352"},{"author":"yehawwyeeye","body":"That’s amazing! Congratulations! I wish you and your growing family all the best!!","isChecked":false,"level":2,"score":"13"},{"author":"AsianEggMcMuffin","body":"Congratulations! Username checks out :P","isChecked":false,"level":2,"score":"15"},{"author":"stardust-baby","body":"oh my gosh, congratulations! I’m a teenage girl who has no plans of getting pregnant until i’m older (i’ve got twin 8 month old sister and brother and we’re fostering an 11 month old so i know i couldn’t handle a baby until i’m much older)\n\ni just thought i’d say, i’ve watched some family go through fertility problems and i’m really happy for you about your pregnancy! i hope all is well and you stay healthy and happy and you get a wonderful baby(who hopefully sleeps through the night!)","isChecked":false,"level":2,"score":"5"},{"author":"cosmonaut555","body":"Autism and bipolar are not even the worst of my mental illnesses yet I still have been able to have a respectable career and have good friends, and despite not being able to function properly on my own, I have moved out of my families house, live in arguably the nicest area of my city and have atleast tried to be normal.","isChecked":false,"level":1,"score":"176"},{"author":"WasterDave","body":"I am a less extreme (diluted?) version of the same. It helps me to think of my career as not going really badly, but really quite awesome for someone with mental illness.\n\nWell done, you rule.","isChecked":false,"level":2,"score":"37"},{"author":"Laminationman","body":"didnt kill myself last night even though i wanted to really badly","isChecked":false,"level":1,"score":"389"},{"author":"EllyGM","body":"Keep hanging in there","isChecked":false,"level":2,"score":"152"},{"author":"Laminationman","body":"thanks, needed to hear that :)","isChecked":false,"level":3,"score":"93"},{"author":"meantitle","body":"Please dont. Your pain will turn into a strength and you can inspire others to live a life worthwhile. True wisdom only comes from struggle. This might have been the start of you realizing youre true self. Bless You Human","isChecked":false,"level":4,"score":"6"},{"author":"BaddestofUsernames","body":"You got this bro! Dont forget how much you're worth and NEVER give up!","isChecked":false,"level":4,"score":"3"},{"author":"is_it_controversial","body":"But not literally.","isChecked":false,"level":3,"score":"8"},{"author":"Dadofpsycho","body":"I’m glad you didn’t. Please don’t hurt yourself. Whatever is going wrong for you can be fixed, but only as long as you are alive to fix it. \n\nMy son died from a suicide attempt that I don’t think he meant to complete. There is a hole in my life, my family, and his friends that can’t be filled. Even if you think you have nobody, I guarantee there are people who will be hurt if you are gone.","isChecked":false,"level":2,"score":"97"},{"author":"facundoalvarado9","body":"The world is a better place today, just because you decided to give yourself another chance.\n\nKeep it up, hooman!","isChecked":false,"level":2,"score":"61"},{"author":"Laminationman","body":"i appreciate you! really means a lot to me, kind stranger","isChecked":false,"level":3,"score":"31"},{"author":"yehawwyeeye","body":"Your existence is valuable and more important then you think right now. I know this is so often said that it’s starts to loose meaning the more you hear it, but it really does get better, I’ve been there, it does. I promise. So keep holding on, I know it’s hard but one day very soon you will be very glad that you did.","isChecked":false,"level":2,"score":"11"},{"author":"-Legit_Potato-","body":"Hi, I know you didn't write that for me, but thank you, I really needed that.","isChecked":false,"level":3,"score":"7"},{"author":"yehawwyeeye","body":"I wrote it for anyone who needs it, everything I said applies to you too, and I mean that. You’re going to be ok, how you’re feeling right now is not how you will feel forever, hang on and you’ll see <3 stay safe I’m rooting for you!","isChecked":false,"level":4,"score":"3"},{"author":"-Legit_Potato-","body":"Thank you so so much. My lifelong best friend was diagnosed July 2019 with Glioblastoma (EXTREMELY aggressive brain cancer), and she was told she had a month left. Surgery isn't an option, nor is radiation. Chemo was on the table, but it didn't work like it should have. Recently she has been getting worse. She was originally on hospice, but taken off it because she kept getting better and better. But now she isn't. Now she keeps getting worse and worse. She sleeps, wakes up to throw up, and she goes back to sleep. She is back in hospice and isn't doing well at all. This is her third round with cancer, but we are nearing the end of her fight. We don't know when, only that it will likely be sometime soon. Me and her (plus our other best friend) have been super closer since we were babies. We are teenagers now, but that is part of what makes me so mad. We are only teenagers. I know not everyone gets that long and we should feel lucky for what time we do have, but we were supposed to go to college and be roommates and then eventually start families of our own and then our kids would be raised like sisters and brothers together. We were supposed to have so much time and so many adventures left. We were supposed to grow old and then travel the world together and be crazy and hilarious like the old ladies from Mamma Mia. She isn't supposed to die of cancer. This isn't how the story was supposed to go. I guess to often we forget that we are not the painter of our fate, but rather the canvas. I just don't know how to process this grief. Within a matter of days, she could be gone. I just feel so alone with all this social isolation, then having to process this on top of everything else","isChecked":false,"level":5,"score":"8"},{"author":"yehawwyeeye","body":"I am so incredibly sorry. It’s not fair. I understand the feeling of shock upon realizing that we aren’t invincible, it doesn’t make sense because you think, this wouldn’t happen to the main character in a story, this wouldn’t happen to me or my loved ones. I am so sorry to hear that it is happening to your friends. A good friend of mine died of a aneurism in his sleep, the feeling of being shortchanged, seeing someone you love so much life end too soon is so incredibly hard, try not to face this alone if you’re comfortable talking about this with your parents please do, or with your other best friend but trying to grieve alone is an impossible task. You and you’re friends sound lovely, especially bc of that mama Mia reference. Please know that my messages are always open if you want to talk about this more.","isChecked":false,"level":6,"score":"3"},{"author":"KittyRose_2409","body":"I'm happy you didn't do it, you are amazing worthful and a precious life. You go man!","isChecked":false,"level":2,"score":"3"},{"author":"TWolfeTheThird","body":"I have gotten 4 kudos on my fan fic on archive of our own. It's not a lot but still more than I thought I'd get.","isChecked":false,"level":1,"score":"59"},{"author":"CaptHorney_Two","body":"I'm really good at keeping secrets, but if I offer you examples I no longer am.","isChecked":false,"level":1,"score":"54"},{"author":"kazog","body":"I was in a relationship for 7 years. She was adamant that I couldnt, wouldnt, shouldnt  go down on her. Something I love doing. That relationship ended last august. I recently had something casual with some girl, got to eat her out. I went all out, really enjoyed it. After, she told me I was really good at it. She couldnt believe I hadnt done that in 9 years. It sounds trashy to say it out loud, but I missed eating pussy. It feels good to know that I still got it.","isChecked":false,"level":1,"score":"195"},{"author":"avidly_yours","body":"The women of the world thank you for your service, kind Sir.","isChecked":false,"level":2,"score":"90"},{"author":"lovelikeangels","body":"As a lover of receiving oral, I am whole-heartedly jealous of this recent ex.","isChecked":false,"level":2,"score":"5"},{"author":"kazog","body":"Well I hope you can find another oral-giving  lover in your area. A hot, single one, even.","isChecked":false,"level":3,"score":"4"},{"author":"shazzle_mi_dazzle","body":"Was there any specific reason why?","isChecked":false,"level":2,"score":"4"},{"author":"kazog","body":"She said she didnt smell good downthere, had a condition bla bla bla and no matter what she did, it stayed. 7 years with her, never noticed ANY smell. It was all in her head, im certain of it.","isChecked":false,"level":3,"score":"14"},{"author":"redheadbish","body":"Its lack of pussy confidence. I used to be the same way but its something you have grow into 🤷","isChecked":false,"level":4,"score":"4"},{"author":"ireallylikebaklava","body":"I've overcome bullying without anyone's help, I was bullied at school from 10 to 16 years old, I told the teacher about it and obviously they were fucking useless and instead of trying to help they would tell me to ignore, and even had the nerve to say that one day it would end ( It did, bc eventually I moved out to high school, but that doesn't mean that the emotional damage disappeared too), I was bullied the whole time even while having classes and the teachers didn't give af, some of them actually seemed to like seeing me being bullied but anyways, the bullying only stopped once I moved to high school and even tho I was very emotionally and mentally damaged, I made myself see this change of environment as a new chapter of my life were I could start from the beginning, I didn't want to go there w my chin down, I told myself that I am worthy of love and I can't let my past ruin this new opportunity to make friends, obviously I still have a lot of traumas bc of the bullying but I couldn't show weakness bc it affects how pple perceived me and it makes it more difficult to make friends.. I have severe depression due to the bullying and other issues in ly life but I can at least say that I was strong enough to go through high school and university without letting my past ruin my ability to show my qualities and making friends :-)","isChecked":false,"level":1,"score":"49"},{"author":"zebrafish-","body":"You sound amazing!","isChecked":false,"level":2,"score":"3"},{"author":"FuckYoRecess","body":"That I haven't killed myself yet.  I'm only living for my mom and every second of every day is just so hard to endure.  Living with PTSD and severe depression since childhood takes a compounding toll and is just so suffocating.  It hasn't been easy getting here.\n\nEDIT:  Thank you for all the kind words.  I've been in therapy half my life, failed 24+ antidepressants, and have failed shock therapy.  I'm only 29, but I'm starting to think that this is something I'm just going to have to live alongside with.  I've suffered with this since I was a little kid.","isChecked":false,"level":1,"score":"405"},{"author":"cupcakelady156","body":"My husband had terrible PTSD, we found a therapist that does EMDR, it's rapid eye movement therapy. It sounds nutty but after 3 sessions he was like he used to be. I am bipolar and understand your depression struggles. Please find a therapist that can help you. You can do this, you are not alone. And I'm proud of you for not killing yourself. Stay strong friend.","isChecked":false,"level":2,"score":"71"},{"author":"Boycott_China","body":"I second EMDR therapy. I had terrible childhood trauma and EMDR helped immensely.\n\nI'm autistic so lights were a no-go, so my EMDR utilized alternating sound through headphones. Like you said, it sounds insane but it works.","isChecked":false,"level":3,"score":"30"},{"author":"cupcakelady156","body":"I'm so glad it worked for you. I had never heard of it until we went to a law enforcement support class and they discussed it. There are only 2 in my state that I know of.","isChecked":false,"level":4,"score":"8"},{"author":"permexhaustedpanda","body":"I’m going to third this! EMDR made a huge difference for me after years of emotional trauma. I still have rough days but after years of working with my therapist I am able to hold a job, enjoy my family, and feel like a part of society, instead of an intruder living on stolen time waiting for the universe to realize I’m not supposed to be here anymore. Proud of all of you that are still fighting.","isChecked":false,"level":3,"score":"16"},{"author":"Magicallypeanut","body":"Bipolar 1 here. There is a combo out there for you. Any bp can tell you that. It takes tons of trial and error. I know spravato has been a massive help for treatment resistant depression and PTSD. Cognitive behavioral therapy and edmr are a great combo. You got this","isChecked":false,"level":3,"score":"3"},{"author":"flyoverthemooon","body":"I am so sorry. You’re a very strong person to endure that every day. We’re glad you’re still here.","isChecked":false,"level":2,"score":"16"},{"author":"ExistentialBob","body":"Hey. Hang in there. You're more valuable than you can imagine.","isChecked":false,"level":2,"score":"31"},{"author":"waltertanmusic","body":"Just a question, why do people keep saying,\n\n>You're more valuable than you can imagine.\n\nI have depression, I'm not sure people say it mean it or what.","isChecked":false,"level":3,"score":"13"},{"author":"tocamix90","body":"When you’re depressed it’s hard to feel anything, let alone how much other people love and value you.  I know when I’m in a depressive episode, I’m reminded of the curse of the pirates in POTC.  Nothing tastes good, nothing sounds good, life just feels empty.  You’re essentially out of touch with reality, including your self worth.","isChecked":false,"level":4,"score":"17"},{"author":"ExistentialBob","body":"People mean it. The reason they keep saying that is, as a human, you offer so much to the world. You can do a lot with your life, regardless of the circumstances of your birth. Even if you don't think there's anything after death, why not try to make the most use of the time you got? Why not try to live your life to its fullest and bring everything you can? You never know if you benefit someone else.","isChecked":false,"level":4,"score":"7"},{"author":"Weak-Community","body":"If you ever need someone to talk to, or just vent to without judgment, please message me. I’m sorry you’re going through this.","isChecked":false,"level":2,"score":"43"},{"author":"Amongthemoonandstars","body":"I want you to know that you’re not alone. I know it’s so hard to stay alive when you have mental illnesses that are so severe and have yet to disappear. I have 8 diagnosed mental illnesses and have tried 20+ medications, neurofeedback, scans, sleep studies, therapy, etc. I’m starting to think my suffering stems from trauma and environmental issues and not chemical imbalances. I’m telling you this to tell you maybe it isn’t your brain, but your heart is hurting. There are so many things to live for, we just have to be alive to see it. I believe in you so much. Be kind to yourself (this phrase always makes me cry because we do need to be kind to ourselves, especially when we are suffering and suicidal). We will make it through, and each sweet moment in life will make the absolutely horrifying, suffocating moments worth it. I hope it makes you feel a little bit better knowing you’re not alone and someone cares about you❤️","isChecked":false,"level":2,"score":"4"},{"author":"handleurscandal","body":"YOU didn’t fail the antidepressants or shock therapy; the treatments didn’t work for you.  Just as terrible but it’s not your fault.  ❤️","isChecked":false,"level":2,"score":"3"},{"author":"IShouldHaveKnocked","body":"Hey I just want to say I’m glad you’re still here.","isChecked":false,"level":2,"score":"8"},{"author":"howispendmyday","body":"Hug","isChecked":false,"level":2,"score":"3"},{"author":"common_rabbit","body":"I've heard good things about ketamine for treatment-resistant depression","isChecked":false,"level":2,"score":"3"},{"author":"PuddinTangaray","body":"Not a doctor, but I’ve taken a lot of different antidepressants which ended up just stopping working at about the one year mark. Turns out I’m Bipolar Type 2 and that “poop-out effect” of antidepressants is a sign of it. Bipolar depression is different and needs a mood stabilizer. I wasn’t diagnosed until 25ish, and there’s nothing that’s changed my life more. \n\nIt’s something to look into if you haven’t already. The stereotypical bipolar stuff doesn’t really apply to us as much bc it’s more of Bipolar Type 1, so at least give it a look. \n\nRegardless, I’m praying for you. I’m so sorry that you’re battling this.","isChecked":false,"level":2,"score":"3"},{"author":"nol587","body":"Listen my man, suicide isn’t the way to go. So if ur mom ever passes away, just know that she wouldn’t want u to go like this. Just wait it out, if u go now then you’ll never know who will come into ur life later and make it better","isChecked":false,"level":2,"score":"3"},{"author":"Diaetiacurare","body":"I'm REALLY fat, BMI 37ish at the time, but I ran 12 miles a couple of years ago, surprising myself after I had only ever run 6.  It totally changed how I saw myself, and I'm prouder of that than anything in my life. But it turns out nobody really cares, and it's very braggy to ever bring it up with friends or acquaintances.","isChecked":false,"level":1,"score":"82"},{"author":"i_am_regina_phalange","body":"I’m not fat at all and I’ve only ever managed to run two miles at one time. Be proud of your accomplishments!! 12 miles at any size is amazing!","isChecked":false,"level":2,"score":"7"},{"author":"Oahu_Bred","body":"I provided the sperm for my sister and her wife's two children. The kids are happy and healthy with parents that love them. My sister and her wife asked me not to tell anyone in our family for now which I am fine with. I'm just happy and so proud to be part of their lives.","isChecked":false,"level":1,"score":"230"},{"author":"sidewinder15599","body":"That's a really unique and special way to be involved! Have fun with being an uncle, it's kinda awesome.","isChecked":false,"level":2,"score":"75"},{"author":"vicemagnet","body":"Uncle Daddy","isChecked":false,"level":3,"score":"122"},{"author":"Jdogy2002","body":"Claws!!","isChecked":false,"level":4,"score":"3"},{"author":"jstevenson08","body":"Just to be clear, the sperm was to impregnate your sister in law only, right?","isChecked":false,"level":2,"score":"124"},{"author":"sankers23","body":"Im scared by the lack of OPs reply.","isChecked":false,"level":3,"score":"87"},{"author":"kroxigor01","body":"/r/Oahu_Bred and his sisters going \"fuck fuck shit why didn't we think of that.\"","isChecked":false,"level":4,"score":"23"},{"author":"Mastagon","body":"Like scared scared or happy scared","isChecked":false,"level":4,"score":"18"},{"author":"rdy4xmas","body":"My sister used donated sperm from her husband’s brother. My niece is in her twenties now and her uncle has already passed away. No one in the family knows other than my mom and myself.","isChecked":false,"level":2,"score":"42"},{"author":"AirCincy","body":"Her husband doesn't know this? What am I missing here","isChecked":false,"level":3,"score":"17"},{"author":"rdy4xmas","body":"Sister, husband, mom, and myself know","isChecked":false,"level":4,"score":"10"},{"author":"healeys23","body":"I read “donated used sperm” and I have never been so concerned...","isChecked":false,"level":3,"score":"8"},{"author":"rienquelaverite","body":"shaging your sister in law for the good of your sister, uh?","isChecked":false,"level":2,"score":"6"},{"author":"DuPhuc","body":"Wait who used the sperm your sister or her wife","isChecked":false,"level":2,"score":"6"},{"author":"whycantwebefriends42","body":"I (26F) went on my first date with a girl and I'm so excited by how well it went!!!","isChecked":false,"level":1,"score":"479"},{"author":"WhiskeyDickens","body":"You know what lesbians bring on the second date, right? \n\nMoving trucks","isChecked":false,"level":2,"score":"165"},{"author":"Ganondorf_Is_God","body":"I don't get it.","isChecked":false,"level":3,"score":"10"},{"author":"Ihlita","body":"Old joke about lesbians moving i n together after a short period of dating.","isChecked":false,"level":4,"score":"57"},{"author":"is_it_controversial","body":"I still don't get it. Is that because they are so rare?","isChecked":false,"level":5,"score":"5"},{"author":"danceculture","body":"The uhaul! Ha","isChecked":false,"level":3,"score":"7"},{"author":"drugdealersdream","body":"Good for you girl!!!! I remember the first time I went on a date with a girl. I finally had a “oh shit now I get why people bother to date” moment - before that id just been going on dates with men & a lot of them were ok, nice men but just constantly felt I was just hanging out with a new friend and just killing time or something. That first date with a girl was a game changer, I didn’t want it to end. I’ve been on tens of other dates since then with other girls, but I’ll never forget that first date ever. It’s so special, I’m proud for you too","isChecked":false,"level":2,"score":"41"},{"author":"puddncake","body":"Good for you! Is a second date going to happen?","isChecked":false,"level":2,"score":"10"},{"author":"atreegrowsinbrixton","body":"What a magical moment isnt it?","isChecked":false,"level":2,"score":"14"},{"author":"PurpleMerple","body":"I’ve been losing weight, but it’s hard to tell people. My dad has been a jerk about my weight ever since I was a kid. I wasn’t even overweight, nor was I even close. My body type makes me muscular instead of thin like my other female relatives, but I was fine. Then cancer hit, and I gained about 70 pounds of chemo weight. I only have 25 pounds to go before I get back to my original weight of 168. Anyway, I’m proud of myself, and I’ve been trying really hard. I even gave up sugar. But I can’t really talk to anyone about it, especially in my family. Everyone in my house is super fit, and they make a competition about everything. So my little victories wouldn’t mean jack to them.","isChecked":false,"level":1,"score":"39"},{"author":"almost-a-real-boy","body":"It’s amazing that you can put in that dedication to not only push past harsh cancer treatments but also to have the commitment to lose weight and cut out sugar (I could never). \n\nYou keep your accomplishments, any progress forward is good, don’t let them dissuade you from your victories, you deserve them :)","isChecked":false,"level":2,"score":"5"},{"author":"mrjwellington","body":"I haven’t smoked weed in 3 weeks I have told people but I’m proud and wanted to share","isChecked":false,"level":1,"score":"37"},{"author":"runrowrepeatt","body":"I survived sexual assault it didn’t kill me like I thought it would","isChecked":false,"level":1,"score":"36"},{"author":"almost-a-real-boy","body":"You’re incredible for being able to overcome that kind of trauma, and I’m so proud that you had the strength to. \n\nI hope you’re doing well now, and I hope your life is safe and happy from here on out :)","isChecked":false,"level":2,"score":"5"},{"author":"winter_sleepover","body":"I'm extremely multiorgasmic. My record is 40 in a row.","isChecked":false,"level":1,"score":"121"},{"author":"FelixShitberg","body":"Ur a girl right??\nPls dont tell me a guy can do that cuz i cant imagine what ur peepee has to go through to get to 40","isChecked":false,"level":2,"score":"62"},{"author":"winter_sleepover","body":"Yeah I'm a female","isChecked":false,"level":3,"score":"25"},{"author":"pokemonprofessor121","body":"Can we make a deal? I can\"t orgasm and you have so many. I'll pay for shipping.","isChecked":false,"level":4,"score":"65"},{"author":"Fml3tiar","body":"FORTY? HOLY ****!","isChecked":false,"level":2,"score":"9"},{"author":"DrWishy","body":"Has that ever been a problem? (Serious)","isChecked":false,"level":2,"score":"7"},{"author":"Hayisha31","body":"JEALOUS!","isChecked":false,"level":2,"score":"4"},{"author":"Hippotheh","body":"I've lost 15 lbs recently and my abs are almost visable. \n\nI carry weight pretty well so it's not very noticable. And anyone I would tell is someone struggling with weight problems and I just come off as the skinny bitch who managed to get slightly skinnier.","isChecked":false,"level":1,"score":"36"},{"author":"almost-a-real-boy","body":"As a fellow lean person who never gains weight, congrats! \n\nPeople don’t often see how hard it is to lose that weight that doesn’t look like it’s there, so great on you for making it happen! Keep up the good work and get dem abs :)","isChecked":false,"level":2,"score":"5"},{"author":"GideonIsmail","body":"I used to self-harm a lot, but nobody outside of my partner knows. I've been clean for 2 years and 5 months now and it feels good to be able control that temptation.","isChecked":false,"level":1,"score":"34"},{"author":"rachelleeann17","body":"I haven’t killed my self yet, but that’s not something you really ask for a pat on the back for","isChecked":false,"level":1,"score":"30"},{"author":"chazzy1441","body":"Hell yes it is. Life is hard and some days it seems like you are drowning but the water always recedes. If you ever need any help reach out","isChecked":false,"level":2,"score":"8"},{"author":"ShaynaChaos","body":"\"pat\" \"pat\" \"pat\" Hang in there kid. You aren't alone. \"Hugs\".","isChecked":false,"level":2,"score":"5"},{"author":"ZADKOR","body":"I helped and supported a sex worker and helped her get on her feet and sober. I also helped her to start making her own content  online and now she’s stable and killing the game","isChecked":false,"level":1,"score":"143"},{"author":"Cosmogally","body":"wait wdym her *own content*?","isChecked":false,"level":2,"score":"6"},{"author":"UnknownQTY","body":"Was a hooker, now a cam girl.","isChecked":false,"level":3,"score":"36"},{"author":"ZADKOR","body":"She was a not online sex worker, basically. I’ll say that.","isChecked":false,"level":3,"score":"16"},{"author":"dayungbenny","body":"People giving you a hard time slightly, but they are being a bit ignorant. Making content isn’t bad it’s not about sex or sex shaming it’s about the danger of life on the street and you saved her from that and everyone glossing over that is a chump.","isChecked":false,"level":4,"score":"22"},{"author":"Smile_Apple","body":"That I murdered nobody sofar.\nLike people say that I'm basically the calmest person, but I have sometimes the kind of voice in my head when I have knife in my hands and someone walks in front of me it would be extremely easy ... Just once sideways in the neck so they can't Scream and once in the kidney so they would bleed out quickly ... This is just one way this voice tells me how to do it\n\n\nedit:\nI'm in therapy for it since a couple of months now and it helped me ... \nGuys seek help or talk to someone, I know it's hard to tell somebody to know but it helped me the most. \n\nAnd if you want to talk to a strange because it's easier we are in the same boat talk at least to me if you talk to nobody else about it","isChecked":false,"level":1,"score":"81"},{"author":"Pjusken2","body":"This is something nicknamed [\"Call of the void\"](https://www.wbur.org/endlessthread/2018/06/29/the-call-of-the-void)\n\n\" All of these thoughts  are part of a large genre called \"intrusive thoughts.\" A lot of people  have them — like when you're driving down the road and think about  hitting a pedestrian, or you're bathing your child and think about  drowning them. \"","isChecked":false,"level":2,"score":"34"},{"author":"Smile_Apple","body":"It's not to strangers it's to people I know \n\n\nBut don't worry guys I won't kill anybody it's hard to describe ... It's like I could do it and it tells me how ... But it tells me the odds like whyi shouldn't ... Like hard to clean up, and that all the things I want achieve would be gone forever","isChecked":false,"level":3,"score":"5"},{"author":"sidewinder15599","body":"Gotta keep fighting the evil wolf. Some days are harder than others.","isChecked":false,"level":2,"score":"24"},{"author":"catqueen22","body":"I like to think of those thoughts as the brain's way to warn you... \"Hey, be careful with that knife! You could easily hurt someone!\" \"Be careful with the baby in the bathtub! It would be so easy for it to drown!\"  Weird evolutionarily survival tactic, but the brain does weirder things.","isChecked":false,"level":2,"score":"10"},{"author":"lemonlady7","body":"I haven’t been as depressed as I am now since I was a young teen — but I attempted to kill myself 3 times then, and I haven’t tried now. I’m fighting the urge to. I’m getting stronger every day.","isChecked":false,"level":1,"score":"55"},{"author":"ShaynaChaos","body":"GOOD JOB. Hold it together honey. You are NOT alone.","isChecked":false,"level":2,"score":"5"},{"author":"lemonlady7","body":"Thank you 💜","isChecked":false,"level":3,"score":"3"},{"author":"almost-a-real-boy","body":"I’m proud of you. \n\nWanting to be present everyday is hard and I’m glad you’re fighting to stick around. \n\nI hope you have a good life :)","isChecked":false,"level":2,"score":"3"},{"author":"bubbblegun","body":"I stopped 3 suicides, 2 of my friends, and the third being my girlfriend, I think I'd sound like an egotistical asshole if I ever brought it up to anyone, plus it would kill the mood of whatever we're doing immediately.","isChecked":false,"level":1,"score":"30"},{"author":"ShaynaChaos","body":"Sounds like you are listening to your friends and you care. Thank you for helping them.","isChecked":false,"level":2,"score":"6"},{"author":"nwelkster","body":"I’m 24, about to turn 25, and just paid off my student loans. I worked super hard and lived cheap in school to pay for a lot of things out of pocket, and have done the same since graduation in order to pay down the loans I did have to take out as fast as possible. \n\nI told some close friends and got a mix of responses ranging from just “congrats” to “must be nice” and “brag about it.” I don’t mean to brag or anything, I was just happy and felt a huge weight lift off my shoulders, like I can finally start living life more fully. I understand it could be hard to hear a friend is debt free while you still have loans to pay off, I guess I just hoped they’d be happy for me since I would be happy and excited for them in the same situation.","isChecked":false,"level":1,"score":"24"},{"author":"almost-a-real-boy","body":"That’s great! \n\nIn a country where some people end up with $100k+ debt, I’m glad you managed to escape that trap, that’s a huge accomplishment. \n\nCongratulations :)","isChecked":false,"level":2,"score":"4"},{"author":"tossaway69420lol","body":"Good for you, seriously.  People are just jealous of people like you and me.","isChecked":false,"level":2,"score":"3"},{"author":"CrazyAnimes","body":"[I make music, but it's kinda trash :(](https://youtu.be/fxoAVZiLj5s)","isChecked":false,"level":1,"score":"49"},{"author":"potatoe_girl","body":"What do u mean it's trash?? I just listened to it and I'm sure as hell gonna add it to my playlist. I like that song and I don't care what other people think of it because it's awesome","isChecked":false,"level":2,"score":"39"},{"author":"somekid789","body":"oh I like it!","isChecked":false,"level":2,"score":"4"},{"author":"jgpdvs","body":"I am a senior in college and I stopped taking running seriously at the end of February because that was the end of indoor track and my teamates really let me down in my relays and then my track season was canceled. I spent all last month drinking, smoking and hooking up with random woman to get over that. After my state had a shelter in place order, I started running a lot more. I am on day 5 of running since my season ended on feb 23rd. I hope to find a half marathon or 5k in the next weeks that will open up so I have something to look forward for","isChecked":false,"level":1,"score":"23"},{"author":"oneluckytrooper","body":"I was closeted and in denial for most of my life, forced myself to like guys, and as a result I have a lot of trouble feeling anything for people romantically. But pretty recently I fell for this girl. This is the first time I can really pinpoint completely natural development of romantic feelings for someone, especially another woman. I was starting to worry I'd never feel something lol. But I'm really happy, I've come a long way. \n\nUnfortunately I can't gush about her because I'm stuck at home with my parents who I'm not out to.","isChecked":false,"level":1,"score":"98"},{"author":"WHALE__SHARK","body":"I hope for the best for you!","isChecked":false,"level":2,"score":"6"},{"author":"oneluckytrooper","body":"Thanks 💙","isChecked":false,"level":3,"score":"5"},{"author":"sleepy--ash","body":"I’m an illustrator (not professional, but hopefully someday) and I love creating characters. Right now I have a couple characters I’ve been developing for years now and they almost seem real to me. I’ve worked so hard on these characters that they’re like my children and I love them but nobody has ever seen them. Anyway I’m just really proud of them and I hope I can do something with them someday.","isChecked":false,"level":1,"score":"22"},{"author":"here_to_stay669","body":"I’m an anonymous NSFW poster but I’ve also made a vine that went viral. I mean actually viral, offers to be on tv etc. \n\nThe internet is a weird place.","isChecked":false,"level":1,"score":"58"},{"author":"chielf","body":"How many times have you seen your own vine in a vine compilation?","isChecked":false,"level":2,"score":"6"},{"author":"here_to_stay669","body":"It’s in most vine comps lol","isChecked":false,"level":3,"score":"11"},{"author":"chielf","body":"I’m actually really curious now","isChecked":false,"level":4,"score":"5"},{"author":"biometricllama","body":"I investigated and caught a long term employee stealing eight thousand dollars worth of stock from my store, in my first three months in my position. I'd never been taught how to investigate this kind of thing (it almost never happens!) and was told I wasn't allowed to involve anyone, including anyone who could help me, to preserve the employees privacy in case we were wrong. We weren't wrong, and I think I did a bloody good job.","isChecked":false,"level":1,"score":"18"},{"author":"ContinentalThreat","body":"Just realised I don't have any secrets :/ or things I am proud of","isChecked":false,"level":1,"score":"42"},{"author":"smartassguy","body":"Trust me, often those with secrets would rather they didn’t have them.","isChecked":false,"level":2,"score":"43"},{"author":"ContinentalThreat","body":"That's deep","isChecked":false,"level":3,"score":"17"},{"author":"Lwithavinylke","body":"I met my soul mate before the coronavirus began. We've been living together through it and it's been kinda incredible. I'm in the best position I've ever been mentally, physically, emotionally, financially, all the things are kinda just great right now.","isChecked":false,"level":1,"score":"40"},{"author":"almost-a-real-boy","body":"I’m glad things are working out for you, with all the horror stories from the pandemic I’m glad there’s someone who’s doing well through it. \n\nI hope your life keeps on looking up :)","isChecked":false,"level":2,"score":"4"},{"author":"Lwithavinylke","body":"It's seriously messed up, I almost feel guilty. Just in time for all this nonsense, I finally get a(n essental) job, a stable living situation, and the man of my dreams to spend the lockdown with, while the rest of the world seems to be clinging for dear life. I am beyond lucky. Thank you so much!","isChecked":false,"level":3,"score":"5"},{"author":"vixinboots","body":"Leaving the Mormon church without making rash, anger-influenced decisions. I changed my world view slowly, learning about myself along the way. I figured I had let the church hurt me for 25 years; I wouldn’t let it hurt me as I left too.","isChecked":false,"level":1,"score":"89"},{"author":"lapetitepapillon","body":"I haven't binged or purged so far today and have decided that I need to recover now from my eating disorder that I'm pretty sure is close to killing me.","isChecked":false,"level":1,"score":"19"},{"author":"tuesday75","body":"I work as a mental health counselor for individuals with eating disorders, this makes me so happy to hear!!! <3 if you have the resources, don't be afraid of reaching out for partial hospitalization or residential treatments. Good luck with everything!!","isChecked":false,"level":2,"score":"4"},{"author":"lapetitepapillon","body":"Thank you so much :) and thank you for what you do!","isChecked":false,"level":3,"score":"4"},{"author":"keithforpresident","body":"I don’t even know you but I’m SO proud of you! Keep it up. Recovery is a rocky road but you’ll be feeling healthier soon!","isChecked":false,"level":2,"score":"3"},{"author":"SmexyTempest051","body":"I gave a homeless person my only beanie in the middle of winter (his had a huge hole in it). It was a good beanie. I could have bought another of course, but this was a special beanie that I had spent months looking for because it was a very specific shape of beanie. It was like Russian gangster beanie, no stupid fluffy pompoms on the top. A true beanie.\nLmfao. Anyway it wasn't a big deal, but it felt good helping someone. But there isn't really any way of bringing it up without sounding like a douchebag. I'm a firm believer of \"nice people do things without need for recognition and don't go bragging about it. They do it for the other person, not themselves.\"\nSo ya. I guess there's that.","isChecked":false,"level":1,"score":"62"},{"author":"eggshitter","body":"I haven't self harmed since at least 6 months ago. On some particularly bad days I still get a strong urge to cut myself again but I threw away all my razors months ago so I never get the chance. Some scars on my arms are still slightly visible but I'm completely healed otherwise. Feels nice being able to wear short sleeves again","isChecked":false,"level":1,"score":"16"},{"author":"pinkflower200","body":"Our son is going into the military.  He will be joining the Marines.  We haven't told extended family yet because he will get lots of questions.  He has decided to not go to college and join the military.","isChecked":false,"level":1,"score":"43"},{"author":"lawsofthegoose","body":"That’s awesome.  I joined right out of high school in spite of staunch objection from all my family (2006 time frame) because they wanted me safe at college.  Did 8 years and 5 deployments and I would make the same decision 10/10 times if I had to do it again.   \n\nAlso, I still don’t have a college degree and I make more money than anyone else in my family with a banging pension plan so there’s that too","isChecked":false,"level":2,"score":"5"},{"author":"STACHEISTHECASH","body":"Mom/dad is that you? That sounds like me. I just joined the marines and I haven’t told extended family yet","isChecked":false,"level":2,"score":"5"},{"author":"hopefulhippi","body":"I’ve pretty consistently thought about ending my life over the past 4 months. Not seriously enough to set up a plan, but enough that the thoughts of “I could just die” were occurring nightly. I’ve never told anybody in my life but finally got in with a therapist. It felt so good to say my thoughts out loud to somebody and to take the steps toward helping myself get out of this place.","isChecked":false,"level":1,"score":"12"},{"author":"chazzy1441","body":"Stay strong. Reach out if you need help","isChecked":false,"level":2,"score":"4"},{"author":"withoutatres78","body":"I stopped smoking 4-12-19 - almost been a year!","isChecked":false,"level":1,"score":"14"},{"author":"WeakPressure1","body":"I wrote a book based on a writing prompt (not on this account) but my family and friends think my writing sucks so they would laugh at me if I told them","isChecked":false,"level":1,"score":"12"},{"author":"joleme","body":"I've managed to keep from killing myself over the past 5 months. If i told my inlaws I'd get a \"everyone gets sad sometimes just gotta suck it up\". If I told my \"friends\" they at most would say \"oh. Ok\" \n\nSo I take my meds and take every day as I can. Too afraid to die, but not wanting to wake up some days. It's a shitty way to live, but I'm alive.","isChecked":false,"level":1,"score":"11"},{"author":"Dragonballfan1234","body":"I can beat undertale in 4 hours speed run.","isChecked":false,"level":1,"score":"21"},{"author":"Cosmogally","body":"I refuse to believe unless u prove it","isChecked":false,"level":2,"score":"4"},{"author":"Dragonballfan1234","body":"Top speed run is 55 mins, one pacifist route is pretty short, so I made it in 4 hours. I had to skip most things but it’s pretty good.","isChecked":false,"level":3,"score":"5"},{"author":"ch1l","body":"That I am not a virgin anymore. I got laid when on holidays but was a bit ashamed to tell people. Now more than a year has passed and I know it will be awkward when I tell people, maybe they will even get angry because it's a secret for so dam long.","isChecked":false,"level":1,"score":"22"},{"author":"Fredredphooey","body":"Having sex is nothing to be ashamed of at all! And you don't have to tell anyone either. If it comes up then it's \"yeah had sex on that vacation.\" Why didn't you tell me??? I just wanted to keep it to myself for a while. \n\nIt's all good.","isChecked":false,"level":2,"score":"7"},{"author":"ShaynaChaos","body":"CONGRATS ON LOSING YOUR V-CARD! Virginity is highly overrated. It's only prized by the old, the possessive, or people who feel inadequate.  If you tell someone and they are disappointed, don't worry because it is a fleeting thing in life for anyone. Unless you were going into the clergy, it was going to happen anyway. Even then, it's not for sure, ever read 'The Thorn Birds'.  \nStay safe, make sure you know your partner is clean and don't forget to have fun. :P","isChecked":false,"level":2,"score":"6"},{"author":"Romijnd","body":"I got invited for an interview with a university. I am in my 4th year of highschool (10th grade, I think). If I get selected I am guarenteed to have a place when I finish highschool.\nThe interview is about a program they have where I am given the opportunity to do research and use that for my school research project.","isChecked":false,"level":1,"score":"25"},{"author":"STACHEISTHECASH","body":"Not exactly proud of, just relieved. I haven’t killed myself. Honestly contemplated it several times for years. The reasons vary, but suicide sounded good for a long long time.","isChecked":false,"level":1,"score":"24"},{"author":"fauxcanadian","body":"Overcoming a deeply rooted fear in my own way. I won’t talk about with anyone, but I am happy with myself finally able to take the first step","isChecked":false,"level":1,"score":"11"},{"author":"CumBucketChampion","body":"My friend told me that I saved her life from from depression and suicidal after we knew each other. I may not know if she was over reacting then, but it made me cry out of happiness.","isChecked":false,"level":1,"score":"11"},{"author":"usefulyoyo","body":"I’ve been in recovery from self harm and an eating disorder for 3 years.","isChecked":false,"level":1,"score":"10"},{"author":"MalKendov","body":"I find reportable things on social media and report them. \n\n\nI find pedophiles (it’s obvious because they are posting actual CP. like, seriously Twitter fix your site) and report them to the FBI and to Twitter. \n\n\nIt’s impossible to stomach having to see what they are doing, but I feel like I’m doing a good thing for society, helping get these sickos off of the internet and hopefully behind bars.","isChecked":false,"level":1,"score":"12"},{"author":"kuro8162004","body":"Being able to stop Self-flushing toilets form flushing while I'm wiping by going to a sink, putting water on a scrunchy of Toilet Paper, and mashing it onto the sensor\n\nDon't worry I take off the ball and flush it after","isChecked":false,"level":1,"score":"30"},{"author":"malicious-monkey","body":"where are you getting the water","isChecked":false,"level":2,"score":"12"},{"author":"kuro8162004","body":"Oh! I get it from the sink, I wouldn't dare touch the toilet water, it's why I don't want it splashing me 😆","isChecked":false,"level":3,"score":"12"},{"author":"gogozrx","body":"Usually just hanging a square or two over the sensor is enough. Doesn't have to be wet","isChecked":false,"level":2,"score":"9"},{"author":"kuro8162004","body":"I thought it had to be wet to stick 😮\nI'll try that next time, thanks for letting me know! I was thinking the 0-ply would be too seethrough 😅","isChecked":false,"level":3,"score":"3"},{"author":"ArchDukeNemesis","body":"I got hit by a car. Broke a side mirror over my back going 65 down the high way. \n\nI lived to tell about it. Even went to gaming night after words.","isChecked":false,"level":1,"score":"11"},{"author":"IceWithRaysOfSun2","body":"I was sexually abused as a child. My therapist once told me that if I wanted to be considered still a vergin I could. I waited until I was 21 to lose my verginaty with someone I trusted and was very good friends with.","isChecked":false,"level":1,"score":"9"},{"author":"Lilrubberducky","body":"Got a new job a week before the corona virus situation. Was a very big step, I quit an emotionally abusive job that I had been at for 10 years. I have been so incredibly happy with my new job and so thankful my new boss is fighting to keep me on through this unfortunate circumstance.","isChecked":false,"level":1,"score":"7"},{"author":"crankyandhangry","body":"I invented a fan holiday for Stargate SG-1 called \"Ship Day\" for people who ship the main characters Jack and Sam. It's been celebrated on the Gateworld forums for *16 years* now. The show has been off the air for about a decade and people still post to the forums and make fanart and stuff. I find it amazing that this thing has outlived even my participation in the online fan community, but like...how could I ever tell people IRL about that?","isChecked":false,"level":1,"score":"8"},{"author":"Quirky-Salamander","body":"Found a porn I’ve been trying to find for years","isChecked":false,"level":1,"score":"33"},{"author":"pvhc47","body":"I made with love with my soulmate in an alternate reality.\n\nAh...it’s a long, surprisingly boring unbelievable tale.","isChecked":false,"level":1,"score":"16"},{"author":"IndyDude11","body":"I got time. Go ahead.","isChecked":false,"level":2,"score":"10"},{"author":"pvhc47","body":"Well, I am reluctant to tell the tale in truth because it probably doesn’t live up to the brief description. In truth, what happened could very easily be seen as a dream. In fact, the moment I tell you this happened when I was asleep is probably enough for you to start doubting already. But nevertheless, here goes...\n\nTwo years ago, on a seemingly normal night, I went to bed and fell asleep rather quickly. This in itself is unusual for me as I’m a bit of an insomniac. But moving on... I awoke feeling very refreshed and went to check my phone to observe the time, but it wasn’t there. In fact, I quickly noticed I wasn’t in my room at all. I was in someone else’s room.\n\nNow, this is the bit that’s hard to convince you on, but at the time this didn’t feel like a dream. I am no stranger to lucid dreaming and sleep paralysis, etc, but this was nothing like that. This felt 100% real. I remember feeling very afraid and quickly assumed I must have sleepwalked, but then realised that was practically impossible so started to think I’d been abducted for some insane reason. \n\nBut then I heard her voice and the sound of a door slamming. I couldn’t make out what it was, but it seemed as though she was saying hello to a pet in the other room. And I know this part might seem soppy, but I felt instantly calmed on hearing her voice. In like a trance, I slowly sat up and then I noticed a mirror right next to the bed to my left. I looked into the mirror and saw someone who didn’t look like me. I don’t know if you’ve ever heard of the 90’s show “Quantum Leap”, but I honestly thought I’d leaped into another man’s body like Sam Beckett did in the show. \n\nBut then when I looked closer, I realised it actually was me. I looked slightly older, my hair was darker and I had facial stubble, but it was still me. I could tell because of my eyes mostly. What I heard next confirmed it, because the woman then called my name and told me she was back from wherever it was she’d gone to. \n\nI looked towards the door, and suddenly got the feeling that something was wrong regarding my time zone. It felt as though I was in the future. There was lights around the door, and the cupboard opened itself automatically when I took a step towards it. And then the door opened by itself and there she stood.\n\nOn seeing her I felt this sudden pull. This need for her. It was an alien feeling to me. I’d never felt so drawn to a woman in all my life. She wasn’t really stunning looking, but she was very pretty and the way she looked at me (with slight bemusement mixed with tenderness) made me melt.\n\nSuddenly, everything made sense to me on some kind of strange level. It was as though the other version of myself that I’d “leaped” into half came back, because I suddenly felt like I knew her. \n\nShe continued to look puzzled, but I didn’t say anything. I just walked towards her and kissed her and she started to laugh. I began to trace my fingers up her back and she said “you know what that does to me” and giggled and then...well, skipping the gratuitous parts, we made love. And it just felt so real. So, so real. I know I’ve used the word before but it’s true. It was real.\n\nWhen the lovemaking ceased, I got up and just looked at myself in the mirror and she just laid on her back asking what had suddenly got into me. I remember asking her the time, not really knowing what to say to her without freaking her out. She said it was six thirty. I rested my head against the wall and closed my eyes...and then suddenly I felt this jolt. I opened my eyes and I was back in my own hallway, my head resting against the wall at the top of the staircase.\n\nI know in my heart that it was real. And logic would have a hard time trying to explain otherwise. Because trust me, I’m a master of sleep and know a lot about it, and such lucid dreams like that can only happen in the REM stage of sleep, which is where the body is paralysed (and that’s how sleep paralysis happens), yet I had supposedly being sleepwalking. The two don’t add up.\n\nI’ve never been a romantic. I’m a loner who enjoys casual relationships, but the way I felt that day and the days that followed was like I was heartbroken. It was the pain of knowing I’d never see her again. I honestly do believe I crossed over to another dimension.\n\nThank God, my independent nature came roaring back not long after. And yes, sometimes I convince myself it was just an extreme lucid dreaming experience, but I don’t really believe that. And yes, on the bad days. On days like these, stressful times for everyone, I do find myself hoping when I close my eyes at night that I’ll wake up in her embrace. Who knows, maybe one day I will. Perchance to dream...","isChecked":false,"level":3,"score":"35"},{"author":"SellingMayonnaise","body":"I also deal with insomnia and am no stranger to lucid dreaming and sleep paralysis. I have had a very similar experience a couple times. Although I don’t think it was anything more than a hybrid lucid dream I definitely felt a very real sadness knowing that I might never see her again, but I hope one day I do find the right person that resembles her closely. She may not look exactly the way she did then, but hopefully when I will find who I’m supposed to be with I will know because of the feeling from this experience","isChecked":false,"level":4,"score":"11"},{"author":"IndyDude11","body":"Very cool. Thanks for taking the time to write it out. I once had a dream of a girl like this that I still remember. It was the only good dream that I have never really forgotten.","isChecked":false,"level":4,"score":"4"},{"author":"existential_mystery","body":"I might know you? And the girl. I was the girl? And... this. I think I know you","isChecked":false,"level":4,"score":"3"},{"author":"pvhc47","body":"Oh, and apologies for going on a while. But in my defence, you did say you had time.","isChecked":false,"level":3,"score":"3"},{"author":"UnbreakableHoe","body":"I'm really good at maths. Like, not maths olympiad good but to the point where I'm miles ahead of my honours maths class. If I ever try to tell anyone pretty much the only response I get is nerd or them telling me how bad they are at maths.","isChecked":false,"level":1,"score":"7"},{"author":"idontlikebutholes","body":"when the immigrants from south america came to mexico at that time was winter so it was pretty cold in the city, it was known that i lot of immigrants (and homeless people) were trying to get warm asking for clothes and staying at hostels and there was one near my house.\n\n one day a woman and her child ask me if i had some clothes (they looked very foreign and lost) and coincidentally, i wanted to get rid of some winter clothes, so i gladly gave it to them. since that moment i realized how much i enjoy donating and how simple things like clothes can help someone.","isChecked":false,"level":1,"score":"8"},{"author":"Ranchette_Geezer","body":"My personal web site has a phrase that is the only instance of that phrase in all of the web sites Google can find.","isChecked":false,"level":1,"score":"6"},{"author":"never_mind_its_me","body":"I was identified with a high IQ as a child and labeled gifted. I read books written by therapists and psychologists who work with gifted individuals to help me understand certain personality and social emotional characteristics that come with being gifted. I am proud of my intelligence, that I learn things quickly and that I have been able to master any intellectual material I've come across. I hold two bachelor degrees, a master's degree and a doctorate at age 28.\n\nBut I'm horribly lonely. I was teased sometimes in grade school, heck even when I was taking graduate level coursework, that I was a know-it-all. I try to help others all the time if they're struggling with learning something but others seem to be put off by my enthusiasm for learning.\n\nSo I hide my intelligence now. I barely even talk about my identity as a gifted individual with my husband and my therapist to avoid sounding elitist. I desperately wish to find someone to talk with about my fascination with black holes, my desire to learn at least five languages, how I want to learn how to play both the piano and the ukelele, or how I wish to go back to college to take courses I didn't have the time for. I also started a poetry blog that has been getting quite a lot of hits recently.\n\nSo, for now, I'll keep to myself and hope one day to find someone who doesn't make me feel like my problems don't matter because, as they say, \"you're so smart, you can figure it out on your own, so what do you have to worry about?\"","isChecked":false,"level":1,"score":"7"},{"author":"SuperSunshineRainbow","body":"Tonight marks 4 nights sober from alcohol. Two of those nights, tonight included, my husband got drunk and I stayed strong!! Taking it a day at time. I NEED to make it to a week and beyond.","isChecked":false,"level":1,"score":"7"},{"author":"xiwi01","body":"I know how to stop bleeding. The only reason is doing my research when i was self harming  \nAlso, i didn't throw me out of the window. Yeah, Major Depressive Disorder in your teens is not funny.","isChecked":false,"level":1,"score":"17"},{"author":"thats_Sikh_bro","body":"I just started a Youtube channel :)","isChecked":false,"level":1,"score":"7"},{"author":"Rough-Culture","body":"I got gilded today. If I told my friends, they’d ask for what and no doubt find my username.","isChecked":false,"level":1,"score":"6"},{"author":"AmbitiousRow9","body":"My bestfriend told me I am the reason he didn't commit suicide last year. He said he can't see me crying and all after he's gone, he don't want to give that to me. So, he didn't do it. It was last year. Now he's doing good, better than he was in last 4 years.\n\nWhatever more I achieve in this this life, I'm always gonna be proud of this thing until my last breath.\n\nPS: I didn't told this anyone not even to him","isChecked":false,"level":1,"score":"4"},{"author":"MadMadRoger","body":"I’m Batman","isChecked":false,"level":1,"score":"5"},{"author":"RealKingMcQueen","body":"I’m severing all ties with my “family” (if that’s what you can even call them) and moving to the other side of the country to live my own life. I’m going to change my name, my number, and delete all social media. They’re abusive, manipulative, toxic, and disgusting people. I’m so fucking proud of myself and I’m just waiting for school to end in 4 weeks and I’m outta here!!","isChecked":false,"level":1,"score":"6"},{"author":"barnaclesponge","body":"I went to therapy offered through my university and nobody in my family knows, not because I’m ashamed or anything, but because I don’t want to worry my family (my Latina mom would worry so much about me and start to treat me differently). \n\nI’ve been struggling with balancing school and my social life. I’m proud of taking this step. It’s been really helping.","isChecked":false,"level":1,"score":"5"},{"author":"CathNelson","body":"I’ve started making (slow) steps towards breaking my fast food/soda addiction. There’s something wrong with the part of my brain that tells me I’m hungry, I won’t feel anything until I’m basically woozy from not eating, and so to get food quickly I’ll usually order something. While I’m a LONG way from being clear of it, I’ve gotten a lot better during the quarantine I think and I think I’ve even lost some weight.\n\nWhile I can technically tell people, my partner is the only one who takes it seriously. My family don’t quite understand that it’s a proper addiction and stopping is not as simple as “just don’t do it”. While I don’t think my friends would be quite so dismissive I still don’t want to tell them just how bad it got. I haven’t told anyone just how bad it got, so what I’m seeing as a success (albeit a small one) would still be pretty shocking to most of them.","isChecked":false,"level":1,"score":"5"},{"author":"Kloc34","body":"That I was neglected as a child and decided to break the cycle by not having children . My mom drank herself to death, my stepdad was abusive, etc. Many of my friends wonder why I’m not married with children . Well it’s because I feel like I didn’t experience the correct way to raise a healthy family and I do not want another living being to go through what I did .","isChecked":false,"level":1,"score":"7"},{"author":"Ffrankie1","body":"My dick is small when flaccid but extends by like 7 inches when erect","isChecked":false,"level":1,"score":"20"},{"author":"havron","body":"A grower not a shower, for a bedroom surprise","isChecked":false,"level":2,"score":"9"},{"author":"-poogle-","body":"I've overcome some very serious mental illness problems (thanks to therapy, medication for awhile and big lifestyle changes). I don't look the \"type\" to have serious mental problems so the few people I have told in real life have just treated me like an attention seeking drama queen when I opened up to them, so it's going to continue to be a thing only me, my therapist and my husband know about in detail.","isChecked":false,"level":1,"score":"3"},{"author":"fivesweatshirts","body":"Sorta weird but I used to fall asleep by telling myself (love) stories, in which I would never appear because I thought it was weird if I did. I recently got my self-esteem up and realized I would put myself in those stories, which made me realize that I didn’t put myself in them before because I was so self conscious I didn’t think I could succeed in a romantic story even in my own head","isChecked":false,"level":1,"score":"5"},{"author":"FakeGlaive","body":"I got a girlfriend","isChecked":false,"level":1,"score":"4"},{"author":"yehawwyeeye","body":"I got a friend of mine who was really not doing well to start therapy and they’re making improvements all the time. I know it’s not easy!","isChecked":false,"level":1,"score":"4"},{"author":"ButtFucksRUs","body":"I'm self publishing a book! I never thought I'd get done with one.","isChecked":false,"level":1,"score":"6"},{"author":"Prinny87","body":"My boyfriend confided in me that he is a furry. No one else in his life knows. And honestly, I love that he trusted me enough to tell me.","isChecked":false,"level":1,"score":"3"},{"author":"SerrinIsLatin","body":"I haven't had a suicidal thought in roughly six months. I have anxiety, ADHD, and Depression and have struggled with self harm for several years.","isChecked":false,"level":1,"score":"7"},{"author":"bitesizeolly","body":"I had a handful of cheetos today on top of eating 1400 calories! ( eating disorder)","isChecked":false,"level":1,"score":"5"},{"author":"bidisasterdragon","body":"I was sexually assaulted in high school and it’s impacted my sex life with my husband, even almost eight years after it happened. I used to cry EVERY time I had sex with my husband, even if I felt fine; it was just my body reacting and reliving trauma even if I wasn’t mentally. It’s been incredibly frustrating and for a long time I was terrified I’d never be able to be intimate with my husband without this awful incident haunting me.\n\nRecently, after over a year and a half of therapy, we had sex and I didn’t cry. At all. It wasn’t an active thing on my part—it just... didn’t happen. And I was so thrilled and stunned that I almost started crying lol.\n\nNot exactly something I’m comfortable bringing up in casual conversation, but it’s a huge milestone for me. And I’m so damn proud of myself for putting in all the work and energy into processing what happened. Therapy is fucking hard.\n\nBut I’ve stuck with it and it’s SO GRATIFYING to see some solid results ❤️","isChecked":false,"level":1,"score":"6"},{"author":"sunshiner008","body":"That I hit my income goal last year of $150K+. I’m so proud of myself :)","isChecked":false,"level":1,"score":"9"},{"author":"vicxstrike","body":"Getting my dick sucked","isChecked":false,"level":1,"score":"15"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"11"},{"author":"insertstalem3me","body":"Well he obviously still talks to is mother","isChecked":false,"level":3,"score":"6"},{"author":"Cripnite","body":"Broken arms?","isChecked":false,"level":2,"score":"9"},{"author":"SchlepZinger","body":"Got to know a guy who's much worse off than I am, and it was the kick in the ass I needed to be more responsible and appreciative of what I'm lucky enough to have. Can't say at risk of sounding preachy, but it's a quiet thing I'm glad I understand now.","isChecked":false,"level":1,"score":"3"},{"author":"RageBlade007","body":"The fact that I can deep throat an entire sausage without chewing it\n\nEdit: forgot to mention that I can also swallow the hole sausage while in there.","isChecked":false,"level":1,"score":"6"},{"author":"PEEEEKSY","body":"I'm proud about knowing ways of opening intercourse websites' which a lot of people in my country (Saudi Arabia) don't know how to.\n\nBTW it is obviously via vpn and other browser than google, which for some reason not that many people in KSA know how to do.\n\nJust to clarify vpn + apps that open google. You can't just use the app for some weird reason.","isChecked":false,"level":1,"score":"2"},{"author":"izaleu","body":"I was on fire guard during a field exercise in the Army. Tent caught on fire during my shift, I immediately started hollering to get everyone out (they did) except for one guy who was trapped on his cot in the corner of the tent by the fire. I grabbed the fire extinguisher and put out the fire (which burned a hole through the edge of his cot) and everyone was fine.\n\nUnfortunately because I was such a crazy piece of shit at that time in my life, I didn't get any official recognition for saving that dude. He didn't even thank me. But I'm proud that even though I was a barely functional adult I managed to remember my training and handle my shit.\n\nEdit: to be clear the not-telling part of this is because of how *deeply unwell* I was psychologically at the time... I hate talking about it. Unfortunately if I leave that bit out it makes the people in my platoon sound more callous than they deserve.","isChecked":false,"level":1,"score":"5"},{"author":"patpatpatpatpar","body":"Im M/19 and ive never had a gf in my live not even a single kiss. Most ppl see this wierd but i just dont need any of this love nonsense if it isnt perfect. Most Relationships today are hop and ex ( even if you are married(whats the point of gettin married anyways ?)).\nI want someone which i can trust 100%, because ive seen fucked up things when i was young which made me the person i am Today.","isChecked":false,"level":1,"score":"5"},{"author":"sultz","body":"That I’m the only sibling in my family that didn’t come out fucked up in the head. My moms gone but I was always her favorite even when I was a fuck up. I’m pretty sure dad and close friends n relatives know it but it’s not cool to say. \n\nI don’t mean it to make fun of my siblings, just to say that I used to be the problem child  n I’ve turned it around. I’m just scared about being that person when my dads gone. He still takes care of most of us in one way or another and I fear I’ll end up filling that role.","isChecked":false,"level":1,"score":"6"},{"author":"WasBornYoung","body":"I’m kind of in a trouble family (mentally abusive). My parents have been divorced since I was 3-4 and my mom left for like 2 years, my dad has threatened to leave twice and told me both times that it was all my fault, I’m also not the perfect daughter, I’ve always been a tomboy. My dad is controlling and only care about what other ppl think of him, my mom is really selfish and narcissistic and gets MAD if nothing goes her way, My sister has anger issues and and is a control freak, she’s a little bit like both of my parents. \nI’m just proud that through every thing, I have been able to control myself and I am aware of how toxic my family is. But obviously that’s something I wouldn’t tell anyone irl bc I’m pretty sure it’ll come off as “bragging”","isChecked":false,"level":1,"score":"5"},{"author":"Gabby18384","body":"I went away to college in the fall for one semester and only a select few of my very close friends know why I actually left the college. When I returned home to the college near me, I told people that I just wasn’t a fan of the school and it was too boring. When in reality, I got raped the week before finals week and pulled myself out of the school once finals were over, for my own safety.","isChecked":false,"level":1,"score":"3"},{"author":"AllHailSundin","body":"I'm pretty good at cutting hair, despite having no training.","isChecked":false,"level":1,"score":"4"},{"author":"False_Purple","body":"do you guys remember that article about the dude who fucked an alligator?  well... me and some friends were talking about that on the bus and my friend joked that he probably made a new STD so I said ''he probably contracted ***gator-aids***''. Everyone thought it was funny but we all agreed it was a shit joke I've sworn to never say it again although it is my proudest moment","isChecked":false,"level":1,"score":"4"},{"author":"untimed_humour","body":"I have a very sharp long term memory. I remember my first words. I remember more creepy things but let's not get into that.\n\nCan't tell this to anyone (especially my mum).","isChecked":false,"level":1,"score":"5"},{"author":"Damien1045","body":"The fact I haven't killed myself yet.\n\nGot rid of a good amount of my stuff, trashed a few other things, typed up a few unique suicide notes for my friends and one for my family just in case, and decided not to celebrate my birthday in November last year thinking that I was really going to follow through with it that day.\n\nSat there fighting with myself and came to the conclusion I was too much of a coward to do so at that moment. Still been having suicidal thoughts and it's a fucking miracle imo that I'm still here.","isChecked":false,"level":1,"score":"3"},{"author":"whostolemyjelly","body":"I'm finally comfortable with my sexuality (spoiler alert: not straight) but I live in OOOOOOklahoma so","isChecked":false,"level":1,"score":"4"},{"author":"thatsassygirrl","body":"I have been celibate for 5 years and counting. I was in toxic unhealthy relationships in the past and vowed that I would be single and learn to be okay on my own. It’s a little embarrassing sometimes to think I haven’t been intimate with someone in so long. But I’m damn proud of myself!!!","isChecked":false,"level":1,"score":"4"},{"author":"wasssssuuupppp","body":"I’ve prevented two people from killing themselves. Multiple times for the same person when I was 10 and once recently for my best friend. I’m scared that one day I won’t be able to save someone though.","isChecked":false,"level":1,"score":"4"},{"author":"Matthew74732","body":"My music playlist. A collection of so many good songs I've found over the years.","isChecked":false,"level":1,"score":"4"},{"author":"Food4Thawt","body":"This week I gave 100 bucks to an small outfit that delivered 2000lbs of Maseca (corn flour for tortillas). Each family got 5lb bag of flour, 4lbs of rice, 4lbs of beans and 1 liter of cooking oil to  in their mountain town of about 200. 1.5 hrs up the hill from Comayagua. The police stopped all traffic in on the city 11 days and the locals were running out of food. \n\nI also posted online and got together with some friends and we sent 250 bucks or about 12,500  Pisos to a neighborhood in Manilla,Philipines for a local Pastor to drop off food to malnourished kids whose parents havent worked in 2 weeks...because again the army forbids them to leave .\n\nI gave double unit of red blood cells at American Red Cross and gave 2 pizzas to 2 of my 80+ neighbors.\n\nI'm a cook at a pizza joint, make 11 bucks an hour,living in a garage on a cot, but worked 40hrs this week due to steady business.\n\nDidnt want to brag in person, didnt want to gloat, but have never been happier or had higher self esteem.\n\nWanna feel good in this time. Help some people out. Call your buddies, find some hungry people and feed them. Give some blood, money, time or sweat to the even more vulnerable.\n\nIt does wonders for the soul.","isChecked":false,"level":1,"score":"2"},{"author":"heymagg29","body":"Not cutting myself anymore. 7 years ago I was on rehab for depression, abuse and self harm and it is a daily struggle when I’m feeling down to reject the urge to harm myself again since it has been my go to since I was 12 yo. I’m still learning in healthier ways to cope with emotions. Can’t really brag about that on dinner parties.","isChecked":false,"level":1,"score":"3"},{"author":"igg73","body":"I am alive!","isChecked":false,"level":1,"score":"4"},{"author":"poppcorrn","body":"I havnt cut my self in 2 years, that I remember \nI have bipolar and if I have a brake down I will forget things. But I havnt seen signs of cutting.","isChecked":false,"level":1,"score":"5"},{"author":"Dargoncookie","body":"I managed to talk my friend out of suicide. I’ve had some pretty terrible experiences in my life, but I’ve never been happier than when I helped him","isChecked":false,"level":1,"score":"2"},{"author":"rhinoguyv2","body":"I just scored 99th percentile on the major field test for computer science.\nIt's a defunct test that many graduates don't even bother taking, but I'm still proud of the result.\nMost people that I know don't care, so I'll post it here.","isChecked":false,"level":1,"score":"5"},{"author":"Taiilz43","body":"In October I will be 5 years drug free. Nobody in my family knows I had a drug problem and my fiancé knows I did drugs before we met but she doesn’t know how bad it was so it’s not a big deal or something we talk about. In those 5 years I’ve got engaged, had a kid and have another on the way and I couldn’t be happier, but it all started with me getting clean and I’m so proud of myself.","isChecked":false,"level":1,"score":"4"},{"author":"JediMindChickJess","body":"My online exhibitionism and how much I get off on it.","isChecked":false,"level":1,"score":"11"},{"author":"TheLanguageOfHumans","body":"managed to walk through the house without my bones or floor cracking/creaking. i cant tell most close people, but people ive interacted with once or twice i can, since they'll start getting worried and think that its some sort of illness and all that crap.                   \n\n(ヘ･_･)ヘ┳━┳","isChecked":false,"level":1,"score":"15"},{"author":"ASAP-_-Killerr","body":"Bones cracking and floors creaking are perfectly normal and no one should be worried about","isChecked":false,"level":2,"score":"13"},{"author":"smartassguy","body":"I’m confused by what this means.","isChecked":false,"level":2,"score":"5"},{"author":"terific-toph-fan32","body":"I’m the closest to my baby bro","isChecked":false,"level":1,"score":"3"},{"author":"murdockboy55","body":"I’m super high leveled in a fan service anime game, I’m on the leaderbored as one of the most powerful and I swear as long as I’m breathing none of my friends will know","isChecked":false,"level":1,"score":"3"},{"author":"Dragonsheepling","body":"I ... i just cant tell you.","isChecked":false,"level":1,"score":"3"},{"author":"fangirls-are-crazy","body":"I got every my hero academia merch I could find","isChecked":false,"level":1,"score":"3"},{"author":"imokayandnothurt","body":"My smut fanfics","isChecked":false,"level":1,"score":"3"},{"author":"UrbanSensei","body":"I ejaculated like 8 ft, once.","isChecked":false,"level":1,"score":"3"},{"author":"NicktheGoat","body":"I'm in a great relationship right now that I've been in for about 2 and a half years. We're long distance and most of what we do is pretty odd sexual roleplay but its really fun and there's also a real connection there. I've never been with a girl in any other way in my entire life so I'm just proud that like I can make someone happy in a romantic kind of way.","isChecked":false,"level":1,"score":"3"},{"author":"Kathara14","body":"I give excellent head. I think.","isChecked":false,"level":1,"score":"3"},{"author":"12345burrito","body":"I got an 18 fruit combo one time when I was playing fruit ninja","isChecked":false,"level":1,"score":"3"},{"author":"nicotinelightning","body":"I got dck pics from the dude who sexually harassed and created very serious rumors about some of my girl best friends. The pictures spread around the school and everyone saw them. Now everyone knows him as the pickle dck kid (he had some warts on his sausage lol) I was the first girl ever to get dck pics from him, it wasn’t difficult at all, in fact I didnt even ask for them. Nobody knows who got and leaked those pictures, it was me. :-) \n*revenge, sweet revenge*","isChecked":false,"level":1,"score":"3"},{"author":"SlapMeBelly","body":"I don't like to bring up that I paint, alot of people asked me to paint to them, strangers, I don't like that, I do paint for my family and some friends tho","isChecked":false,"level":1,"score":"3"},{"author":"Seand0r17","body":"That I draw fanart for my favorite TV shows. I've only told my older sister about it and if anyone else finds out I'd be  really embarrassed","isChecked":false,"level":1,"score":"3"},{"author":"Curiosa-Wallflower","body":"Wrote a fanfic on Wattpad that’s has over 30k reads the last time I checked lol","isChecked":false,"level":1,"score":"3"},{"author":"undeadweed","body":"I've been teaching myself to be nicer to everyone else, even in my thoughts. Meaning I usually go off on myself when I think something mean about someone who doesn't deserve it. It's starting to work during conversation as well, but it's probably very confusing to talk to me. \n\n\"No.\"\n\n\"You stupid bitchy cuntbag.\"\n\n\"???\"\n\n\"Wait no I'm sorry I didn't mean to call you that\"\n\n\"What\"","isChecked":false,"level":1,"score":"3"},{"author":"Rileigh-Bear","body":"I went through trauma with my dad after he litterally left us... a LOT of times. I’m proud because eventually we became best friends and now we are living happy lives! I can’t tell anybody I know because the last person I told made me “get help” and I was in counseling and therapy for a while until we moved and then I just stopped","isChecked":false,"level":1,"score":"3"}],"id":"fv1oey","submissionData":{"author":"flyoverthemooon","body":"","score":"2237","subreddit":"AskReddit","title":"What’s something you’re proud of but can’t tell anybody you know?"},"url":"https://www.reddit.com/r/AskReddit/comments/fv1oey/whats_something_youre_proud_of_but_cant_tell/"}