{"commentsData":[{"author":"AvogatoToast","body":"I'm a housekeeper at a hotel. Last week they cut our hours from 40 to 32.\nI was just informed that tomorrow they are shutting down the hotel. \n\nFront desk, Sales team, and bartenders are being laid off for the time being.\n\nHousekeeping will now work 24 hours a week for two weeks to deep clean the hotel, but who knows after that...","isChecked":true,"level":1,"score":"4906"},{"author":"lexeliza","body":"I’m a housekeeper in Maine. I found out Thursday that I am being laid off indefinitely. Thursday I had a job, Friday I didn’t.\n\nIn one week, I lost both of my jobs (I worked at my University, and a hotel), had to move out of my apartment (can’t pay my $800 rent, landlord not helping), and had to switch to online learning as a MUSIC major (no way in hell will that work).\n\nIt’s 4:58 in the morning. I woke up from a nightmare, and woke up in a nightmare.\n\n*EDIT* because a couple people decided they should attempt to “save me” from a music major... I’m a music education major. Please mind your business, I’m not looking for career advice. 😪","isChecked":true,"level":2,"score":"2026"},{"author":"Zahavah","body":"Fellow Mainer here- apply at a golf course. They are all opening really soon so people can get outside and not go stir crazy. All the courses are now hiring their grounds and maintenance crew. Anyone can do it- and it’s wonderful being outside all day. Source- husband runs a golf course.","isChecked":false,"level":3,"score":"123"},{"author":"lexeliza","body":"Oh wow this is brilliant!! I will look up golf courses near me, and apply ASAP!! Thank you so much for the advice! \nAlways happy to hear from another Mainer, hope you’re doing okay through all of this.","isChecked":false,"level":4,"score":"42"},{"author":"cookiescoop","body":"Also a Mainer — depending on how freaked out you are about the whole pandemic and where in Maine you live, but delivery services are hiring urgently, and most of them have worked out no-contact drop-off. Grocery stores are also hiring urgently.","isChecked":false,"level":5,"score":"23"},{"author":"None","body":"[deleted]","isChecked":false,"level":3,"score":"50"},{"author":"lexeliza","body":"You and everyone’s comments mean a lot to me... and definitely make me feel better!!! So thank you!!","isChecked":false,"level":4,"score":"24"},{"author":"Zancudosdemierda","body":"I hope you put together a half assed song on souncloud that gets buzz and then you come out with a sleeper hit that takes the world by storm turning you into a celeb so u have cash.","isChecked":false,"level":3,"score":"159"},{"author":"lexeliza","body":"Oh my god, this is brilliant! I’ll have to get right on that 😂","isChecked":false,"level":4,"score":"41"},{"author":"butyousuck","body":"The biggest asshole here is the landlord not gonna lie. People literally are coming forward to help individuals that are linked to them in every way possible and then we have these pricks -_- \n\nYou can try applying for an online English teacher / Virtual assistant job and they might be able to support you while you focus on your music course :)","isChecked":false,"level":3,"score":"20"},{"author":"cheeezus_crust","body":"Evs staff for hospitals is always needed","isChecked":false,"level":2,"score":"397"},{"author":"volt508","body":"I work at a hotel and It’s so crazy. One person for front of house and one person for back of the house.","isChecked":false,"level":3,"score":"22"},{"author":"None","body":"My mom does housekeeping too. Her hours had already been drastically cut. But they're more than likely shutting down.","isChecked":false,"level":2,"score":"23"},{"author":"prettysjwtbh","body":"I haven’t been laid off, but I answer for the National Suicide Prevention Lifeline and we are having so many calls where someone is thinking about killing themself because they were laid off. This virus is causing so much damage, and there’s never enough resources.","isChecked":true,"level":1,"score":"16659"},{"author":"SillyConnection4","body":"Hey, I also answer calls for Lifeline and the Disaster and Distress Helpline. It’s fucking rough on the lines right now. Sending you lots of support and love. ❤️","isChecked":false,"level":2,"score":"6846"},{"author":"GewdMewd","body":"I've called you people. A call I'll never forget. The help is why I'm here today.\n\nThank you.","isChecked":false,"level":3,"score":"2415"},{"author":"F_a_d_e_dd","body":"hope your doing better now ❤️","isChecked":false,"level":4,"score":"127"},{"author":"ForscherVerrat","body":"That’s a hard job to begin with. Damn.","isChecked":false,"level":2,"score":"1325"},{"author":"ktagly2","body":"Thanks for doing what you do.","isChecked":false,"level":2,"score":"740"},{"author":"vARROWHEAD","body":"What do you suggest for people in sudden high stress  situations like this?  Any overall mental health ideas?","isChecked":false,"level":2,"score":"71"},{"author":"Esqwared","body":"I’m a licensed professional counselor and with any immediate onset stress of financial crisis, it is imperative to not attend to emotions and give people false hope.  Instead, give people resources or help them connect with a support network.  Their family or friends.  I get that we have to be more physically isolated but people in crisis need that blanket of security and it has to be real.  Get educated about resources in your area and focus on making connections, not promises or reassurance.  It will be the hardest on folks with little to no social or family support system. In those cases, refer to a local counseling agency or mental health clinic anyway as a way to help people find resources they could be potentially signing up for.  Sorry, kind of ran this off the top of my head so I apologize for my grammar here but definitely connect people to anything possible.","isChecked":false,"level":3,"score":"115"},{"author":"Professional-Mess","body":"I feared this would happen. It must be so hard answering those calls. Thank you for doing what so many others could not.","isChecked":false,"level":2,"score":"70"},{"author":"hurtsdonut_","body":"I was a bartender. The bars and restaurants were shutdown. I was actually relieved because, not gonna lie, I was afraid of dealing with so many people and all the glasses. People would've just kept coming too if the state hadn't shut us down.","isChecked":true,"level":1,"score":"3704"},{"author":"PIG20","body":"You're right.  No doubt they would have kept coming in.\n\nOur governor just scolded the community because while the bars and restaurants were closed as of Monday, he stated that he didn't want social gatherings of more than 50 people .\n\nSo of course, there is a park/playground area in a part of town that actually has a higher concentration of virus confirmations.  And just yesterday all of these family's took their kids to this park.  \n\nPeople stated there were probably 200+ cars in the parking lot and tons of children and adults hanging out together.\n\nThe state police eventually shut it down.  However, it caused the Governor to now take more drastic actions and ended up closing other facilities that were still open to the public.  And now, only groups of 10 or less allowed and he's enforcing this rule by law now.  \n\nHe was visibly pissed...","isChecked":false,"level":2,"score":"1298"},{"author":"hurtsdonut_","body":"People being stupid are what's going to make this so much worse and last so much longer than it could've been.","isChecked":false,"level":3,"score":"754"},{"author":"DoodleIsMyBaby","body":"Like the spring breakers in florida.","isChecked":false,"level":4,"score":"87"},{"author":"Leevitalone","body":"Yes. One things these numbskulls don't seem to understand is that their carelessness is going to affect people's jobs across the board as well as their health. Nimrods. I can't even come up with enough words for stupid to satisfy my anger.","isChecked":false,"level":4,"score":"41"},{"author":"DanceLikeAnEmu","body":"It's bigger than that though. Where I am at, the schools closed, but everyone is still going to work so all those thousands of kids are now in overcrowded daycares. Bars are closed, so people are gathering in garages. The grocers are packed no matter what time of day you go. There seems to be MORE traffic on the roads now than before. We just had our first two confirmed cases, but they are still being stingy about testing and some people are afraid of the cost of testing so they sit in their office sniffling and coughing while the rest of us are working because we can't afford to lose our job or take unpaid leave. \n\nOur gov waited too long and just finally started implementing half measures. It's too late. There's no way to soften the curve when you tell people to isolate and then force them to do the opposite. Now everything is going to be forced to stop right at the peak of our community getting infected. This was bungled so badly. I think these half-ass measures were probably worse for us than just continuing on as we were.","isChecked":false,"level":4,"score":"56"},{"author":"Asak0pt3r","body":"Agree. People were coming in, getting close, I'd have to touch their dirty plates, and I've seen people coughing. A lot of people just don't give a fuck.","isChecked":false,"level":2,"score":"669"},{"author":"hurtsdonut_","body":"Yeah a lot of people didn't give a fuck at all. I'm talking old people too. Then coughers would come in and I'd just have a sense of dread.","isChecked":false,"level":3,"score":"366"},{"author":"Asak0pt3r","body":"I'm talking old people too! At my work almost everyone was a senior. And they're the coughers that are coming in. All I could think was, \"damn, they're all gonna die if we don't get shut down.\"","isChecked":false,"level":4,"score":"120"},{"author":"yohoob","body":"My dad went out to a bar last night. 67 diabetic bad health doesnt think anything will happen. Sometimes I feel like my parents have turned into the kids and I'm the parent.","isChecked":false,"level":5,"score":"153"},{"author":"CarlosDanger0123","body":"My mother is 63.  I'm 36.  I am the parent now.  Feels weird.","isChecked":false,"level":6,"score":"24"},{"author":"Paranoid427","body":"My experience is pretty unique. In a nutshell, my wife and I live in New Zealand and had planned a two year working Visa in Toronto. We were supposed to leave in April, so we had obviously already handed in our notices of resignation to our bosses. Long story short, Canada shut it's borders and my boss has already hired my replacement.\n\nAs a side note, they shut the borders on my birthday.","isChecked":true,"level":1,"score":"14024"},{"author":"finnual","body":"Hey man, just wanted to let you know I arrived in Toronto on that same two year visa from Scotland like 2 and a half months ago. I got a job and everything set up and now it's all been thrown into disarray and I'm sort of stranded over here, at least until things calm down.\n\nI sort of wish I was in your shoes (minus the replacement stuff that sucks regardless). Stay strong and who knows, maybe see you out here at some point if my lungs dont implode.","isChecked":false,"level":2,"score":"1954"},{"author":"Paranoid427","body":"Mate, life's a bastard sometimes. I definitely don't envy your predicament, but chin up and stay safe out there.","isChecked":false,"level":3,"score":"544"},{"author":"Burlytown-20","body":"Oh wow, that just ruined a whole two year plan. Good luck","isChecked":false,"level":2,"score":"2969"},{"author":"jeetkunedont","body":"And the next couple after that, too. Good luck to both you cuzzybros.","isChecked":false,"level":3,"score":"30"},{"author":"muddyshoe","body":"That's rough bro... Hang in there. I hope things take a better turn for you.","isChecked":false,"level":2,"score":"238"},{"author":"Tazzybugg","body":"My husband got laid off on Tuesday. He works about 3 minutes down the road from my work. He showed up at my work with tears in his eyes, apologizing to me for not doing good enough to be kept. He works at a car dealership as an auto technician, where they let go of four techs that day cause of decreasing business. They're letting go of more people this Saturday. My brother is a mechanic there, and is scared to lose his job too. They told my husband that when business picks back up, they \"might\"  call and ask him to come work for them again. \n\nThankfully, I work in the lab of a hospital, so my job is pretty secure. I keep telling my husband that we'll get through it, but I know it's taking a toll on him.","isChecked":true,"level":1,"score":"6391"},{"author":"JKdriver","body":"I’ve read through dozens of these posts, and they’re all heartbreaking. But we will all come out the other end for the better, I hoping for anyway.\n\nHaving said that, as a former tech, I’d say good riddance to the industry. I know that sounds incredibly insensitive because it was income, I know and I get it. But the auto industry, specifically dealerships for techs is a hell hole. And the audacity to say they “might” hire him back, please.\n\nI feel for him because I know that feeling of “I wasn’t good enough to keep around.” but if he feels that much sorrow over it, means he put his heart into it. Someone like him needs to get into a career where he’s valued, and that’s certainly not tech life.\n\nWishing the best for the both of you. Hoping someday to come back and read he’s kicking ass at whatever he’s doing.","isChecked":false,"level":2,"score":"1769"},{"author":"mb250sd","body":"VALUED!!!!\n\nAll of us just long to be valued in some way. And more so when providing. But being valued at your work, whatever it is, is a true boost.","isChecked":false,"level":3,"score":"71"},{"author":"JD_McLaugh","body":"Your post really touched me. I hope he knows that there's a season for evertything. He'll be able to contribute again.","isChecked":false,"level":2,"score":"170"},{"author":"Tazzybugg","body":"Right now, he's helping with the puppers and the laundry lol, stay at home doggy dad. But it actually is pretty nice, cause since I'm working long hours, I actually get to come home and see him again, rather than us both being on and off of work.","isChecked":false,"level":3,"score":"118"},{"author":"AngBunnymuffin","body":"Let him know he is contributing a valuable service to you in the form of both household and emotional labor. You don't have to worry about anything around the house because hes got it covered.  Team work!","isChecked":false,"level":4,"score":"23"},{"author":"Deanscreamed","body":"Imagine all the humans going through this that don't have loving partners? Gonna be alot of suicides.","isChecked":false,"level":2,"score":"68"},{"author":"Tazzybugg","body":"That's a sad realization. I hope they have friends and families that support them and help them through these tough times.","isChecked":false,"level":3,"score":"29"},{"author":"jboymw","body":"If your husband is looking for a change of scenery tell him to look at the forklift industry. The company I work for has not laid anyone off or cut hours. If he's interested shoot me a pm and I'll help as much as possible","isChecked":false,"level":2,"score":"31"},{"author":"GunpowderxGelatine","body":"This hurt my heart so much. :( Best wishes to you and your husband. 🖤","isChecked":false,"level":2,"score":"29"},{"author":"Tazzybugg","body":"Thank you! Thankfully we're both pretty young and don't have children, but I worry so much for families that have mouths to feed and kids to support...","isChecked":false,"level":3,"score":"24"},{"author":"Madasky","body":"Funny you say this, I was paid off last June and remember calling my girlfriend who also worked for the same company, first thing that came out of my mouth was \"I'm Sorry\"\n\nThere is an awful shame to being laid off even when it isn't your fault.","isChecked":false,"level":2,"score":"27"},{"author":"Canadian_Neckbeard","body":"My mom works in vacation rentals doing housekeeping, she's 61, diabetic and has COPD, and lives in a state that has mandatory shutdown of all non essential businesses. When she was informed they'd be laying people off, but also staying open, she told them she's afraid of getting Coronavirus and they laid her off so she could collect unemployment and continue to pay her bills while staying home safe.","isChecked":true,"level":1,"score":"2873"},{"author":"Geminii27","body":"> they laid her off so she could collect unemployment\n\nThat just sounds like such a bizarre system. Here, you can claim (partial) unemployment as long as your income is below a certain level. Doesn't matter how much you work or whether you're 'technically' employed. All you have to be doing is actively applying for other work in some capacity. And the amount you're paid by the government only decreases by 50 cents per dollar of your income (over a minimum limit), so it's always worth taking extra hours or overtime if the opportunity comes up. *And* I'm fairly sure^([1]) that the limit for the accompanying discount card is significantly higher than the point at which your government benefit drops to zero, so you can still be eligible for that even if your cash benefits drop to zero.  \n   \n^([1] Yup, just checked. It's more than four times. Closer to eight, if you have kids and are single.)","isChecked":false,"level":2,"score":"163"},{"author":"Canadian_Neckbeard","body":"Yeah, in the US, you can't collect unemployment unless you're fired for lack of work. If you quit, or are fired for cause, or haven't had full time employment steadily, you can't collect.","isChecked":false,"level":3,"score":"89"},{"author":"termiAurthur","body":"Construction. The whole construction site was laid off, and with the way things are going, the company owner thinks it'll be at least a year before they consider hiring me back.\n\nStarted 3 months ago, and that's at least 50 other people affected, just for this site. The company had several other sites that they laid off employees too.\n\nI'm just lucky I'm still living with my parents, and Dad works as online IT for the general public, so he's nice and busy.\n\nEdit: Sine everyone and their dog is asking, I'm in Canada, Alberta. The site I was on was shut down by the owner, beyond that, idk.\n\nAnd thanks to the bunch of you that offered to help/hire, I was kinda surprised at that.","isChecked":true,"level":1,"score":"16692"},{"author":"tutetibiimperes","body":"Wow, I wasn’t expecting construction to be an industry hit this soon from this.","isChecked":false,"level":2,"score":"4051"},{"author":"2020SBChamps","body":"All trades are going to be hit by this one way or another. I’m a plumber who mostly does residential service calls and people haven’t been calling unless they have an emergency that needs to be taken care of. Luckily I work for a family company(just myself my dad and my brother) and we’ve just been referring potential customers to other businesses who are still working. My dads in his 60’s and with the small amount of overhead that he has he figures it’s better to be safe for a couple weeks since he knows all of us are going to be ok financially if we miss work for a couple weeks.","isChecked":false,"level":3,"score":"2695"},{"author":"DocBiggie","body":"I was joking with my wife about this but I wonder how much truth there is to it: People are going to be trying to flush all sorts of non-tp over the next few weeks. Maybe plumbers will be in high demand.","isChecked":false,"level":4,"score":"1318"},{"author":"2020SBChamps","body":"I’m gonna take this opportunity to make a PSA. Do not, under any circumstance, flush anything that is not toilet paper or something that comes out of your body. As gross as it is, if you need to resort to using paper towels, baby wipes, napkins etc. to complete your business put it in a plastic bag, tie it off and put it in the trash. Your pipes will thank you.","isChecked":false,"level":5,"score":"1601"},{"author":"-___-_-_-","body":"I have literally seen three plumbers on my street since Monday.","isChecked":false,"level":5,"score":"23"},{"author":"Devs00","body":"Pennsylvania just shut down all construction among other non-essential industries as of 8pm EST.  Just lost my job as a carpenter today.  Never been on Unemployment, never been without a job.  I always had a plan and switched careers 3 times now.  I have no idea what I'm going to do now.","isChecked":false,"level":3,"score":"44"},{"author":"Marauder_Pilot","body":"I'm the opposite-I'm am electrician, and my company is screaming for bodies because none of our sites have been shut down yet but anyone sick or potentially exposed must quarantine for 2 weeks, so we're down probably 25% of our workforce on that alone.\n\n\nWorks well for me because my wife got laid off on Wednesday.","isChecked":false,"level":3,"score":"72"},{"author":"SaritaMDG","body":"Same. We do primarily infrastructure. Utilities, roadway, airfields. We have all the work and no electricians. I'm in the office, so I have the option of working from home if need be, but if projects stop, I have no work to do. I'm not in a super hard hit state, so we don't have a lot of guys out on quarantine. Yet.","isChecked":false,"level":4,"score":"25"},{"author":"None","body":"[deleted]","isChecked":false,"level":3,"score":"26"},{"author":"rcblender","body":"\nAs someone who does IT for my company I can vouch for being busy in this field, we are slammed in this chaos. I honesty thought our projects would get slowed down or put on hold. Nope. Instead we have to still do those and all these urgent items and chaos that’s resulted from this situation. We’re heading fast towards burnout.","isChecked":false,"level":2,"score":"45"},{"author":"termiAurthur","body":"Everyone's home, so they need tech support! Plus all the initial people needing help with setting up work from home.","isChecked":false,"level":3,"score":"24"},{"author":"BrokenDeeReynolds","body":"I'm in college. The construction management department is a shambles. Everyone's losing their jobs or internships - internships required to graduate. These are weird times","isChecked":false,"level":2,"score":"38"},{"author":"raisedbytelevisions","body":"I do commercial construction, and I think I got lucky because we're in the final stages of finishing the building we're working on right now. The contractor is not going to stop for any reason with this much money on the line, imho","isChecked":false,"level":2,"score":"26"},{"author":"sleepykitten12","body":"Oh wow, my bf works construction and they are still working 40-60 hrs a week thankfully with few rumors of closing. I’m a nurse at a hospital though so even if it does we’ll be okay.","isChecked":false,"level":2,"score":"23"},{"author":"PM_ME_YOUR_TYLENOLPM","body":"F&B manager at a large hotel.\nGM and HR gave me a list of employees to call and inform them that they would all be furloughed.\n\nIt was the hardest thing I’ve had to do in my life. I had to stop halfway through the list just to sit in my office and cry. I had to encourage grown men and women that everything would work out and be okay when I had no idea myself if or when it would be.\nI went to work this morning, worked my normal 10 hours, then I was laid off at the end of the day.\n\nI cried again on the way home.","isChecked":true,"level":1,"score":"2053"},{"author":"Veyron9190","body":"Jesus this is heartbreaking to read","isChecked":false,"level":2,"score":"371"},{"author":"MarchesaCasati","body":"Just fuck that GM and HR for making you do their dirty work then throwing you away when it was over.\n\nSelf-serving Psychopaths...","isChecked":false,"level":2,"score":"566"},{"author":"YupYupDog","body":"This!! What the actual fuck. I’ve read a few stories like this. People are so shitty.","isChecked":false,"level":3,"score":"93"},{"author":"Luffyy97","body":"Fuck dude that is awful. I can’t begin to imagine how difficult that is. I really feel for you.","isChecked":false,"level":2,"score":"32"},{"author":"ThatTXHRlady","body":"Jesus, I am so sorry. As an HR Mgr I can tell you that your HR is a POS. HR doesn't get paid for cute and fuzzy stuff, our role is to have difficult conversations with people. Please apply for unemployment asap :(","isChecked":false,"level":2,"score":"32"},{"author":"Sardonic_007","body":"I’m a vendor to hotels And talk to FB everyday. I’m devastated to see this happen. I talked to a dude who went through this very thing a few days ago and my heart ripped in two for this guy having to deliver all this bad news. Just horrible. \n\nThanks for all you do and your people know it isn’t your fault.","isChecked":false,"level":2,"score":"24"},{"author":"TummyDrums","body":"I haven't lost my job, but my small software company instituted 30% paycut across the board.  They say it'll be re-evaluated every month.  Clients keep cancelling or postponing projects.  So I'm good this month, but could easily lose it next month.  I'm just happy they decided to cut pay instead of fire 30% of the workforce, so everyone can keep their health coverage.  That and I'm not sure I wouldn't have been part of that 30%.","isChecked":false,"level":1,"score":"8220"},{"author":"itzfritz","body":"Having the same concerns here. Dev for a large software shop exclusively serving the auto sales industry. If we have to shelter in place for a few months and nobody buys cars our cash flow is going to disappear. Lots of people out of work (thousands?).  Might be a good idea to look for remote work in the medical industry, before every dev that’s been laid off in April is competing. Also remote work companies will be in high demand (providing tele-something services), and probably ISPs as their oversubscribed customer base suddenly using services 24/7 is going to overwhelm them. Maybe cloud/auto scaling experience would be good here.","isChecked":false,"level":2,"score":"873"},{"author":"Coachkfan1","body":"Work for a furniture company whose customer base is hotels. VERY concerned about the coming months. Possible silver lining - after this is over, hopefully all of these hotels will want new furniture as they throw out the old “contaminated” furniture.","isChecked":false,"level":3,"score":"93"},{"author":"hciwdnassybra","body":"I worked at a specialty custom cake shop, my bosses are a brother and sister that own the business. They have been terrified of covid-19 since it started in January and have been throwing around the idea of closing ever since then. When all the employees would panic and ask what would happen to us if you close they would just say “don’t worry about it, we will figure it out”. \n\nLast week we got an email giving us 6 days notice that we will be closed for the following month with partial pay. By the time we reached the final day we would be open before the month of closing, they told us that we were actually being laid off, the partial pay for the month would be severance and they are unsure of when they will open. \n\nThey act like this is only temporary, but I know that they are refusing custom cake orders all the way until August. \n\nThey also make no promises to be able to hire us back after they reopen later this year since they may not be able to afford it.","isChecked":false,"level":1,"score":"485"},{"author":"wogwai","body":"I was laid off from my 5 year graphic design job, working for a screen printing and promotional products company. About half of our business involves schools, sports, and events. Obviously none of that is happening currently, so our business has stagnated. They are going to try to operate with a skeleton crew for the next couple months. The hope is to bring everyone back eventually, but I'm not optimistic.","isChecked":false,"level":1,"score":"25812"},{"author":"CommodoreBelmont","body":"Solidarity. I'm a web developer, pretty much the same industry. (Fabric decor, projection screens, giant shade structures, etc.) I'm optimistic things will bounce back eventually, and I trust my CEO that I will be called back when that happens -- he's always been extremely good to all of the employees, and we're good friends at this point -- but I'm not optimistic that it'll happen within the next few months.","isChecked":false,"level":2,"score":"6132"},{"author":"wogwai","body":"Yeah it's tough. The demand will definitely be back eventually, just waiting all this out will suck. If anything, it sounds like we both will have great references if something else surfaces. Good luck!","isChecked":false,"level":3,"score":"1266"},{"author":"CommodoreBelmont","body":"Yeah, the CEO, and two of the management team all said they'd give me great references and letters of recommendation. Good luck to you too!","isChecked":false,"level":4,"score":"43"},{"author":"seany187","body":"Do you have experience with WordPress / Drupal, PHP, HTML/CSS I am looking for some reliable freelancers to help with my overflow.","isChecked":false,"level":3,"score":"22"},{"author":"WaryPancreas","body":"Same. Been doing design work for churches for 8 years. They've all closed and canceled Easter events so there's nothing for me to design promotions or material for. Was told they'll let me know when they need me again...","isChecked":false,"level":2,"score":"532"},{"author":"PM_me_lemon_cake","body":"My family owns a small screen printing and embroidery shop. We’ve been hit hard since all our business is schools, restaurants, bars, and large social gatherings. We’ve stayed open since we had a few large jobs left this week, but looks like we have to lay everyone off on Monday. It’s horrible to have to lay off our employees that have been with us for so long. We hope to hire them all back, but who knows which of our customers will still be in business once this is done. Government assistance cannot come quickly enough. \n\nStay safe and good luck out there friends!","isChecked":false,"level":2,"score":"36"},{"author":"pottymouthgrl","body":"Same I’m a graphic designer in the trade show/convention industry.","isChecked":false,"level":2,"score":"22"},{"author":"jebbaok","body":"Yeah i just got hired last week but i think that my first workday isn't gonna happen","isChecked":false,"level":1,"score":"36889"},{"author":"ablinux","body":"That sucks, be strong buddy","isChecked":false,"level":2,"score":"7480"},{"author":"None","body":"i'm glad i'm still a student and was only working part time at starbucks... honestly wouldn't be sure what to do if I'm working full time and got laid off","isChecked":false,"level":3,"score":"928"},{"author":"Above_Everything","body":"If you’re a student you’re going to have a rough time even after a recession. It’s going to make it much harder to fulfill the purpose of going to school which is get a job, I’m also a student if it sounds like talking down","isChecked":false,"level":4,"score":"685"},{"author":"badama","body":"After the 2008 recession grads in certain fields (business/economics/lawyers) had a tough couple of years after since the market was flooded with experienced laid off employees. Hope the same doesn't happen here.\n\nThey had to work supermarket/fast food to get by even with their fresh expensive degree.","isChecked":false,"level":5,"score":"430"},{"author":"DaughterEarth","body":"> Hope the same doesn't happen here.\n\nIt absolutely will though. If this event doesn't convince people that social policies (in moderation) are useful for society being able to function effectively then humanity is a lost cause.","isChecked":false,"level":6,"score":"80"},{"author":"introvertedbassist","body":"As a business major I’m terrified. I hope accountants are in high demand in two years.","isChecked":false,"level":6,"score":"21"},{"author":"coolbean7","body":"I currently for for a fortune 200 business and I think you would be alright. Lots of corporate business fields can work from home. Finance especially is position needed no matter what. I think the most vulnerable are many entertainment and service industries that directly rely on people being out. \n\nFor accountants though, Id be more worried about possible automation of financial systems.","isChecked":false,"level":7,"score":"26"},{"author":"TakeThatOut","body":"You're right. Before covid 19 escalated, a number of accountants laid off from our company because of  automation.","isChecked":false,"level":8,"score":"19"},{"author":"Certain-Sweet","body":"I work in software, and I do a little development of tools for internal use. Members of the finance team team keep coming to me to ask me to automate certain tasks, and I want to shake them and tell them that they don't want me to do that.","isChecked":false,"level":9,"score":"27"},{"author":"x420PussySlayer69x","body":"Yep. Talk to anyone that graduated between oh, 2008 and 2012. It literally took me 3 years to find meaningful employment. Hope you’ve been saving.","isChecked":false,"level":5,"score":"28"},{"author":"enlightningwhelk","body":"I’ve heard a statistic that people who graduate during a recession make quite a bit less over their lifetime than people who graduate during better times. That makes me sad for current college students.","isChecked":false,"level":5,"score":"30"},{"author":"PM_YOUR_BUTTOCKS","body":"I started 2 weeks ago as a software developer. I'm already working remotely, but since I don't have people nearby I have to rely on learning through video and text chat. Works been hard...","isChecked":false,"level":2,"score":"1574"},{"author":"None","body":"[deleted]","isChecked":false,"level":3,"score":"230"},{"author":"SpringCleanMyLife","body":"Similar, I'm a software engineer and my company's revenue is down 35% so far. It's weird going from a spot where you feel like your job couldn't be more secure, to suddenly seeing the possibility of being laid off.\n\n  \n\n\nPlus I've always felt like even if I *did* get laid off for some crazy reason, it'd be easy to find another job. But now even that's far fetched.\n\nStrange, strange times.","isChecked":false,"level":4,"score":"308"},{"author":"rudboi5","body":"What kind of software? I work in security and we have seen an uptick in activity due to remote work, seems like firms are trying to patch the holes in potential vulnerabilities  associated with remote work. In a month though, who knows. Luckily it’s a small firm that has grown organically (no debt).","isChecked":false,"level":5,"score":"49"},{"author":"SpringCleanMyLife","body":"I'm a data engineer in retail ad tech. Tbh  i'd be totally fine with taking a pay cut or even involuntary furlough if it means we don't have to lay people off.\n\n  \n\n\nWe have a ton of private money behind us so I'm not worried about the business imploding permanently, but these next few months we're gonna have to trim some fat for sure.\n\n  \n\n\nYeah there are pockets of industry that are exploding right now. I'm glad at least some of us are feeling good!","isChecked":false,"level":6,"score":"23"},{"author":"Jester513315","body":"Yeah working from home and being new is honestly very stressful.","isChecked":false,"level":3,"score":"73"},{"author":"PM_YOUR_BUTTOCKS","body":"I felt really bad today because first my work laptop wouldn't connect to my WiFi, then I couldn't connect to works VPN. Took me 3 hours just to \"start\" working","isChecked":false,"level":4,"score":"44"},{"author":"hematino","body":"I feel your pain. Im a newer software analyst working for a healthcare system and in a similar situation, and its difficult learning new things without having the luxury of asking someone in the office how to use a new tool. Hang in there!","isChecked":false,"level":3,"score":"31"},{"author":"naknekv","body":"You should consider yourself lucky you got hired two weeks ago, I got hired last week but I haven't signed yet and now I can't start. I'm doing online courses for the stack I'm gonna use but no salary and no security that I will have a job when quarantine ends.","isChecked":false,"level":3,"score":"18"},{"author":"rmpc92","body":"That's what I'm worried about for my girlfriend. She got hired before everything hit the fan but her start date is in like 10 days so I'm worried they might delay that. Thankfully it's a position that's mostly remote and has to do with insurance claims so maybe she'll be good?","isChecked":false,"level":2,"score":"2085"},{"author":"TheAlGler","body":"My wife and I both work for insurance companies. Can confirm she will be alright granted it is a well established company.","isChecked":false,"level":3,"score":"1358"},{"author":"rmpc92","body":"It's a subsidiary of HCA so definitely a solid company. Thanks for the reassurance though that helps, hope you and your wife get through this all smoothly.","isChecked":false,"level":4,"score":"532"},{"author":"orbthatisfloating","body":"Work for an insurance company, can guarantee she will be fine, only guys who have to stay in the building are the ones building laptops for everybody - i.e. me","isChecked":false,"level":3,"score":"319"},{"author":"overandunder_86","body":"I have an interview (phone) tomorrow for a finance position. It might be a waste of time.\n\nFor those who are still around this comment: the interview went well.","isChecked":false,"level":2,"score":"536"},{"author":"One_Evil_Snek","body":"But you don't know! So give it everything you've got and it might surprise you! You've got this!","isChecked":false,"level":3,"score":"765"},{"author":"bdjohn06","body":"You might actually be fine. My roommate was interviewing for a finance position while things really kicked off here (SF Bay Area). She got an offer just two days ago and accepted. She'll be working from home from the very beginning. They've been very understanding about the circumstances.","isChecked":false,"level":4,"score":"41"},{"author":"overandunder_86","body":"Thanks","isChecked":false,"level":4,"score":"31"},{"author":"birdsarentrealidiot","body":"Thats what happened to me too. Have been unemployed for a long time and i really needed that job. Shit sucks for so many right now so i feel so lucky that i have the things i have. Stay strong my friend, this will pass","isChecked":false,"level":2,"score":"219"},{"author":"whatchagonnado0707","body":"If you are in the UK, the major supermarkets are on a recruitment drive with a fast turn around of getting people in position.\n\nI know this isn't a story about losing a job but hopefully this helps someone coming to this thread.","isChecked":false,"level":1,"score":"19584"},{"author":"OHManda30","body":"I’m in the state of Ohio in the US and I’m seeing a lot of those opportunities too.","isChecked":false,"level":2,"score":"3676"},{"author":"Mommyoser2016","body":"Texas too. The grocery stores are hiring","isChecked":false,"level":3,"score":"1603"},{"author":"B0NESAWisRRREADY","body":"I'm in pet retail and even I'm about to start hiring. Were shifting to more of a ship-from-store model in additional locations and need people with warehouse or stocking experience. People still need to feed their furbabies. If you need a job right now be proactive (REMOTELY, don't come in to ask, please just call first) and check with places maybe you wouldn't otherwise expect to be hiring. You never know. I know I wasn't sure what the demand would be like for our industry right now but it doesn't look to be slowing down.","isChecked":false,"level":4,"score":"120"},{"author":"dldppl","body":"Australia too!","isChecked":false,"level":2,"score":"593"},{"author":"Lone_Vagrant","body":"Coles apparently received 36 000 applications for job openings. Crazy.","isChecked":false,"level":3,"score":"28"},{"author":"canering","body":"Yes grocery stores will be hiring everywhere. It just sucks because for a lot for people it’s a pay cut or a health risk. I wonder if the demand for more workers will level off if everyone starts trying to get these jobs at once","isChecked":false,"level":2,"score":"62"},{"author":"Thing1234556","body":"Not just if everyone applies for jobs, but for how long will the markets be overrun like this? People will eat at home more than at restaurants now, but how much more? Once people have “stocked up” on groceries how many more will they need?","isChecked":false,"level":3,"score":"32"},{"author":"canering","body":"True. And I expect when the grocery stores stabilize, the first employees to get reduced hours or laid off will be the new rush hires","isChecked":false,"level":4,"score":"24"},{"author":"RomeoWhiskey","body":"Yep, Grocery stores are doing major business right now and they're not getting shut down anytime soon.  Kroger, where I work, just announced they're looking to hire 10,000 new staff.","isChecked":false,"level":2,"score":"24"},{"author":"blackforestgirl86","body":"I just finished my training as a flight attendant for a major European airline. It's been a dream of mine and I have been putting my love and energy into this training for the past months.\nI'm in Cancun right now and it's bitter sweet because it's absolutely beautiful here, but at the same time this was my last training flight, I'm now a fully trained flight attendant and yet noone knows when me and my other new colleagues will actually be getting our work contract since the airline industry is suffering a lot right now.\n\nI think I will cry when landing back in Frankfurt tonight, because I don't know when will be my next flight... but I will put on a brave face and genuine smile for our passengers, at least I will do my best.","isChecked":true,"level":1,"score":"4127"},{"author":"rocketMX","body":"I work for an airline here in the U.S. I like your positive attitude! Hang in there and Viel Glück!","isChecked":false,"level":2,"score":"622"},{"author":"blackforestgirl86","body":"Hey, vielen Dank, thank you so much for your encouraging comment. It's put a smile on my face.\nI wish you all the best as well!","isChecked":false,"level":3,"score":"66"},{"author":"rocketMX","body":"Of course and thank you! I was supposed to be in Munich right now however the travel ban has made that not possible. Just have to keep positive!","isChecked":false,"level":4,"score":"27"},{"author":"Panaka","body":"Just got word this morning that my previous airline is shutting down operations on the 7th. Lots of my friends who have very niche skills are going to be unemployed for a while.\n\nJust waiting for my airline to turn off my badge and tell me to come back in a few months.","isChecked":false,"level":2,"score":"31"},{"author":"AN1110","body":"I've always read 40% of Americans or something are \"one paycheck away from poverty,\" but fuckkk...this virus is really putting that in to perspective. Stay strong and safe out there!","isChecked":false,"level":1,"score":"1033"},{"author":"Bornado","body":"Related, but theres another saying\n\n\"Every society is 3 meals away from revolution\"","isChecked":false,"level":2,"score":"434"},{"author":"Ivan_Botsky_Trollov","body":"every human is 2 missed paychecks or 4 days without food from transforming into MAD MAX","isChecked":false,"level":3,"score":"36"},{"author":"elbrigno","body":"Classical musician here.\nEvery orchestra had to cancel concerts for the next 8 weeks. Unsure if any of the concerts will be reschedule. \nMany orchestras are waiting to see if the “act of god” clause will be applied. If that is the case, musicians will not be payed. \nMost summer orchestras are still programmed but there is high chance will be shut down as well.\n\nEdit: in the US","isChecked":false,"level":1,"score":"3288"},{"author":"thesheba","body":"NOLA shut down all the bars there. There are a lot of working class jazz musicians that were already living hand-to-mouth. I’m worried for them and hope the government does come through and give adults $1,000-$3,000. It could be life or death for some people in terms of nutrition.","isChecked":false,"level":2,"score":"612"},{"author":"SanguineRoses","body":"My dad works for a USA based firm in the Netherlands, they pulled the act of god thing as well. Luckily he wont be laid off, he'll just be working from home.","isChecked":false,"level":2,"score":"278"},{"author":"Ashley_Sparkys","body":"For a second I thought your dad was a classical musician as well, and the thought of every musician in the orchestra on a Skype call playing their parts made me laugh. I hope something like that would live up to the real deal, like the one guy who doesn't mute his mic and coughs every few minutes","isChecked":false,"level":3,"score":"24"},{"author":"belethors_sister","body":"I work in concerts/touring/events. I'm mostly a PA or Coordinator but when I work cons I deal with celebrities as a handler (@jorisboringstories for proof and info). I literally had just come off C2E2, confirmed my job offer for Coachella and Stagecoach, was finalizing things needed for Ultra and going to look over my contract for Bonnaroo before heading to Seattle in two weeks for Emerald City ComiCon for another round of celebrity babysitting.\n\nI three hours after I came home my street was destroyed by a tornado. About three days after that I was told Coachella is being cancelled. Then Ultra cancelled. Then ECCC. I was interviewing for a production coordinator position for a big world tour taking off in the summer and it's, understandably not progressed.\n\nI lost 6 months of solid work in the span of a week. A year in a week and a half. Yeah, I know, things are being rescheduled but... That's a shock, especially after a tornado reduced your neighborhood to rubble. \n\nI'm lucky that I have a really strong relationship with a couple of temp agencies I use to fill my time between gigs. They got me a job processing life insurance policies because it's apparently the busiest it's ever been for that industry. I'm not unfamiliar with data entry or office work, but this is the first time I'm legit scared my career is done.","isChecked":false,"level":2,"score":"41"},{"author":"hilariousmars","body":"Freelancer here. Lost all of my gigs and most of my students due to social distancing almost overnight. The worst part is I can't even get unemployment.","isChecked":false,"level":2,"score":"20"},{"author":"codenteacher","body":"I'm a substitute teacher. If you are aware that most schools are closing if they haven't already, then that should explain why all subs are now effectively unemployed. It's unlikely that schools will return during this situation, so yes, thousands of people are out of work just from that alone. Subs don't make salary, so any employee who is hourly or paid by day now needs to scramble.\n\nEdit: Because so many people are unsure whether they should file for unemployment or not and are in a similar situation (being a substitute or a different employee that was hourly or a position that was cut due to our current circumstances), please do. You absolutely can and should file for unemployment. It may take some time with the influx of applications, but this situation is what that government service is for. I extend my best wishes to everyone and their friends and families. I hope you all stay healthy and hold onto hope. Be smart and safe.","isChecked":false,"level":1,"score":"13993"},{"author":"davosknuckles","body":"I am too. The staffing service says they are working to see what kind of remote teaching opportunities there will be for us, which won’t happen I’m sure. I’ve filed for unemployment but half of my already measly part time “salary” isn’t going to help much. More so than money, I’m going to miss the kids so much. I sub at one school and know about 75% of the students very well. This whole situation is incredibly sad and lonely feeling.","isChecked":false,"level":2,"score":"932"},{"author":"adrionallama","body":"I’m a cyber school teacher and we aren’t working right now which is really confusing to me. I’m an independent contractor too so I’m just not getting paid.","isChecked":false,"level":3,"score":"307"},{"author":"madmaxturbator","body":"don't want you to be getting them computer viruses either, those little fellas crawl through the tubes","isChecked":false,"level":4,"score":"145"},{"author":"DefinitelyGirl","body":"My district is paying hourly workers for what they would have worked. They're looking at what they usually make to help make a decision as to the amount you get on each check. They just approved it this week.","isChecked":false,"level":2,"score":"1883"},{"author":"LogicalSabotage","body":"I have family in the same boat, except here their shitty school district has opted to not pay their hourly workers at all. Considering they are fully funded by the state and local property taxes, their choice is especially bullshit.","isChecked":false,"level":3,"score":"901"},{"author":"Moose-Antlers","body":"Then show up at their office with a posse and revolt.","isChecked":false,"level":4,"score":"285"},{"author":"HomeHusband","body":"Just make sure your posse stands 6 feet apart from each other obviously.","isChecked":false,"level":5,"score":"509"},{"author":"Ridiculoushavoc","body":"And involves < 10 people total","isChecked":false,"level":6,"score":"168"},{"author":"Sigroc","body":"Same here! My district closed last friday and I was working when they announced over the intercom that school would be closed. Seeing all the kids hooting and cheering while I was trying not to freak out over losing out on my income was a test lol. \n\nNeedless to say I'm pretty much out of luck, and rumor has it that school might not reopen this school year. I've been saving up for a big move so this threw a wrench in that plan.","isChecked":false,"level":2,"score":"236"},{"author":"WizardKagdan","body":"From the bright side: count your blessings that you did not yet spend all that money you were saving up, imagine having to go through this without that buffer...\n\nStay safe, stay strong. You'll get through this.","isChecked":false,"level":3,"score":"29"},{"author":"xtthew","body":"My son's teacher is a long-term sub while his regular teacher is on parental leave. I immediately though of all the substitutes when they started announcing school closures.","isChecked":false,"level":2,"score":"265"},{"author":"Bronnichiwa","body":"I can’t speak for your son’s teacher’s situation, but I know in my county, long term subs are still paid as long as they’re 30 days into their contract.","isChecked":false,"level":3,"score":"115"},{"author":"RealMcGonzo","body":"My GF is a sub and in exactly the same boat.","isChecked":false,"level":2,"score":"66"},{"author":"AngryValephar","body":"I got a call congratulating me on getting a job two days before a hiring freeze went into place at the University I applied to. I never saw my contract, nor do I have any work.\n\nEdit: Thank you for the gold. I wish it had been on a cheerier post. We're in this together and we'll get through it together, a step at a time. Look after one another. Be considerate, and be kind to yourselves. Here's hoping this blows over sooner rather than later.","isChecked":true,"level":1,"score":"24970"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"6092"},{"author":"Tmonster96","body":"Well that de-escalated quickly.","isChecked":false,"level":3,"score":"2494"},{"author":"Nearseer","body":"*confused screaming *","isChecked":false,"level":4,"score":"48"},{"author":"motherfuqueer","body":"Not me, but my wife has been told that basically \"we'll call you if we need you,\" and they don't really need anyone tbh. She hasn't worked a minute since the 13th. And my sister was a bartender at an arcade, so she's totally fucked. She's been laid off with the promise of reinstatement when they reopen.","isChecked":false,"level":1,"score":"16026"},{"author":"dickfromaccounting","body":"It’s almost worse to be left in limbo like this than it is just to be fired outright","isChecked":false,"level":2,"score":"5467"},{"author":"motherfuqueer","body":"That's how they both feel. Wife works at a bookstore, which don't have great futures anyway, and sister works for a local business. They both have no idea what's going to happen, if their jobs are going to exist when this is all over.... I'm scared for them, can't imagine how they feel","isChecked":false,"level":3,"score":"2416"},{"author":"SnowplowS14","body":"Considering it’s a local business, I feel like their bosses don’t even know what’s going to happen","isChecked":false,"level":4,"score":"1354"},{"author":"motherfuqueer","body":"Nope, I can only imagine their panic. The arcade my sis is in is a huuuge attraction in her town, everyone goes there. I don't know the guy who owns it, but I do know that he just went from making a metric fuckload of money to absolutely zero. And he's still paying the rent on it, and he lives in a very expensive town. Yeah, everyone is fucked in that situation.","isChecked":false,"level":5,"score":"934"},{"author":"CelticRockstar","body":"It’s rough here in Seattle; not only were all our music performances cancelled, the locally-owned small businesses that are our best venues are in serious jeopardy. The pub I play in weekly was able to sell their existing stock and beer as takeout and growler fills, but the bookstore that has been the hub of trad music in Seattle? In critical need of donations. Even the Portland-defining bookstore Powell’s might not return. Awful, awful times. Many of my musician friends are using livestreams and an online tip jar to help, but what do businesses that have products they can’t sell do? There’s not much they can provide digitally. Can’t download a sandwich.","isChecked":false,"level":6,"score":"605"},{"author":"One_Evil_Snek","body":"I'd download a sandwich. I'd also probably download a car.","isChecked":false,"level":7,"score":"421"},{"author":"ninjah1944","body":"1 sandwich.jpg coming your way boss.","isChecked":false,"level":8,"score":"134"},{"author":"One_Evil_Snek","body":"99%... 100%! ORDER UP!","isChecked":false,"level":9,"score":"106"},{"author":"toucss","body":"But even if fired outright, no one is hiring right now.  \nFortunately I have a job but the one I was applying for has put a stop on recruitment until this passed. And even then they may not recruit again for a while because they might not have the revenue to hire more staff.\n\nEdit; \nBecause people are taking my words literal. \n*A lot of places aren't hiring right now.\n\nEdit 2;\nI dont want to reply individually.  \nYes some jobs may be hiring right now, mostly retail, but they're all on a temp contract. To those who have already lost their job, they will just lose another job in 1/2 months, when this all settles. \nSo what I'm saying is it's not necessarily better to be fired outright because you would still be in limbo when the temp retail job inevitably ends. Not everyone will be hired as permanent at the end of this all.","isChecked":false,"level":3,"score":"328"},{"author":"emmahar","body":"In the UK at the moment, there's tonnes of jobs. All for temporary workers in supermarkets, delivery drivers to meet the extra demand etc. But that doesn't take away from the fact that people shouldn't be put in this situation","isChecked":false,"level":4,"score":"230"},{"author":"randombits","body":"I’ve been advised to not stop for the red light in front of CostCo lest I be drawn into some sort of involuntary servitude.\n\ne:typo","isChecked":false,"level":5,"score":"134"},{"author":"eatingmaggotsmichael","body":"I am working in the food supply chain, we are going to need extra staff to keep up with the demand. If you are in need of a job currently please do consider working in food manufacturing. Even though everything is so uncertain, people need to eat.","isChecked":false,"level":5,"score":"178"},{"author":"DiamondGP","body":"Not a lawyer but I've heard that could qualify as constructive dismissal, which counts the same as getting fired for unemployment relief purposes.  Worth looking into.","isChecked":false,"level":2,"score":"188"},{"author":"StarsCanScream","body":"Manager at a movie theater. I already saw it coming so it wasn’t that shocking to hear. We were only seeing about 200 people a weekday down from our average of 900. \n\nGot called in by the GM and we were told that we were closing indefinitely. It’s looking like 6-12 weeks. I’m fortunate enough to have enough money saved that it isn’t really an issue for me but it really upset me knowing that a lot of the people who work in the building have no other source of income and scrape by with their paychecks. \n\nFingers crossed it’s 6 weeks... Maybe less.","isChecked":false,"level":1,"score":"3324"},{"author":"the_happy_otter","body":"This might come across as ignorant but it's a genuine question so I apologise in advance if any offense is caused. I generally assumed movie theatre work wasn't massively well paid. Do you mind sharing any tips you might have to prepare for up to 12 weeks unpaid?","isChecked":false,"level":2,"score":"114"},{"author":"StarsCanScream","body":"No that’s alright. You aren’t wrong. Theater workers generally make a little over minimum wage. But as a manager, I make just shy of $15 an hour. While it’s not GREAT, as someone with roommates, it’s more than enough to pay my portion of the bills and have plenty left over.\n\nI’m not a big spender to begin with so all my extra money ends up sitting in my bank account. So I definitely have enough to go about a year without a job if I needed to do so.","isChecked":false,"level":3,"score":"202"},{"author":"DeusUrsus","body":"Hopefully you considered the possibility that your roommates may not be able to pay their share of rent or bills due to all this too. Fingers crossed that’s not gonna be a problem for you guys!","isChecked":false,"level":4,"score":"65"},{"author":"StarsCanScream","body":"So far they still have their jobs. And in their line of work, I don’t see those positions being laid off. Fingers crossed though!","isChecked":false,"level":5,"score":"61"},{"author":"spmahn","body":"I was a GM for Regal a decade ago and made the equivalent of $15/hr salary which was a joke for the level of responsibility involved. I was in the building at least 55 hours a week, I was a babysitter for all my employees and managers, I was responsible for maintenance, scheduling, budgeting, staffing, inventory, ordering, it was preposterous and I demanded a demotion after 3 months. Regal, at least as that time, was a vile, horrible, evil company to work for that didn’t give two shits about their employees or their well being. Surprisingly, I’ve heard that since being bought out by the British it’s actually gotten worse.","isChecked":false,"level":4,"score":"32"},{"author":"anyklosaruas","body":"My husband used to work in a movie theater, and as a manager too. So he got paid $7.50/hour instead of $7.25/hour. Haha.","isChecked":false,"level":3,"score":"24"},{"author":"lzrkennyloggins","body":"I was laid off indefinitely from 2 different hourly paying line cooking jobs on Monday(~50hrs combined/week) I helped clean out one of the restaurants Wednesday. We discarded a lot of stuff.  I helped clean out all of the coolers and throw away A LOT of prepped food that people didn't/couldn't take home. Employees we're encouraged to take what they wanted; produce, dairy, meat etc. The place is almost completely empty, it's surreal. \n\nMy spouse was laid off indefinitely Wednesday. She manages a restaurant and is salaried w/ benefits (~50hrs/week). She was told that management will not be paid until the place reopens. \n\nOur family currently has no work or income. We have a young child. These are very uncertain times.\n\n\nEdit/Update: We are healthy and staying happy; lots of extra time to play with the kiddo 😉 We have food, water and other saved resources. We are exploring unemployment insurance and a couple of other options. Thanks for all of the love, this story could be the same for millions right now. Take care of your family and neighbors, try to spend and shop local. We get past this together!","isChecked":false,"level":1,"score":"14713"},{"author":"stupidlyugly","body":"To the young child part, that happened to me after 9/11. WIC, Medicaid for the kid, unemployment benefits. Now is the time to pursue them all. They were a lifesaver for me. You've been paying into this your entire working career via unemployment insurance deductions, so don't feel guilty about using what's available.","isChecked":false,"level":2,"score":"5158"},{"author":"Onepopcornman","body":"SNAP too and get in contact with you local foodbank.  I'm sure there is a lot of competition so the sooner the better.","isChecked":false,"level":3,"score":"1822"},{"author":"CaffeineFueledLife","body":"I went to a food bank the other day. My husband's store hasn't closed yet, but it's being discussed and this is a small town so the food bank is only open once a month. We got 3 whole frozen chickens. For a family of 3. Among other things. It will definitely help. I felt embarrassed about going, but it would be worse to scramble to feed my 2 year old. And I'm pregnant and having difficulty with weight gain, so rationing isn't practical for me, either.","isChecked":false,"level":4,"score":"1035"},{"author":"Onepopcornman","body":"Don’t feel embarrassed those services are there for a reason. Just remember to give back down the line when things are less tough. We’re all in this together.","isChecked":false,"level":5,"score":"1020"},{"author":"tomseankay","body":"In Ireland this is our motto, we are in it together. I see amazing community spirit, and pulling together to get through this. Proud to be Irish. Proud to be human","isChecked":false,"level":6,"score":"310"},{"author":"rocketmike","body":"I used to work in social welfare programs. I was also on SNAP. It's how I found out about the job... I'm college educated and got laid off. People who haven't been poor (and I mean really poor, I thought I was poor growing up... I wasn't) sometimes think that benefits are for a certain type of people or a certain type of situation. I like to tell everyone that you are one decision or event away from poverty  unless you are wealthy. The middle class fall between the cracks in the US.","isChecked":false,"level":6,"score":"20"},{"author":"lakashhar","body":"3 chickens can go really far!!!\n\nfirst thing you need to do is debone those guys. \n\n [https://www.youtube.com/watch?v=G59cKe9UICY](https://www.youtube.com/watch?v=G59cKe9UICY) \n\n**MEAT:** \n\ncut the meat into \"largish\" bite sized chunks (they will reduce in size when cooked) separate the meat by light and dark.\n\nIf possible, weigh it, and use around a half pound per meal (about a half a cup). I understand this isn't much by today's standards (with a doubled amount of meat consumption since 1950!), you will have to rely on beans, rice, pasta, and veggies to get you farther.  Here's why doing this will also help our planet:  [https://www.hsph.harvard.edu/nutritionsource/sustainability/plate-and-planet/](https://www.hsph.harvard.edu/nutritionsource/sustainability/plate-and-planet/) \n\nThis will give you around 12-18 meals with meat.\n\n**SKIN:**\n\nBake or fry skin and serve on top of stir-fry veggies and rice/soba noodles \n\n3 more meals\n\n [https://www.bonappetit.com/recipe/crispy-salt-and-pepper-chicken-skin](https://www.bonappetit.com/recipe/crispy-salt-and-pepper-chicken-skin) \n\n**BONES:**\n\nMake so much freaking broth. Just LOADS of the stuff. Put about half the  (1) chicken bones into a crockpot or just a plain large pot. Add 6 cups of water and veggies that are leftover from other meals. Carrot ends, celery ends, onion ends, etc. Add salt and pepper. cook for like 8 hours.\n\nThis can become a condensed cream of chicken as well if needed.\n\n [https://www.apinchofhealthy.com/homemade-condensed-cream-of-chicken-soup/](https://www.apinchofhealthy.com/homemade-condensed-cream-of-chicken-soup/) \n\n24 cups of broth for flavor or soups\n\n**NOW WHAT:**\n\nWell, lots of home cooking. Get yourself flour/eggs/butter/dehydrated milk.\n\nMake your own pasta, breads, etc\n\nEgg noodles:  [https://www.allrecipes.com/recipe/11991/egg-noodles/](https://www.allrecipes.com/recipe/11991/egg-noodles/) \n\n&#x200B;\n\nTake that broth, make a delicious chicken noodles soup. \n\nCarrots: $1lb, use 2: .33\n\nOnion: .38\n\nCelery: $1 pack, use 2: .20\n\nHalf lb chicken: free\n\nHomemade Noodles: .50 for more than you ever need\n\nTotal:  $1.40 for 6 servings, less than .25 a serving\n\nFor additional food, serve with a homemade loaf of sourdough.\n\n&#x200B;\n\n*You could make that broth go further with vegetarian dishes and soups*\n\nMake pasta and serve this:  [https://damndelicious.net/2014/10/11/one-pot-garlic-parmesan-pasta/](https://damndelicious.net/2014/10/11/one-pot-garlic-parmesan-pasta/) \n\nInstead of adding the meat, add some fresh peas or broccoli for your proteins. If you use the broth on dishes other than the chicken meals, you might be able to extend 3 chickens into 27-31 meals. \n\nHere's some suggestions for high protein vegetables:  [https://www.myfooddata.com/articles/vegetables-high-in-protein.php](https://www.myfooddata.com/articles/vegetables-high-in-protein.php) \n\nThat chicken broth and meat will make sure you are getting vitamin B3, and we don't need additional meat for healthy protein levels.\n\nWhere to find recipes:\n\n [https://www.budgetbytes.com/category/extra-bytes/snap-challenge/](https://www.budgetbytes.com/category/extra-bytes/snap-challenge/) \n\n [https://www.reddit.com/r/EatCheapAndHealthy/](https://www.reddit.com/r/EatCheapAndHealthy/) \n\n [https://www.reddit.com/r/budgetfood/](https://www.reddit.com/r/budgetfood/) \n\n [http://ebtshopper.com/recipes/](http://ebtshopper.com/recipes/) \n\n [https://cookbooks.leannebrown.com/good-and-cheap.pdf](https://cookbooks.leannebrown.com/good-and-cheap.pdf) \n\nGood luck. It sucks. I was homeless back in the 2008 crash and did this for a long, long time. Food Stamps and WIC help a ton.","isChecked":false,"level":5,"score":"33"},{"author":"jaymcbang","body":"I'm doubling down on this advice. These are the times these programs were made for, and the government is the \"cause\" of this situation (as in, their recommendations have closed everything) and they (seem to be) ready and understanding of the circumstances. Unless it's mortgage/rent and utilities, most all bills can wait or be called in and have something set up for your new income, especially since everyone knows this is a temporary thing until they get a vaccine they can profit from or realize it's no more dangerous than, well, anything else.\n\nAnyway, jump on it now. By the time it goes through and gets approved, you'll be needing it pretty bad unless you have savings. Don't wait.","isChecked":false,"level":3,"score":"271"},{"author":"nowake","body":"> Unless it's mortgage/rent and utilities, most all bills can wait\n\nPlaying with fire here, but in light of this national & global catastrophe, I'd rather pay for my consumables first and liabilities last. If the place goes to hell & I stopped paying my car note, is the lending agency really that interested in repossessing it? Especially if so many others are in the same boat. Same with my house payment. Same with my credit cards.\n\nI'd much rather my credit score drop 400 points and be alive at the end of this, than having no money bc I sent a large chunk of my cash to the banks.","isChecked":false,"level":4,"score":"23"},{"author":"kayisforcookie","body":"Good luck with WIC. wic approved foods are usually the cheapest brands that sold out first in my area and stores arent substituting. I havent been able to get eggs, milk or bread yet this month.","isChecked":false,"level":3,"score":"76"},{"author":"greensypoop","body":">Our family currently has no work or income. We have a young child. These are very uncertain times.\n\nFuck, that is horrible","isChecked":false,"level":2,"score":"1004"},{"author":"p1028","body":"This will be a reality for millions. I too haven’t worked since Monday with no time line for when or if I’ll start back up again.","isChecked":false,"level":3,"score":"261"},{"author":"murder_sickle","body":"My best friend is about to close his restaurant. He's had his takeout window open but obviously traffic has basically died. He's worked his whole life for it and until now has been really successful. His house is on the line, and his wife was just laid off indefinitely. With things the way they are right now he can't even sell the place to try and save his house. Luckily his in laws own a house the family can stay in but their income just dropped drastically with 2 kids under 4. Its terrifying for them and I feel for them and you.","isChecked":false,"level":2,"score":"24"},{"author":"fukyokarma","body":"Just lost it about an hour ago. I’m a restaurant manager and they called me and told me to turn in my keys by the end of the day. I’m in quarantine and can’t. They are sending me a UPS box so I can send in my keys and told me to file for unemployment. Never expected this to happen to me. I’m in shock idk what I’m going to do.\n\nHey thanks for the well wishes and advice I live in NJ and I already filed last night. Everyone else in my shoes read these comments. On top of being really sick it was a kick to the stomach but we will get through it.","isChecked":true,"level":1,"score":"22434"},{"author":"BL28210","body":"I wonder if it's temporary so you can get unemployment and then they'll hire you back later on?","isChecked":false,"level":2,"score":"4891"},{"author":"wofo","body":"I know of a place that can't afford to stay open but is letting people pick if they want to be laid off or fired, hoping people can game the unemployment better that way.","isChecked":false,"level":3,"score":"3395"},{"author":"jwb101","body":"I know Georgia has lifted a lot of the requirements and the businesses that are essentially firing the employees, even temporarily, file on behalf of the employees and they’ll receive unemployment. No gaming the system or anything, if you lost your source of income due to the virus you’re guaranteed temporary unemployment.","isChecked":false,"level":4,"score":"1487"},{"author":"mamabearsarah","body":"Can confirm. I own a restaurant in Georgia and am about to lay off all my employees temporarily (they already know). We’re closing for a couple weeks. Partial unemployment covers them for a closure of 6 weeks, and benefits get paid out faster without any need to prove anything on their part.","isChecked":false,"level":5,"score":"25"},{"author":"EquilibriumMachine","body":"Why would anyone pick getting fired?","isChecked":false,"level":4,"score":"599"},{"author":"wofo","body":"Unemployment may be different? I'm not sure it is but I think the point is the owner isn't, either. He's just telling people to start the process and he'll sign whatever helps.","isChecked":false,"level":5,"score":"895"},{"author":"crazychristian","body":"Small business owner here (cocktail lounge). This is what I told my team, I've never gone through this and I don't know how it works. All I know is I can't pay them, and may be bankrupt in a few months (as this is not going to just blow over).\n\nSo whatever actions they choose, if they want me to formally fire/layoff/hug them they get to choose. That choice is about the only thing I can give them (besides some of the leftover snacks and booze).\n\nEdit: The hugging bit is a joke, I didn't even get to shake their hands as they've trickled through the door to chat and pick stuff up. Really hate this virus.","isChecked":false,"level":6,"score":"1474"},{"author":"alquicksilver","body":"If you're in the US/territories, you might want to look into the Small Business Administration disaster loans.\nhttps://www.sba.gov/disaster-assistance/coronavirus-covid-19","isChecked":false,"level":7,"score":"595"},{"author":"crazychristian","body":"Thanks for the literature, though looks like MN isn't covered (yet). I'll bookmark that and keep checking. But the SBA has stepped in already for us, allowing us to defer payment on our loans for 2? months. That allows us to hold onto cash to at least pay rent.\n\nLandlord isn't going to be any help though lol.","isChecked":false,"level":8,"score":"277"},{"author":"fatmanwithalittleboy","body":"Your landlord might not, but you should reach out to them. If it's a corporation then they may be helping tenants defer payment, or reduce payments. Not out of the kindness of their hearts, but because that property will sit empty if you shutdown. \n\nIf it's a small business, then they might be understanding to your predicament. I also assume that they could get a deferment on there mortgage. \n\nWorst that happens is they say no...","isChecked":false,"level":9,"score":"53"},{"author":"crazychristian","body":"Oh I definitely did as soon as we closed our doors, but he is the type to spend a dollar to save a dime. He has an incredible (in scope) reputation around town, it's interesting how we didn't hear anything about it until after we signed the lease.","isChecked":false,"level":10,"score":"26"},{"author":"realmcphearson","body":"In California at least, it's a lot easier to get unemployment if you're fired. If you voluntarily quit you have to show just cause or you don't get anything. I can see why someone would prefer to avoid that headache and just get fired if it's an option the boss is willing to do.\n\nEdit: Read that wrong, it was laid off vs fired, not quit vs fired. My bad.","isChecked":false,"level":5,"score":"224"},{"author":"SpringCleanMyLife","body":"But the options op gave aren't being fired or quitting. It's being fired or being laid off.","isChecked":false,"level":6,"score":"19"},{"author":"hooligan_king","body":"Fired can mean severance package too.","isChecked":false,"level":5,"score":"134"},{"author":"JAproofrok","body":"One of the biggest clients we have (my fiancée and I do web design + marketing) is a restaurant. They “laid off” a huge segment of their workers **so they could** immediately collect unemployment. \n\nOffered free packs of food for their families too. \n\nNow, if they could just figure out how to give us their GrubHub login, that would be nice .......\n\nEdit: Meant to say, so sorry to hear about this. It just sucks all around.","isChecked":false,"level":2,"score":"843"},{"author":"DCMurphy","body":"I work for a restaurant group. We did the same thing: CEO sent out a message to everyone that all locations were closing and layoffs were immediate so we could collect.","isChecked":false,"level":3,"score":"44"},{"author":"nonstopsobbing","body":"My job as a barista was shut down for safety and because nobody is coming in, anyway. And my summer job (teaching kids how to swim at a sleepaway camp) is cancelled because the camp decided not to open. While I'm not in danger of losing my house or starving, I am now unable to afford to continue going to college next semester.\n\nEdit:  Somebody gave me gold. I don't actually know what that means since I'm new to Reddit, but I hope whoever gave it (and the rest of y'all) are safe and healthy.","isChecked":false,"level":1,"score":"7147"},{"author":"ablinux","body":"That's tough, be strong and keep studying until everything normalizes.","isChecked":false,"level":2,"score":"988"},{"author":"nonstopsobbing","body":"Thank you. I'm just glad I'm safe and healthy. A semester off won't kill me, after all.","isChecked":false,"level":3,"score":"593"},{"author":"Tatertotter09803","body":"Who knows? Maybe if you do have to take a semester off you’ll end up making new connections or landing an internship you didn’t expect and your career can take off in a great direction! You never know.","isChecked":false,"level":4,"score":"42"},{"author":"teenage_wet_dream","body":"Not sure where you are located, but Save A Lot grocery stores is hiring all jobs. Might be good for a temporary job to get you through the spring/summer.","isChecked":false,"level":2,"score":"27"},{"author":"PurpleToasting","body":"I got laid off today.\n\n\nI worked in art studio. There were only a few of us and my boss owns the business. As it's a small business she just couldn't afford to keep me employed anymore. Business just stopped. Normally we would have 10+ orders a day, today we had 1.\n\n\nIt sucks but I understand completely and she is the nicest boss. I live in the UK, and although the government are promising loans for small businesses it's not helping/realistic. By that I mean the help is going to come too late. I really hope her business manages to get through the next few months.\n\n\nIt's going to be a difficult few months for a lot of us. I'm luck I've got some savings and still live at home so it could be so much worse.","isChecked":false,"level":1,"score":"895"},{"author":"lilyofthealley","body":"Yeah. I'm a professional artisan jeweler/silversmith, and art is one of the first things people stop buying. This is usually my 2nd busiest season, but all my shows have been canceled.","isChecked":false,"level":2,"score":"30"},{"author":"edmidgley","body":"They wanted a coworker and I to reduce our hours to half each, because they could only afford one of us and didn't wanna make a redundancy. In the end, I took the redundancy. I'm 21 and live at home, meals provided. My coworker is a 30 y/o homeowner with bills and an unemployed girlfriend. Him loosing half his income for me seemed wrong. Better me than him.","isChecked":false,"level":1,"score":"26256"},{"author":"applestem","body":"That’s the kind of kindness that will get us through this. Wishing you all the best when this thing is over.","isChecked":false,"level":2,"score":"7921"},{"author":"edmidgley","body":"Thank you. You too.","isChecked":false,"level":3,"score":"2904"},{"author":"AnonymousCrime2","body":"Logged in to say I’m proud of you. You did the right thing, and someday that’ll come back to benefit you in some form. I wish you the best through this time.","isChecked":false,"level":4,"score":"37"},{"author":"madguins","body":"I was in the middle of moving out of my abusive fathers house when this happened and they canceled my interview for my transfer. I tried sticking it out because the only place I could go indefinitely is my boyfriends a flight away (still domestic, just another state). I have been shamed to no end about how selfish and gross I am for even stepping outside my house for groceries, so I literally told no one I’m leaving. \n\nDo I want to travel? No absolutely not. But staying with an abuser for 2 more months will take such a toll on my mental and physical health that it’s necessary for me. The fact that people want to shame me without knowing my situation has been awful and I wish people practiced more of this kindness.\n\nUpdate: did it. I’m here. I’m having wine and pizza and watching a movie with a lovely man who is nice to me. I’m happy.","isChecked":false,"level":3,"score":"1441"},{"author":"timetogetil","body":"It may be longer than that. Leave ASAP and take all the hygienic precautions you can during your trip to protect yourself and others you may come into contact with. Wash your hands for at least 30 seconds whenever you can. You may have trouble getting a taxi to and from the airport, so try to arrange dependable transportation beforehand. Don’t stay with this abuser any longer than you have to, and take care while traveling.  Wishing you safety and health!","isChecked":false,"level":4,"score":"65"},{"author":"rickthecabbie","body":"From yet another stranger on the internet, If I get covid-19 and die because you left, I regret nothing!\n\nbut you have to swear that you will avenge me. Be safe, and be well.","isChecked":false,"level":4,"score":"181"},{"author":"madguins","body":"Haha thank you for your kind words. I would definitely avenge you.","isChecked":false,"level":5,"score":"71"},{"author":"Venod","body":"From some stranger on the internet, best of luck","isChecked":false,"level":4,"score":"41"},{"author":"SlapTheBap","body":"There's these randos that really want to shame people without knowing their situation. I had that happen on reddit recently. Someone told me that my inability to pay rent without my check this month is 70% my fault. I refused to tell them that it was due to paying for breast cancer treatment. I hardly have told anyone, since it's a very curable form and I want to avoid drama. Being pressured to share that information by a rando, telling me his bootstrap story, is infuriating. Fuckers always want to tell you their bootstrap story or shame you for not being as privileged as they are. Fuck em. You got your list of goals and to-dos. They will remain ignorant or hopefully they'll grow a sense of empathy and compassion.","isChecked":false,"level":4,"score":"42"},{"author":"hankthetank2112","body":"You’re not selfish and gross. Sounds like you need to hop on a plane and head to your boyfriend’s place. Just get away from the abuse. Good luck.","isChecked":false,"level":4,"score":"91"},{"author":"sdlucly","body":"From another stranger on the other side of the world, best of luck and try to stay safe.","isChecked":false,"level":4,"score":"26"},{"author":"RidersPainfulTruth","body":"Just want to say you’re a hero and I wish there were more people on this earth like you.","isChecked":false,"level":2,"score":"992"},{"author":"nbowler13","body":"I agree with applestem - you’re a living example of human kindness during a shitty time.","isChecked":false,"level":2,"score":"390"},{"author":"thirdsin","body":"I hope he invites you out for a few beers. Bro move.  \nWait, bars are closed.... I hope he drops a 30 rack off at your place, rings the bell, uses hand sanitizer and runs away, bc social distancing... lol.","isChecked":false,"level":2,"score":"77"},{"author":"xenocidic","body":"You’re a top dude, I hope karma rewards you.\n\nEdit: I meant actual karma, but I guess Reddit karma does in a pinch.","isChecked":false,"level":2,"score":"89"},{"author":"CockDaddyKaren","body":"I'm sure it means the world to him :)","isChecked":false,"level":2,"score":"32"},{"author":"Sopski","body":"Wow. I'm sorry I can't give a real gold but please accept this token🥇\n\nWhat you did was truly selfless and restores my faith in humanity.","isChecked":false,"level":2,"score":"33"},{"author":"clothedinblack","body":"Wow, you’re a good person. Thank you for doing that. I wish you and your family the best.","isChecked":false,"level":2,"score":"241"},{"author":"Skykiller1993","body":"Yeah I’m probably going to be in a similar situation here soon! I don’t live at home but I have a decent amount in saving and can survive for a couple of months but my coworker has a family (wife and 6 kids) and a house they just bought this last year. I really don’t want to be laid off but I can survive with out a paycheck for a little while and I KNOW he definitely can’t. He’s all ready agreed to spilt hours with me (we haven’t been told anyone is being laid off but it’s eventually going to happen) and I really appreciate his offer, but when it comes down to it I’ll let him stay on full time and I’ll take the hit. It’s really going to suck but he definitely need the paycheck being the sole income for his family.","isChecked":false,"level":2,"score":"25"},{"author":"TheChapster","body":"You da real MVP","isChecked":false,"level":2,"score":"24"},{"author":"PM_ME_ISSUES_4_HELP","body":"You're a good fuckin egg.","isChecked":false,"level":2,"score":"22"},{"author":"dorit0paws","body":"I’m sitting in a meeting right now, waiting to get fired. The VP is running late. So that’s cool.\n\nEdit: they gave us basic info but are talking to everyone individually. So who knows still...\n\nEdit 2:  laid off :(","isChecked":true,"level":1,"score":"28294"},{"author":"LikelyNotOP","body":"They can't fire you if you fire them first and take their job","isChecked":false,"level":2,"score":"8698"},{"author":"FelineAstronomer","body":"You won't believe this one secret tip to advancing your career that CEOs don't want you to hear!","isChecked":false,"level":3,"score":"3586"},{"author":"mwbrow08","body":"Jeff Bezos HATES this man for his one simple trick to get rich quick","isChecked":false,"level":4,"score":"77"},{"author":"nirurin","body":"35 minutes ago... so it probably started by now? Or finished? I'm wishing you luck, but also really hoping to get closure on the outcome...","isChecked":false,"level":2,"score":"626"},{"author":"viodox0259","body":"Whoa, holy fuck. Good luck broski.","isChecked":false,"level":2,"score":"753"},{"author":"Bex_IsASlut","body":"RIP.","isChecked":false,"level":3,"score":"23"},{"author":"doitlikeasith","body":"oof that last edit, hang in there buddy","isChecked":false,"level":2,"score":"91"},{"author":"Asak0pt3r","body":"I'm a server. I haven't worked since the 14th, but was officially laid off on the 18th. Where I am, temporary layoff is only 60 days. If we are not back by then, we lose our jobs permanently.\n\nIt couldn't have come at a worse time since we have new management and there's been some murmurs about getting new staff.\n\nI was about to lose my apartment (unrelated) but my landlord phoned me up to let me know that he is no longer making me leave and not to worry about April rent. He also gave me $150 to go buy groceries. He's a bro. \n\nI'm trying to get through to EI, which is all online right now, but the site keeps crashing so I'm unable to make a claim right now.","isChecked":true,"level":1,"score":"32054"},{"author":"Michaelismyname","body":"Jesus, your landlord is a hero.","isChecked":false,"level":2,"score":"15007"},{"author":"PhantomFuck","body":"My landlord would have helped me pack my bags","isChecked":false,"level":3,"score":"9105"},{"author":"your99thproblem","body":"And then billed you for the time.\n\nEdit: thanks for the silver kind stranger. I won’t bill you for my time.","isChecked":false,"level":4,"score":"6174"},{"author":"JackieTreehorn79","body":"And charged you for the paper the bill was printed on.","isChecked":false,"level":5,"score":"1877"},{"author":"Doge_lord101","body":"And charged you to leave the house","isChecked":false,"level":6,"score":"945"},{"author":"sniper43","body":"And keep the toilet paper.","isChecked":false,"level":7,"score":"1000"},{"author":"pigwalk5150","body":"And take the ice cube trays.","isChecked":false,"level":8,"score":"322"},{"author":"SuperMayonnaise","body":"And steals 1 sock of a pair of 3 of your fancy pairs of unique dress socks.","isChecked":false,"level":9,"score":"51"},{"author":"StoneGoldX","body":"This sock has a hole in it. No security deposit.","isChecked":false,"level":10,"score":"30"},{"author":"undercoverantichrist","body":"Mine would have stood there making frustrated and progressively louder noise to remind me of the huge inconvenience that I cause by paying them hundreds of dollars a week to live in their shitty old house","isChecked":false,"level":4,"score":"448"},{"author":"ApollosVale","body":"I told my landlord my wife and I have been quarantined, and asked if there's a way I can pay her later. She kept avoiding giving me an answer. I asked again, and she reminded me that it's $25 less if we pay 5 days early, and also added in how much of a \"blessing\" it was. Actually said that. I knew she'd probably be that way, but calling that a blessing really made her a heartless witch in my head. Can't wait till my lease is over.","isChecked":false,"level":3,"score":"1562"},{"author":"ashlynnk","body":"This is the absolute worst. I proactively reached out to my tenant and told her to let me know if she’s at all financially impacted by this. She has three children and the last thing she needs to worry about is keeping a roof over their head. I wish more people can be like OP’s landlord. Just asinine.","isChecked":false,"level":4,"score":"833"},{"author":"amscraylane","body":"It is nice to know there are people like you who place humans over profit ...\n\nunderstandably not all landlords are in this position to be as nice... \n\nbut for you to reach out to her first shows real character on your end.","isChecked":false,"level":5,"score":"124"},{"author":"MrsMeteor","body":"You're awesome. \n\nMy landlady was able to get her mortgage deferred, and can work from home. She knows I've lost my job over this, and didn't offer shit. I did write her to let her know I could pay April, but may might questionable. But like, damn, I'm a good tenant, give me some slack here.","isChecked":false,"level":5,"score":"26"},{"author":"speecyspicymeatball","body":"I am a landlord.  I'm just saying that up front.  \n\n\nTake care of you and your wife first.   Buy your food and your meds, feed your pets.  I don't know where you live but many states have place a moratorium on evictions and foreclosures.  I live in CA and right now you cannot even file to evict until May 31 at the earliest.     \n\n\nEveryone is scared right now.  We are all watching the material part of our lives slip through our fingers.    Everyone is frightened including landlords.\n\nYour landlord is worried about her own problems right now.  She has bills to pay and markers to cover.   She believes that if she puts pressure on you, or implies that there is not going to be any grace shown, that you will somehow cough up the rent on April 1.     \n\n\nI have reached out to my own tenant.  He knows he will always have a place here, he's a great tenant and I would not evict him or ask him to leave.  He has a job for now, but who knows how long that will last.   I am self employed (not as an investor/landlord, my rental is a tiny ADU on my property) and right now business is dead in the water.  Unemployment doesn't pay much but it's better than a sharp stick in the eye, which is what all the self employed people are getting right now.    \n\n\nThis is going to work itself out.   Landlords are going to have to come to grips with the reality that we are all losing our fiscal ass right now and they are not exempt.    \n\n\nSo take care of yourself FIRST.   Feed yourself.   Take care of your needs.  If you can pay something in rent, pay it--your landlady needs money too.  But if you cannot just know that this will keep.  The world isn't going anywhere anytime soon.  This will work itself out in time.    \n\n\nBe well.","isChecked":false,"level":4,"score":"2276"},{"author":"amscraylane","body":"It is real honorable for you to reach out to your tenant first instead of making them come to you...","isChecked":false,"level":5,"score":"103"},{"author":"speecyspicymeatball","body":"I feel like the one with the asset is the leader.  I'm supposed to be a leader.  A leader is the one who reaches out to the person in the more vulnerable spot, not the other way around.","isChecked":false,"level":6,"score":"136"},{"author":"umudbro","body":"I'm in CA and we have a group called COAR Property Management that runs around, buys up places, jacks the rent up ridiculously and then shits all over everyone.  When rent control passed, they kept the rent jacked up and refused to lower it for months.  They harassed us with eviction notices even though they had no proper documents to do so.  It was bad.  They kicked out people that lived here for 40 years so that they could remodel the apartment and increase the rent on it a few hundred bucks per month.","isChecked":false,"level":7,"score":"37"},{"author":"deewheredohisfeetgo","body":"God can you call my SO and tell her all this shit? She’s freaking out so bad and I can’t get through to her that our landlord can’t evict us if shit gets rough for a month or two. He won’t, regardless, because he’s a nice guy and he’s shown to be reasonable in the past. But she won’t stop worrying about rent. \n\nI’m a self-employed web developer (pm me if you need anything), so new deals stopped coming in awhile back. And she’s an hourly restaurant worker who relies on tips. So we have no real plan B.","isChecked":false,"level":5,"score":"20"},{"author":"felesroo","body":"> I'm trying to get through to EI, which is all online right now, but the site keeps crashing so I'm unable to make a claim right now.\n\nTry getting up in the middle of the night where you are (like 3 AM) and try then. The web traffic will be lower.","isChecked":false,"level":2,"score":"1088"},{"author":"Silly-Wi11y","body":"Depends on the EI site and what state. In PA for bi weekly claims it’s some odd window like 6am-930 pm. \n\n\nI’ve been laid off all winter because I’m a seasonal construction worker and I just got emailed that we are not to return next Monday (1st day back). I myself am worried because my 6 months is up in April..","isChecked":false,"level":3,"score":"327"},{"author":"FlamingWeasel","body":"I find it so goddamn stupid when web services that are automated have business hours. Like, what the fuck.","isChecked":false,"level":4,"score":"54"},{"author":"PVCAGamer","body":"Try it at 1-2 AM should help you out with the crashing.","isChecked":false,"level":2,"score":"108"},{"author":"ram0h","body":"man that is exceptional from your landlord. good luck","isChecked":false,"level":2,"score":"460"},{"author":"AvonBarksdale666","body":"That landlord is a keeper. Put a ring on him","isChecked":false,"level":2,"score":"269"},{"author":"PauseAndReflect","body":"I am fucked. I’m American, but live in Italy. Northern Italy, specifically. \n\nWorked for the last 5 years for a tech startup that is heavily dependent on renting apartments and people traveling abroad in Europe for revenue, though my job in the company was totally back-end. I was part of the first wave of employees, and really liked my job. We were funded mostly by Silicon Valley investors. \n\nThe company had already decided our jobs were to be automated slowly and painfully, and I was already starting to look for a new job, but the process just got sped up due to the crisis and we all got the red slip on Monday. \n\nMy husband is a taxi driver, and he hasn’t worked in almost 3 weeks. We don’t know when he’ll be able to work again. I don’t know when I’ll even be able to get another job interview. We have a 3-month emergency fund that I’ve built up thankfully and no cc debt, but I’m terrified for the future. We’re both in our 30s, and got fucked in 2008 when we graduated into that recession. Now? I’m worried I’ll never own a home and never have kids. I don’t know how any of that will be possible.\n\nI feel hopeless. I’m going to fight my way out of this whichever way I can, but I’m honestly feeling defeated. And I’m scared we’re going to get sick eventually. Or one of our family members here in Italy will get sick. Or one of my family members in the US will get sick, and I’ll be unable to fly back to be there. \n\nWe had an increase of around 4450 cases and 427 more deaths in Italy today. I feel like a real asshole for even worrying about my finances in the face of this tragedy here, but I’m terrified for what’s next selfishly. \n\nAnd I have no idea how I’m going to pay for my student loan going forward. It’s literally strangling me. \n\nJust fuck, guys. If you got laid off this week, I’m with you. I literally just feel like giving up. \n\nThanks for reading this if you did...I needed to vent. Stay good guys. And stay healthy, from us in Italy to wherever you are in the world. \n\nEdit: There are so many comments in this thread that I’m getting even more nervous now. I’m devastated to see how many other people are where I’m at. \n\nE2: it may be hard times, but at least they’re gilded hard times— thanks for my first gold! And thanks to everyone who reached out with some kind words. You guys are the best.","isChecked":false,"level":1,"score":"824"},{"author":"commandeermormont","body":"You’ll be ok as long as you don’t give up. You’ve got this. I read this and I hear you, stay strong.","isChecked":false,"level":2,"score":"40"},{"author":"mavsfan0041","body":"Stay safe, I'm rooting for you.","isChecked":false,"level":2,"score":"26"},{"author":"Ropya","body":"Day by day. That's all you can do now. \n \nWhen the dust settles and the horizon is visible again, then, and only then, can a path ahead be ascertained.\n \nBe safe. Be well. Don't give up.","isChecked":false,"level":2,"score":"24"},{"author":"shittylittledog","body":"Of all the comments on this thread this one hit home the most. I feel like I've buried my head in the sand and this will all be over next week. Time to face up to it....","isChecked":false,"level":2,"score":"23"},{"author":"cweezie","body":"i was a server looking for a new job before this all began. i got a job secured at the zoo (an amazing dream job for me and my personality) but the day before i started at the zoo, they shut it down for the coronavirus fears. then they shut down my serving job too.","isChecked":false,"level":1,"score":"1605"},{"author":"Iwasbravetoday","body":"I'm in a similar position. I'm in a dead end job out of uni, my dream job has come up working in a museum/gallery and I'm about to send the application off, but they've just closed all entertainment venues and I'm sure the last thing they'll consider is new staff :(","isChecked":false,"level":2,"score":"230"},{"author":"cweezie","body":"luckily they stressed that they still want me as an employee once all of this blows over. i just have to make it until then","isChecked":false,"level":3,"score":"31"},{"author":"iphon4s","body":"I worked at Hyatt. I was hired as an intern fresh out of college for a year. Most of Hyatt's Interns were actually internationals from Europe. Hyatt paid us minimum wage which is crazy once you learn how expensive NYC is. 2 months ago they recently hired a guy from the Netherlands and just 2 weeks ago another girl also from the Netherlands have just moved to NYC for this internship and had moved to her apartment just last week.\n\n2 days ago HR called us for a meeting and said effective Monday we were no longer employed by Hyatt. They refused to pay us any of our sick or personal days which I had 7 days worth. For the interns that have recently moved to NYC HR basically said you're on your own not our problem nothing we can do to help. SOL.\n\nBeing laid off is one thing but having the HR director tell us that they were not intending in paying any of our sick days, or personal days was a slap in the face & a massive dick move. I had intended to work till Saturday which was my last scheduled day. Since they were not paying my sick days I just called off my last 3 days so I can at least get 3 sick days paid.\n\nHyatt's saying is \"we care for people so they can be their best\" They really showed their true colors and I would never work for Hyatt or stay in any of their property for as long as I live.\n\nEdit: didn't expect this to blow up. \n\nJust a few things to mention. I'm not trying to cause a riot of any sort.\n\nI'm getting paid my accrued vacation only. As some have mentioned, NY doesnt require for sick days to be paid so I've come to terms with that.\n\nAlso this was just my experience. I'm not encouraging/ discouraging the use of Hyatt don't let this post be the make it or break it on whether or not you stay at Hyatt. \n\nThis was just me venting. For the people that have pm me asking if I'm okay thanks! But I will be alright. Good night everyone!","isChecked":false,"level":1,"score":"8418"},{"author":"pnwtico","body":"Hyatt employees in Vancouver went on strike last year. They sound like a really shitty company to work for.","isChecked":false,"level":2,"score":"1464"},{"author":"starcrossedcherik","body":"Jesus. I work for a franchised hotel, and up until this week I thought our management was a kind of shitty and really greedy company. We've had to cut everyone's hours but all the managers went and immediately told everyone to cash out their sick time while we still could. They gave the option to furlough or lay off all the kitchen/housekeeping staff that got screwed so they could keep their insurance if they want. \n\nWe're a medium sized hotel and don't have any international interns, but I can't imagine what they're going through having just moved to ny for a job only to be so completely screwed over like that.","isChecked":false,"level":3,"score":"61"},{"author":"TheSpatulaOfLove","body":"Tell this story on /r/travel.    Redditors must stick together.   From your story alone, I will avoid Hyatts in my travels.","isChecked":false,"level":2,"score":"3839"},{"author":"I_call_it_dookie","body":"Drop \"redditors\" and replace it with \"any decent human being with an ounce of empathy\"","isChecked":false,"level":3,"score":"1017"},{"author":"Traveling_Solo","body":"Agreed x.x they should post it in r/solotravel as well.\nEdit: added the subreddit.","isChecked":false,"level":3,"score":"27"},{"author":"YupYupDog","body":"I solemnly swear I will never stay at a Hyatt. What pissweasels.","isChecked":false,"level":3,"score":"26"},{"author":"sunflore_7777","body":"F*ck Will never stay in a Hyatt again","isChecked":false,"level":2,"score":"1768"},{"author":"Malavok","body":"I had absolutely terrible experiences staying in several Hyatt hotels for work travel last year, the worst being the one at the Atlanta airport where every time someone flushed a toilet nearby, my entire room shook. This just makes me hate them even more.","isChecked":false,"level":3,"score":"41"},{"author":"Flowergirl116","body":"How can we get on Hyatt’s ass about this??","isChecked":false,"level":2,"score":"750"},{"author":"None","body":"[removed]","isChecked":false,"level":3,"score":"510"},{"author":"SchuminWeb","body":"Publicly shaming companies usually does get results. No one wants to have a bad PR situation on their hands.","isChecked":false,"level":4,"score":"489"},{"author":"dirtydela","body":"I don’t know that they can not pay you for accrued time off as it is a benefit you have earned. There could be something about it in the employee handbook or if you talk to HR or something.","isChecked":false,"level":2,"score":"29"},{"author":"AussieAndDepressy","body":"It's not that I lost a job, it's the fact that it's now near impossible for me to find one","isChecked":true,"level":1,"score":"647"},{"author":"iandmlne","body":"Damn, like two weeks ago fucking everywhere was hiring near me, how quickly things change.","isChecked":false,"level":2,"score":"103"},{"author":"Pony_Ninja","body":"This thread is painting a bleak af picture.","isChecked":false,"level":1,"score":"1581"},{"author":"holdmypistachios","body":"I work as an auditor and was pretty fed up with my job and looking for a new career field. Im luckily able to telecommute and I’m in no risk of losing my job. Covid-19 has really made me reevaluate my life and be thankful for what I have.","isChecked":false,"level":2,"score":"430"},{"author":"drit76","body":"I had a similar epiphany recently.  Also, reading this post made me appreciate what I have even more.","isChecked":false,"level":3,"score":"52"},{"author":"jaydawg09","body":"I’m in tax. And I feel you on that.","isChecked":false,"level":3,"score":"25"},{"author":"msgaia","body":"Agreed. Husband and I both work in the finance industry, in the \"essential business\" part. We feel very fortunate to have work right now.","isChecked":false,"level":3,"score":"20"},{"author":"TheRealTrumanShow","body":"Didnt lose my job, but I was in the middle of searching for a new one, obviously now it's getting next to Impossible to find a job, and I'm not illegible for E.I.","isChecked":false,"level":1,"score":"2110"},{"author":"Quick-Time","body":"You and me both.\n\nI've been job hunting too, and now it's going to be impossible to find one.","isChecked":false,"level":2,"score":"301"},{"author":"CarlosDanger0123","body":"I've been in between jobs for 6 weeks.  I thought the job market was hard 6 weeks ago, now it's going to be fucking impossible.  God damnt.","isChecked":false,"level":3,"score":"167"},{"author":"Splyntered_Sunlyte","body":"I spent last year caring for my sick father who was dying of cancer. He needed me and I couldn't work during that period. He passed at the end of the year and I've spent the past 3-4 months dealing with estate stuff and now have a little apartment, the savings is nearly gone.. I'm ready to get back to work and had started the job hunt. One interview, then all this started. NO one is hiring now. I've not gotten any more calls, and I don't expect any anytime soon. This is incredibly scary, I don't know what I'm going to do. And I really, really miss my dad.","isChecked":false,"level":4,"score":"36"},{"author":"termiAurthur","body":"\"Sir, this guy's writing is perfectly legible for EI.\"\n\n\"He probably meant ineligible, private.\"","isChecked":false,"level":2,"score":"629"},{"author":"nevadadealers","body":"Wife and I both work at major casinos on the Las Vegas strip. Both of us are out of work. All casinos in Las Vegas are closed. Only security and a few other key positions are still employed. Casinos are the largest employers in the state of Nevada. I’m sure this is going to devastate the local economy.","isChecked":false,"level":1,"score":"1048"},{"author":"MisallocatedRacism","body":"It's going to devastate the *world* economy.","isChecked":false,"level":2,"score":"161"},{"author":"TJefFreeze","body":"My entire family is currently on the outs because of the casino shut downs. Luckily my grandma owns her house outright so she will be ok. My dad and uncle tho are going to be in trouble. I work for a vacation rentals company in summit county Colorado and while we are in full bleeding mode we were up alot on the year so we can weather this storm for now. We had to let off about half our staff but I was lucky enough to dodge to bullet","isChecked":false,"level":2,"score":"28"},{"author":"pug_fugly_moe","body":"Hate this for you. My brother is (was) an MGM slot tech in Vegas. First time in his life he's been laid off. Sucks for him, and I would try to help, but I'm underemployed myself (30 hours a week in retail as a Certified Financial Planner).","isChecked":false,"level":2,"score":"22"},{"author":"tricky__girl","body":"Washington state doesn't require PTO time to be paid out so it's cheaper to fire employees and zero out their PTO time and then rehire them later than it is to keep us.  I haven't been let go yet, but all nine of the people that work for me, including one guy that had twelve weeks of PTO accrued and got nothing, have been let go.  Our office in CA has been letting people take PTO for years since it's a liability on the books since CA required unused PTO to be paid out.  It doesn't seem like a big difference in the law, but it is in practice.","isChecked":false,"level":1,"score":"329"},{"author":"AnyHuckleberry8","body":"That is such a weird thing to me after working almost forty years in tech in the Seattle area.  Programmers work long hours and demand high pay, but we don't demand vacation time.  My company is in the middle of a death march and isn't allowing any time off.  Most of the complaints are about not enough snacks and dinner being delivered too late.  I don't think anyone has complained about not allowing any time off so far this entire current  year.","isChecked":false,"level":2,"score":"47"},{"author":"gloomycpa","body":"You're right that it is a liability on the books.  I've worked with dozens of startups that were trying to either get bought out or go public.  Getting PTO off of the books in states like California either require you to get people to take time off or pay it off when you let them go.  Here in WA, you can let people go and not pay them anything.","isChecked":false,"level":2,"score":"25"},{"author":"trickygirl1980","body":"My company has an office in Seattle and in San Mateo, CA.  We're of course firing people mainly in Seattle since it's cheaper since you don't have to payout PTO.  I wonder when I'm next.","isChecked":false,"level":3,"score":"25"},{"author":"tmking","body":"If your PTO is not protected use that shit!!","isChecked":false,"level":2,"score":"25"},{"author":"WarAsh86","body":"I was supposed to see my doctor yesterday, hoping to be cleared to go back to work. I had rotator cuff surgery 2 months ago. Appointment was canceled, so I cant go back without the paperwork. Super sucks cuz I have $100 to my name.","isChecked":true,"level":1,"score":"1805"},{"author":"waterbuffalo750","body":"With something like that, I would ask your employer if they make an exception for extenuating circumstances. Or call the doctor and see if he can give you any kind of note.","isChecked":false,"level":2,"score":"680"},{"author":"WarAsh86","body":"I left a message for the doctor yesterday. I work a labor job. Boss already said I'll need paperwork. Liability issues.","isChecked":false,"level":3,"score":"476"},{"author":"bsnimunf","body":"Sucks but understandable form your bosses point if view. Hopefully the Dr comes through.","isChecked":false,"level":4,"score":"111"},{"author":"betsylang","body":"Last hired first fired. The owner loves me but she couldn’t keep us all on, so it was only fair. My side gig is dog walking, which is fucking slow bc no ones leaving their houses these days. God bless the biddy who’s dogs I walk everyday.","isChecked":true,"level":1,"score":"3948"},{"author":"delmar42","body":"I have a friend whose job is walking and running dogs. She's also seeing her gigs disappear, which is tough on her. Today, we're having a nasty snowstorm, so the gigs she would have today and tomorrow have also disappeared.","isChecked":false,"level":2,"score":"716"},{"author":"betsylang","body":"It’s a fuckaroo. I’ve got an overnight this weekend and I’m literally just waiting to hear it’s canceled bc they can’t leave.","isChecked":false,"level":3,"score":"137"},{"author":"yeahthx","body":"My mom has been using the same dog walker for almost a decade at this point. Even after my step-dad retired, my mom kept her on because she’s a great lady, great with the boys, and my mom didn’t want to take away any income. My mom is a hair stylist, and her appointments have easily dropped by 70-80%. Her biggest concern/anxiety was “I’m worried I’ll have to tell Marie I can’t afford her services anymore!” :(","isChecked":false,"level":2,"score":"40"},{"author":"Topremqt","body":"My girlfriend works for Marriot and basically lost her job. They told her they'll call her when they need the staff again. She tried to apply for unemployment and was denied because Marriot has her as an employee who works 0 hours. So for the time being I'm taking over her financial responsibilities.","isChecked":false,"level":1,"score":"3776"},{"author":"AGuyAndHisCat","body":"Most unemployment applications are denied on the first request.  Appeal it and she will likely be approved.\n\nCutting hours are valid grounds for unemployment","isChecked":false,"level":2,"score":"1074"},{"author":"Abivile93","body":"I wish i knew that when i was unemployed :/","isChecked":false,"level":3,"score":"48"},{"author":"Jeutnarg","body":"Cutting somebody's hours to 0 usually counts the same as firing them. Although I'm just now reading that in the UK there are some jobs where it doesn't. Zero-hour contracts or something like that.","isChecked":false,"level":2,"score":"1732"},{"author":"ShemhazaiX","body":"Yup. Essentially you work for them but your contract has no minimum hours. However, we also have employment support in this country that ensures that a minimum amount of money per week for people (it's not a huge amount of money, but it's better than nothing).","isChecked":false,"level":3,"score":"446"},{"author":"rebeccavt","body":"She needs to try again if she was denied. They didn’t officially lay anyone off until this week. \n\n[The CEO put out a public statement today](https://www.travelweekly.com/Travel-News/Hotel-News/Marriott-CEO-discusses-difficult-steps-the-company-must-make) \n\nI work in the travel industry, and it’s honestly a hard video to watch, but she has been laid off and is entitled to unemployment.","isChecked":false,"level":2,"score":"220"},{"author":"iphon4s","body":"I worked at Hyatt as an intern. They told us we were no longer employed by Hyatt effective Monday and refused to pay us our sick or personal days. And to top it off most of the interns at my job are international so they they're stuck with no job and have rent to pay. And they also most leave the country now including the new intern they hired 2 weeks ago.","isChecked":false,"level":2,"score":"30"},{"author":"Casualmindfvck","body":"Was working as hourly for a company which deals with the shows in Vegas.\n\nI read the news about all the shows stopping in Vegas we were out of work Monday until who knows when.\n\nI was the only one with income in the family. I have a small business but with everyone out of work who knows what’s gonna happen.\n\nIve been broke before but this is different.","isChecked":false,"level":1,"score":"299"},{"author":"lachjeff","body":"I had been unemployed for over two months, with countless applications and rejections. I finally landed a job at a record storing facility, good hours, good pay. Technically it was a casual job but it was essentially full time, there was work for me for over a year. \n\nThe company whose records I was to be taking care of cancelled the job and I was back out of work after 5 and a half days.","isChecked":false,"level":1,"score":"1314"},{"author":"teenage_wet_dream","body":"Not sure where you're located, but Save A Lot grocery stores and distribution centers are hiring across all locations. I can help you look into it if they're available near you.","isChecked":false,"level":2,"score":"252"},{"author":"ImNotScaredNotAtAll","body":"Wife and I both work in the restaurant industry. Both laid off unpaid indefinitely. She’s a type 1 (insulin dependent) diabetic, and we’ve got 2 young kids. We have no idea what we are going to do. Insulin and supplies were already killing us. The thought of not being able to get her insulin is horrifying.\n\nEdit: thank you so much for the kind words and advice. We are applying for Medicaid and snap tomorrow and I’ll be looking in to what the insulin and pump supply manufacturers can do to help.  \n\nWe expected to go to work the last couple days. They decided to close the doors, and I can’t blame them. It just sucks. It just sucks that i can’t even go out to find a job. A couple of incredible redditors are going to Venmo us a few bucks to get by and we are beyond thankful. Stay safe, wash your hands, stay home if you can.","isChecked":false,"level":1,"score":"2595"},{"author":"hematino","body":"I dont know if this will help you but I would try writing a letter of appeal to the drug manufacturer of her brand of insulin, explaining your circumstances. Sometimes they will  provide necessary medications at a reduced cost or even free for people who are unable to afford it. I know it sounds crazy, but I work in healthcare and it does work sometimes. In any case, best of luck to to you both!","isChecked":false,"level":2,"score":"640"},{"author":"clothedinblack","body":"Thanks for posting this. It needs more visibility. I was unemployed and without insurance for a while due to medical issues and the medication I needed was $1,700 a month. There was no generic so things like GoodRx didn’t apply. My doctor wrote a letter to the manufacturer for me and I ended up getting the medication for free.","isChecked":false,"level":3,"score":"352"},{"author":"jeffdo1","body":"If you get desperate, Walmart has cheap insulin that while isnt as good as the modern fast acting and long insulins of the day, will keep her alive. I've been a type 1 for 30+.years, and it's a backup if I ever lose my health insurance. Tell her to be very careful,.I have seen a couple articles that talk about the higher risk diabetics face from Covid and its killing healthy people.\n\nEdit : Added Link to one of the articles. https://www.thelancet.com/journals/lanres/article/PIIS2213-2600(20)30116-8/fulltext","isChecked":false,"level":2,"score":"990"},{"author":"Christinamh","body":"PLEASE apply to the patient assistance programs RIGHT NOW for her. You should qualify for free insulin from the manufacturer. What does she use? Humalog? Novolog?\n\nUpdate for ANYONE needing and cannot afford insulin. I hope you qualify for some of these programs:\n\nEli Lilly: https://www.lillycares.com/\n\nNovo Nordisk: https://www.novocare.com/diabetes-overview/let-us-help/pap.html\n\nSanofi: http://www.sanofipatientconnection.com/","isChecked":false,"level":2,"score":"25"},{"author":"The-Nth-Doctor","body":"I'm not sure where you live, but I'm a physician in MO. I can prescribe out of state for non-controlled meds, so if there's ever a time you guys need help, feel free to contact me. We can set up a telemedicine appointment free of cost.","isChecked":false,"level":2,"score":"21"},{"author":"saggysandwich","body":"I actually gained a job out of this, my local walmart had alot of people quit because of the sudden high demand for everything","isChecked":false,"level":1,"score":"1151"},{"author":"viodox0259","body":"Yeah unfortunately for us I could go down to the supermarket and grab a job, but EI is going to pay me more..Oddly enough I'd rather work than stay home, but I can't do it for less.  \n\n\nBoss: Your hired!  \nMe: Can you match my EI?  \nBoss: Door is over there.","isChecked":false,"level":2,"score":"388"},{"author":"hoardac","body":"Here in Maine the UI is less than minimum wage. I believe in a few weeks I will be collecting it again.","isChecked":false,"level":3,"score":"24"},{"author":"seuche23","body":"what a ridiculously stupid time to quit.. I work in retail, and for the first time in the 7 years I've worked in retail, I feel blessed to have this job. For the time being, our store is extremely important to everyone living in our area. It's been black friday crazy for the past 2 weeks, but the money I'm making to help my roommates and my animals is all worth it during this time.","isChecked":false,"level":2,"score":"33"},{"author":"base5700","body":"It would make sense if they have someone thats immunocompromised that they live with or are at risk themselves","isChecked":false,"level":3,"score":"23"},{"author":"deeznutz2909","body":"Had been unemployed for nearly two years due to medical problems. Finally got cleared to go back. It was a long, hard fought road.\n\nApplied, got an interview. Crushed the interview. Offered the job on the spot. Took it. \n\nTwo days later, they took the offer back. Industry is getting crushed. \n\nTiming so shitty it hurts.","isChecked":false,"level":1,"score":"506"},{"author":"Thompson_S_Sweetback","body":"Shit, dude.  Shit sucks.","isChecked":false,"level":2,"score":"21"},{"author":"greensypoop","body":"I have just read that 18% of US Workers Have Lost Jobs or Hours...","isChecked":false,"level":1,"score":"3662"},{"author":"khaominer","body":"I would guess it's way more than that. We are one of the few hotels still open in the area and have everyone down to 1-3 days. Housekeeping only a couple days a week for the few people staying. \n\nI have 14 shifts instead of 28 for 6 shuttle drivers, 14 shifts for 5 front desk, with me being required to take some of their shifts since there is no way to rationalize me being there at the same time as them, but having to complete higher level tasks. Malls are 80% closed, stores and restaurants slowly closing down. \n\nThere is absolutely no way to live in this expensive area on those hours. $1000 bailout doesn't touch average rent, much less other bills.\n\nShits bad.\n\nEdit: I'll add on. Restaurant is closed. Chef, cooks, dishwashers, bartenders, servers have zero hours. Training is cancelled. All our new hires to prepare for busy season are cut. If you don't have a different job (you won't), by the time we need you, we'll bring you back.\n\nSales is furloughed. There is no one really for them to sell to. Banquets is dead. One of the most profitable semi-line level jobs in this area. I know people who work hard for a handful of big convention hotels and clear 120k. No banquets. Anywhere.\n\nI will say ownership has taken two actions other hotels in the area are not. You can use PTO, if you have it. Unfortunately, most of my employees only have a couple days worth.\n\nThey will pay your employee cost of insurance if you have zero hours. This is huge. Last recession people with 1-2 days had their entire paycheck go to benefit costs, or even ended up owing the company money when they came back. Imagine finally having hours and $1000 going to back pay your benefits.","isChecked":false,"level":2,"score":"1166"},{"author":"Shinokiba-","body":"I work in a factory that makes hand sanitizer. Now we all have to work double shifts.","isChecked":false,"level":2,"score":"26"},{"author":"agirlwhosews","body":"I'm self employed so not technically lost my job, but all my clients have cancelled because I'm a tailor and who needs clothes when everyone's home isolating! Was even in the middle of making one lady's wedding dress, and she just forgot to tell me she's buggered off out of the country, and not gonna get paid. Hope this all blows over soon :'(","isChecked":false,"level":1,"score":"816"},{"author":"Fickles1","body":"I like your user name. I hope it all works out","isChecked":false,"level":2,"score":"52"},{"author":"grim_infp","body":"Man. I'd send that bride a bill","isChecked":false,"level":2,"score":"45"},{"author":"depixelated","body":"I worked with a company that did environmental work with concerts and musicians. Just started the job too and was really excited to start what I thought was my dreamjob. I got laid off because of the virus. \n\nJob hunting during the quarantine is really difficult, and I would like to use my environmental science degree for something useful :(","isChecked":false,"level":1,"score":"340"},{"author":"Bolaixgirl_105","body":"I work in a hotel. Last week,  our occupancy dropped to the twenties and most of the front line duties were taken over by upper management and our line staff was laid off or had shifts reduced to 1 or 2. This week, our occupancy dropped to less than 10%. Right after the hotel CEOs met with Trump and announced that they were shutting hotels down, my company called and laid off sales, chef, banquets manager, and anyone else they could. That is when I was laid off.  My manager told me he thinks they will close the hotel next week and lay everyone else off. It should be noted that they didn't lay off anyone in the corporate office because our company is all about nepotism and we shouldn't expect our company photographer or company newsletter writer to be without a job. I do understand that we can't run empty hotels but I thought the lay offs should be more fairly distributed. The upside is that my boss felt so bad about laying me off that he gave me a garbage bag filled with toilet paper as a parting gift.  I love that guy!","isChecked":true,"level":1,"score":"616"},{"author":"sunbeforetheburn","body":"Hotel. Marketing manager. Laid off yesterday. 12 years with the company.","isChecked":false,"level":2,"score":"121"},{"author":"Bolaixgirl_105","body":"I am so sorry. I don't know what we are supposed to do now. I have been in hotel sales for 20 years.","isChecked":false,"level":3,"score":"24"},{"author":"caramelcooler","body":"At any other time I would be appalled hearing about toilet paper as a consolation gift. But that's actually really sweet of him with everything going on","isChecked":false,"level":2,"score":"84"},{"author":"x8Tommy8x","body":"Sounds like Hilton. I was banquet set up. Nobody laid off that I know of yet but cancelled until further notice. Hotel occupancy was 17% last time I was there.","isChecked":false,"level":2,"score":"21"},{"author":"FightTheWindmills","body":"My last day at my old job was Thursday started a new job Friday. All my old friends and coworkers are laid off Sunday. And I have this guilt I can't shake.","isChecked":false,"level":1,"score":"1167"},{"author":"Karma-IsA-FunnyThing","body":"Don’t feel guilty, you got really lucky with impeccable timing that you mostly couldn’t foresee.","isChecked":false,"level":2,"score":"550"},{"author":"LastLadyResting","body":"Your new job made no difference to the status of theirs. And you not being unemployed takes pressure, however slight, off the resources they will now need.","isChecked":false,"level":2,"score":"28"},{"author":"christhewelder75","body":"Covid19 + price of oil dropping like a rock = bad time to be a welder in Alberta..... \n\nIf it was just the virus things would be alright. But the company got hit with multiple things all within a short time frame.  So nothing to do but reddit, YouTube,  call of duty and walk the dog. All while getting back some of the money I gave the government over the last few years.....","isChecked":false,"level":1,"score":"515"},{"author":"Jester-shark","body":"My child care center closed last friday and my wife's center closed yesterday. Company plans on staying closed until April 26th. They are paying us for the first two weeks.","isChecked":false,"level":1,"score":"190"},{"author":"HappinessOrgan","body":"Didn't lose my job because of this, but I've been between jobs for a good few months before this. It's been a terrible experience trying to get interviews or processes to move forward because of everything going on. Makes me worried about how much longer it'll be","isChecked":false,"level":1,"score":"1622"},{"author":"robotsonroids","body":"I do IT stuff and have been unemployed to deal with end of life care for one of my siblings.   That issue eventually \"resolved itself \".  I just started looking for jobs recently, and I am ecstatic that at least companies are willing to do remote interviews now.\n\nNow my 77 year old mother just got tested for covid 19 (no results yet). Its not been a good year","isChecked":false,"level":2,"score":"676"},{"author":"usertest_666","body":"Sunday night I lost my cousin. He mixed alcohol and antidepressants. Talked to him earlier that night and he said he was having a hard time. Thought about driving up that night. Decided against it. Then got the news the next morning about what happened. Worst part is we can't even have a funeral for him since gatherings of more than 10 are banned. \n\nI hope the test comes back negative and your mom recovers soon m8.","isChecked":false,"level":3,"score":"435"},{"author":"Mr-Who","body":"It wasn't your fault.","isChecked":false,"level":4,"score":"24"},{"author":"PiccadillyPineapple","body":"**It's not your fault.**","isChecked":false,"level":4,"score":"20"},{"author":"adeiner","body":"Oh ugh I'm sorry. 2019 was a bad year for me and I didn't have to deal with a pandemic on top of it.","isChecked":false,"level":3,"score":"75"},{"author":"robotsonroids","body":"Basically fuck 2020.  I'm also in a custody battle in regards to my kid, and had a major surgery on my hand (apparently I can cut my finger to the bone with a serrated butter knife...).  This whole last six months can fuck off","isChecked":false,"level":4,"score":"98"},{"author":"lilmissscum","body":"I moved home recently and work in the restaurant/bar industry. All job opportunities have vanished, which is especially shitty since this is a high season where I live. I’m lucky to have my family to help support me until things settle down. Please support and donate to charities for people who will be struggling over the next few months!\n\nEdit: if you own a bar or restaurant and can’t afford to pay the time off, lay-off your employees so they can collect unemployment. Hire them back when business should be open again.","isChecked":false,"level":1,"score":"180"},{"author":"Heibgab","body":"I work for a Ski resort in Colorado. Practically all employees have been laid off and are now stranded in a ski town with little other employment. Many have no way to get themselves home due to the desperate financial situation.","isChecked":false,"level":1,"score":"396"},{"author":"strykerx","body":"I own an escape room.  We have made negative revenue this week because of refunding cancellations and no new bookings. We were just coming out of a rough patch and finally showing some profits before this hit.  My business bank account is almost depleted.  I frankly don't think the business is going to survive.","isChecked":false,"level":1,"score":"316"},{"author":"TexBabushka","body":"Why don’t you call your creditors, landlord and whoever your business pays bills to and tell them all what’s going on and ask if you can get some sort of deferment on payments. If your business was a good borrower then it’s not in their interest to see you go bankrupt just to get the last bill paid on time.","isChecked":false,"level":2,"score":"45"},{"author":"None","body":"Damn, I'm sorry. I just booked an escape room for this weekend when our state shut everything down. I talked it over with my group and we decided to leave the money and postpone the reservation for store credit. We know escape rooms are going to get hit hard with cancellations. Hope yours can make it.\n\nI know our local ones are selling gift cards and doing discounted future reservations to stay alive.","isChecked":false,"level":2,"score":"26"},{"author":"OccyBigD","body":"Not me but my Dad. He works in the exhibition industry (setting up stands for shows, events and conferences) but now with bans on public gatherings he's out of the job indefinitely. He was the sole earner in our house as well and we only have enough rent money for the next month. Scary times ahead.","isChecked":false,"level":1,"score":"239"},{"author":"yogagirl1641","body":"Both boyfriend and I work in the film industry, the whole industry has been shut down in Vancouver and we are not being told when productions will come back or start up again. Showed up to work on the 13th was told to go home and haven’t been back since.\n\nI’m preparing myself for 2-3 months before I can even entertain the idea of going back to work.","isChecked":false,"level":1,"score":"243"},{"author":"foreststarter","body":"I’m a nurse. Had a kidney transplant 7 months ago. Returned to work four months ago. Left work on Monday and haven’t been back since... a pay check isn’t worth risking my best friends gift.\n\nEdit: my first gold?! For staying home from work!! Lol Thank you kind neighbor and friends! Anyone else please donate instead! My wife (the real bad ass nurse bc she is currently working the L&D unit!) and I love donating to animal charities and we do medical mission trips in Peru with the dream team at Support Our Smiles [Link](https://www.supportoursmiles.org) Remember it’s always darkest before the dawn, we’re going to overcome this and be stronger for it!\n\nEdit 2: worth mentioning I haven’t “lost” my job. Nurses and staff went to work for 3 days this week to clean and now non elective surgeries have been cancelled. We’ll see what happens. It’s a surgery center and my bosses and the board (all doctors) have been beyond supportive throughout my transplant and now this pandemic... The blessing of having so many incredible people in my life has me in a never ending state of gratitude and free from fear of the unknown. Reach out if you think I can help you :)","isChecked":false,"level":1,"score":"6608"},{"author":"lua-esrella","body":"It’s definitely not, you’re doing the right thing.","isChecked":false,"level":2,"score":"986"},{"author":"foreststarter","body":"Thanks :) I see a lot of us doing the right thing! Cheers to hoping communities lead the way and we avoid a healthcare catastrophe.","isChecked":false,"level":3,"score":"181"},{"author":"Diablo516-","body":"I'm an idiot. I was thinking to myself, well, what did they give you? 2 seconds later the humiliation came crashing in.","isChecked":false,"level":2,"score":"558"},{"author":"SG_Dave","body":"It was a lovely teddy bear saying \"Get well soon\". The kidney was stolen from a hooker in Reno who we left in a bath of ice when it was done.","isChecked":false,"level":3,"score":"677"},{"author":"not_a_droid","body":"That was the gift. Their best friend did the deed in Reno","isChecked":false,"level":4,"score":"84"},{"author":"adeiner","body":"I work with a lot of immunocompromised people and I'm very worried for you and them.","isChecked":false,"level":2,"score":"196"},{"author":"mimacat","body":"I'm one and I'm hiding away and only going for walks later on at night or early morning so I can avoid people. Our 5 month old is really confused why nana and granda are suddenly appearing in the phone screen.\n\nBeing sensible is the only way for us to be safe","isChecked":false,"level":3,"score":"133"},{"author":"kimberlyautumns","body":"My mum and I lost both of our jobs at roughly the same time. We were in the process of looking for and buying a house, but now with no income we can't. We're also getting kicked out of the house we're renting because the landlords are refurbishing, and with this virus going around it's not the best time to move.","isChecked":false,"level":1,"score":"345"},{"author":"CBFmaker","body":"In some places there has been a ban on evictions! Don't let yourself get kicked out illegally!","isChecked":false,"level":2,"score":"380"},{"author":"crazychristian","body":"Unfortunately it might not be illegal. If they were heavy in the house hunt they may have their lease ending, and I don't think it is an eviction at that point.","isChecked":false,"level":3,"score":"23"},{"author":"malkuth23","body":"It is technically an eviction to get you out if you refuse to leave after your lease in the U.S. It is called a \"holdover tenant\" and the only way to get them out is through an eviction process. It is still not a criminal issue, only civil. \n\nIt will almost definitely be hostile situation and if you can find another place, it is probably better.","isChecked":false,"level":4,"score":"34"},{"author":"Fat_moses","body":"To all OPs in this thread, if you are desperate for income, try your local grocery stores. Due to the influx of panic purchasing, there are many grocery stores hiring staff with the intent to get them trained and on the floor quick.\n\nI know this position is not highly coveted (especially during these times), but it can be a source of income if unemployment is not enough.","isChecked":false,"level":1,"score":"409"},{"author":"gigglygal69","body":"Exactly! Shelf stackers / warehouse pickers / delivery drivers at the moment are in high demand. Also healthcare and retirement homes seem to be recruiting. Sadly soon this will change to debt collection related work.","isChecked":false,"level":2,"score":"39"},{"author":"thislightnevershines","body":"This! PLEASE try to if you need it. Try Walmart. Walmart pays more than minimum wage. $11hr. More depending on state. It’s not ideal but it’s a job and most stores are looking for people.","isChecked":false,"level":2,"score":"26"},{"author":"WillWorkFor556mm_","body":"Whole Foods is paying $17 right now FWIW","isChecked":false,"level":3,"score":"23"},{"author":"Kevin-W","body":"The ALDI near is desperate for people right now because of the demand. If you got one near you, look into them. They treat their employees well and the pay is good for the kind of job it entails.","isChecked":false,"level":2,"score":"29"},{"author":"None","body":"[removed]","isChecked":false,"level":1,"score":"296"},{"author":"JacedFaced","body":"I know it's not great, but it might be worth trying to talk to the motel about a trade of services. You guys do housekeeping duties in exchange for a place to stay, they're probably not running at capacity so it's not like the rooms would be otherwise occupied, and I'm sure they're having to cut back on their paid staff with everything going on. This might be a way for you guys to stay there while your mom (and possibly you, I dont know how old you are) can find work.","isChecked":false,"level":2,"score":"67"},{"author":"badassandbrilliant","body":"Don’t voluntarily move out. Many states have stopped evictions for the time being, and many courts are closed. Apply for benefits using the hotel address, and make them go through The process of evicting. It may delay the inevitable, but at least you’ll have somewhere to stay until this blows over.","isChecked":false,"level":2,"score":"61"},{"author":"Greenestofallgrass","body":"I got promoted on Monday. Got emailed Tuesday saying the business got shut down until further notice.","isChecked":true,"level":1,"score":"79"},{"author":"Shalaco","body":"Self employed. Self unemployed.","isChecked":true,"level":1,"score":"454"},{"author":"Patamarick","body":"I put in my notice for a new job. That new job put a hiring freeze after I had put in my notice. I am stuck in limbo.","isChecked":false,"level":1,"score":"279"},{"author":"waterbuffalo750","body":"You can typically rescind your resignation if your supervisor approves.","isChecked":false,"level":2,"score":"105"},{"author":"bigheadsmolbrain","body":"Reading all these answers is heartbreaking. I feel for each and every one of you experiencing financial hardship and the emotional struggle that goes along with it.","isChecked":false,"level":1,"score":"72"},{"author":"CommodoreBelmont","body":"I do web development and IT management. My company makes fabric decor for events and festivals. You know, the things that nobody's allowed to do right now. I've seen the company soar in the time I've been there. January was our best month ever, pulling in more than three times the amount the place was pulling in the month I was hired a few years back. We had twice as many requests for quotes on new projects in February as we did in December. We were crushing our records left and right. And then it was all vaporized in the span of a couple weeks as one festival after another was canceled, and event throwers canceled their orders for our products.\n\nI was laid off Monday, along with the marketing agent, sales manager, and several members of production. We've been told that when things are looking up again we'll be the first people called back, but that's going to be a while. The CEO is hoping for May. I'm thinking July is more realistic. I'm signed up for unemployment, and I'll be looking for work (because you have to in order to collect unemployment benefits), and I have a pretty good balance in my savings account. I'll be OK for a few months, although I did just have to cancel/postpone a refinance on my house. But I'm scared and anxious, and I'm grieving. I love my job. I really enjoy the work, I'm proud of what we do, I like my co-workers and I love my team.","isChecked":false,"level":1,"score":"520"},{"author":"subtxtcan","body":"Worked for a hospitality company, Sous Chef at a school residence for international students. Emptied out Friday aside from 6 students, had a little dinner party Saturday, moved all the product we could from cold storage to other locations and donated what we couldn't (minus our boss cooking us a nice dinner that night).\n\nApplied at the local hospital this morning, hoping to get in there. We haven't been hit hard yet (Ontario) but if it does, I'd rather be working and serving those who need it/those who are working to help than sitting around at home.\n\nI'm a 28 year old fairly healthy guy who lives on his own, my gf isn't too happy, but it's better than sitting on my ass and doing nothing. I've slept on a sack of potatoes for a weekend event, better to do something than nothing.","isChecked":false,"level":1,"score":"258"},{"author":"SateenDuraLuxePaints","body":"I'm a bartender. I wasn't working Saturday or Sunday but was watching other places post on social media that they'd be closing for the time being. On Monday, a few hours before I was scheduled to go in, the city declared that sit-in restaurants should only serve take-out and that bars should close, so I spent a while with the owner packing up all the alcohol before we were all laid off in order that we could start collecting EI. I was a regular there for years before I started working there after finding it in its first week open, and it's been open almost as long as I've lived in this neighbourhood. I'm the longest-tenured bartender at this point. It's really fucked up to think about the place potentially not coming back.","isChecked":false,"level":1,"score":"553"},{"author":"pieonthedonkey","body":"Solidarity every bartender I know is basically fucked now.","isChecked":false,"level":2,"score":"45"},{"author":"shitpost_squirrel","body":"Is anyone kinda concerned that the media and general attitude seems really relaxed or hopeful towards these job losses? This whole crisis seems to be being taken lightly","isChecked":false,"level":1,"score":"279"},{"author":"canering","body":"They only seem to care about the big industries going bankrupt. Like it’s constant alarm over the airline industry. Which is a big deal, but I don’t think anyone is prepared to confront the horrifying new reality of so many people losing their jobs overnight.","isChecked":false,"level":2,"score":"162"},{"author":"Jocchionero","body":"We deliver Amazon their delivery Van's. We deliver to Amazon warehouses from New Jersey, Pennsylvania, Baltimore, and the Dc area. I was nervous about continuing traveling from city to city and crammed in a minivan with 6 guys to come back home. I stopped working tuesday and today I feel sick. Sore throat, very tired and sneezing. Hoping it's just allergies","isChecked":false,"level":1,"score":"558"},{"author":"Insomniacwithnolife","body":"This reads like a random log you’d find in a post-apocalyptic video game.","isChecked":false,"level":2,"score":"580"},{"author":"tedisking3","body":"You'd find this in the house with the zombie in the next room.","isChecked":false,"level":3,"score":"28"},{"author":"idontgotochurch","body":"I quit my job for a number of reasons right before corona chaos hit. Now my old coworkers are getting 6 weeks PTO and I am fuuuuucked in the job market.","isChecked":true,"level":1,"score":"290"},{"author":"FrequentEphedrine","body":"Same. My job changed directors 3 times over the last year and I finally decided I had enough and put in my notice 3 weeks ago. Corona hit. My last day is the end of the month and my company is basically like “Too bad.”  \n\nSlight bright spot is I did get a call for a video interview this morning, so here’s hoping!","isChecked":false,"level":2,"score":"44"},{"author":"coronabacteria","body":"I'm about to lose the job I hate but I don't hate it as much today...","isChecked":false,"level":1,"score":"110"},{"author":"None","body":"[removed]","isChecked":false,"level":1,"score":"941"},{"author":"BeefInGR","body":"> I've had to sell my car to webuyanycar to cover her\n\nYou went further than a lot of people would have. You should be applauded.","isChecked":false,"level":2,"score":"285"},{"author":"None","body":"[deleted]","isChecked":false,"level":3,"score":"101"},{"author":"LegendaryRed","body":"Don't be so hard on yourself, it's not your fuck up. It's a global pandemic","isChecked":false,"level":4,"score":"79"},{"author":"indiegogold","body":"What’s your clothing brand?\n\nI’m also a victim of the GBP to USD crash, horrible stuff","isChecked":false,"level":2,"score":"138"},{"author":"afeeney","body":"Good for you for thinking about your employee as much as yourself.","isChecked":false,"level":2,"score":"38"},{"author":"None","body":"[deleted]","isChecked":false,"level":3,"score":"34"},{"author":"formerly_gruntled","body":"Work your online game. We bric and mortar closed, you might find an angle there. People still need clothes, just not as much as before. Obviously depends on your product type.","isChecked":false,"level":2,"score":"35"},{"author":"shudbstudyin","body":"My girlfriend is a private chef. She caters all sorts of events, but bread and butter is weddings, private functions, corporate events etc. Our country isnt that badly affected (yet), so she has two events on this weekend, but after that... absolutely nothing","isChecked":false,"level":1,"score":"49"},{"author":"oaly512","body":"I scored my dream job last May and after three months I was let go due to delays in a project I was directly involved in. My girlfriend and I had just moved in together, and my monthly living cost was based off the higher salary from the job I had lost.\n\nAfter several months of surviving by credit cards,  job hunting, picking up odd-jobs to make ends meet - somethings working 3 different jobs in a single day - I finally found a new company I was excited to work. After weeks of interviewing, I started last week. On Friday, we were all put on mandatory work from home. I was the only one let go. To make it worse, my girlfriend works in hospitality and she's also out of work, too.  Shit sucks, man.","isChecked":false,"level":1,"score":"50"},{"author":"FaceYourFinances","body":"Bartender. \n\nSole worker in my family of four with two young, special needs boys. My last shift was the 15th. We’re good with our mortgage and bills for probably two months and I’ve filed for unemployment but with all the uncertainty of this coupled with how hard my industry will be hit, I don’t feel confident in my short term future. \n\nIt’s really hitting home how effectively I’ve pigeon holed myself into this situation. I make (made) a very good living and am (was) very good at what I do (did) but if my establishment doesn’t make it through this and if the industry doesn’t bounce back, I won’t be able to make ends meet (for the longest time I thought it was ends meat) moving forward. \n\nI worked very hard for a long time to get the job I was in, which was in basically the top echelon in my field in my location, but if that’s no longer there...well I’m not sure what I’ll do.\n\nI’ve been trying to work on education to move out of the service industry for a while also, but it’s been very slow going due to life. \n\nBest of luck everyone. Stay safe and healthy!","isChecked":false,"level":1,"score":"48"},{"author":"Random_act_of_Random","body":"So I work for a charter school and I was super afraid that this was it for us. But, the ceo came out and said that we are going to support the kids remotely, run online classes and everyone will be getting paid regardless if you can actually do your job or not. So the teachers are still teaching, the janitors just chill at home and everyone is paid for.\n\nMy respect went up a lot for them.","isChecked":false,"level":1,"score":"145"},{"author":"house_copeland","body":"My husband and I work for a local public charter school as well. He is a teacher so they moved to online temporarily and he’s getting paid. I work in the front office and was nervous I would be SOL but we just got word we are getting paid regardless. I am so grateful but also feel awful that not everyone is as lucky.","isChecked":false,"level":2,"score":"30"},{"author":"nrbaird","body":"I was in sales trying to get businesses to send employees to public workshops at hotels. We normally had 30-60 people at each workshop. Not the hottest thing out there now due to covid19 so they fired 20 people yesterday and kept only the top 5 guys. They said they will rehire us again after business resumes normally.","isChecked":false,"level":1,"score":"217"},{"author":"Amacnarb","body":"I cook in a michelin starred restaurant in Chicago. So first off know that the company I work for will most likely survive this, unlike many other small companies. A week ago today I was working a 6am prep shift, only one other guy there. Every employee had their temperature checked coming into work, and all hands were washed on the hour and documented. Things were starting to get slow and hours were starting to get cut. At this point not too worried. Saturday rolls around and i’m working brunch, afterwards managers had a meeting where they were told they would all be taking a 35% pay cut. Still nothing for me to worry about as a commis. Sunday our Governor announces that all restaurants and bars in IL are to close by monday night, within a few hours our company sent out an email that stated that we would all be furloughed at midnight with a >$1k stipend. The restaurants were mothballed and everyone went home. We’re now working out a to go platform to bring employees back into the restaurant to make some money. All profits from the take out orders are being evenly divided amongst all staff. \n\nWe are very (very) lucky to be getting any support from our employers, most if not all employees will get their jobs back and we will come back stronger than ever. We’ve been through some shit before but nothing as sad as having to shut the doors to all of our restaurants.\n\nThat being said visit [Tock](https://www.exploretock.com) to see the delivery options in your area. If you are in Chicago and you feel so inclined, please order from any of The Alinea Group restaurants on Tock. There is no doubt we will get through this, together.","isChecked":false,"level":1,"score":"136"},{"author":"RexMundi000","body":">Alinea\n\nI flew into Chicago to eat here last year. Once this all blows over if anyone is on the fence, definitely check it out it is fantastic. I am also thrilled to hear that management is taking care of their employees.","isChecked":false,"level":2,"score":"20"},{"author":"doodoomcgee","body":"I’m a server at a local Asian restaurant in the south, so you can imagine how it’s been. Ever since the virus started we’ve been dead. I never made more than $50 on a 9 hour shift this past month and I’ve worked plenty. Finally we had one day where we had maybe less than 5 tables come in (who were regulars) and we decided we couldn’t stay open anymore. I tried applying to a few other restaurants (one being right next to my current job so I could hopefully work both) but they had to cancel my interview because they weren’t making enough money to hire. It was really hard for the owner to close down, and he hated how much people assumed things about the restaurant due to it being Asian food.\n\nWe were talking a few days before we closed and he asked me why we weren’t getting any customers, and I told him I think it was due to the virus and us being an Asian restaurant. It was funny hearing my misty silent Chinese boss stare out the window and say “..... das fucked”\n\nEdit: I didn’t lose my job but am temporarily laid off until further notice.\n\nEdit: also just remembered, all of our kitchen staff are illegal immigrants or people trying to get their citizenship. They have no way to make money and no way to sign up for benefits. We’re all really worried about them.","isChecked":false,"level":1,"score":"138"},{"author":"SpadeMacD","body":"I threw away a decent salary and a stable-but-mediocre life just over a year ago, to try and achieve something worthwhile and interesting for myself. I was guided toward a 1 year course in creative advertising, which seemed really interesting.\n\nSo, I sold off most of my worldly posessions to get enough cash to move to the opposite end of the country with my partner to begin study. I got really into it, the course was really well connected with industry and I finished the course strongly with amazing prospects. I took the most prestigious offer (which was also the lowest paying, because prestige I guess) and began my internship at a world-leading agency.\n\nThat was 6 weeks ago.\n\nMy partner and I separated because we were growing apart and on Monday I moved my belongings into a complete shithole of a flat, populated by shirtless weirdos.\n\nThe next day, my company let go of all their temporary & contract staff.\n\nMy career is gone, and I'm all alone in a disgusting house with no friends.\n\nAt least I have internet for reddit ¯\\\\_(ツ)_/¯","isChecked":false,"level":1,"score":"97"},{"author":"TannedCroissant","body":"I’m a waiter.  I haven’t lost my job but lost 25% of my hours next week.  I’m expecting it to get worse as time goes on.  We’ve been told nothing from head office about what happens if there’s a lock down.  As I’m paid hourly, the assumption is I won’t get paid.\n\nThe Prime Minister was asked today what happens to staff losing hours or being made redundant and his response was that he was looking after the companies and he hopes the companies will do the same for their workers.\n\nVery reassuring.","isChecked":false,"level":1,"score":"173"},{"author":"TheGreatRandolph","body":"I do camera work, mostly reality TV. Our entire industry is shut down. I had just finished filming Deadliest Catch and returned to real life to sleep (I worked 40 hour days, often with 2-hour naps, but no real schedule, just go!, so recovery takes a bit after that one) and climb for a bit. Then everything I had lined up, and everything all of my friends are working on, went away basically overnight. \n\nWhenever you can, just turn the TV on to Discovery so when this all blows over, I can get back to frolicking in Alaska! Or the jungles. \n\nSide note - I finally had time to get treated for the parasite I picked up in Belize on Naked and Afraid. I named him Rupert, and thought I killed him climbing, but it turned out I was wrong. Goodbye, Rupert. You’ll be missed.","isChecked":false,"level":1,"score":"170"},{"author":"crashkg","body":"you guys do incredible work. I'm a  DP and I always marvel at the guys that can operate a camera in those conditions. I hope things turn around soon. Good Luck.","isChecked":false,"level":2,"score":"21"},{"author":"Luckboy28","body":"My facebook feed is filled with friends who work the service industry, basically asking for help with basic necessities.  =(","isChecked":false,"level":1,"score":"131"},{"author":"Skarmex94","body":"I was/am a security guard for a nightclub which is obviously closed for now but I have a really cool boss, he's given all his employees the time off while still being paid cuz the dudes super insane rich and he looks after everyone. Everyone is guaranteed their old position when we return. Thanks Garry you absolute legend you!\n\nEdit: Uhh platinum why?","isChecked":false,"level":1,"score":"136"},{"author":"ForscherVerrat","body":"Go Garry!","isChecked":false,"level":2,"score":"33"},{"author":"eak23","body":"Chef, restaurant closed since our menu is not take out friendly. Owners have been super helpful with unemployment. They also gave the staff anything that wasn’t freezable like produce and stuff. I am honestly proud to work for them in the way they handled it.","isChecked":true,"level":1,"score":"48"},{"author":"theonlythingissufjan","body":"I'm a substitute teacher, and I had a few sub assignments lined up for the next month. All are cancelled, and idk if there will even be school year to finish. I had to apply for unemployment since I have no means of making a living if schools end their year.","isChecked":false,"level":1,"score":"120"},{"author":"None","body":"[removed]","isChecked":false,"level":1,"score":"124"},{"author":"SugarDraagon","body":"I’m only 22 weeks pregnant, but lost my job as a server on Monday. I also don’t qualify for unemployment because I didn’t work there long enough. I hope things are looking up for you by the time your baby comes. Just remember: you’re going to make it through this. It’ll be tough, but you’ll make it. Especially since you can’t be evicted. Best of luck to you. ❤️","isChecked":true,"level":2,"score":"46"},{"author":"rileyellen","body":"We sold our house, packed up our stuff and our two young daughters, and moved our family to the Bay Area in California for my husband’s new job in SF. That was January 25th of this year. He lost his job on Monday as soon as they announced the shelter-in-place order. We left behind our families, friends, home, everything for this job. We don’t know what we’re going to do. \nThankfully we have savings from selling our house while he looks for a job. We just don’t know who, if anyone, will be hiring anytime soon. I want to buy a school bus and convert it to an RV and go live in the mountains. I have yet to get my husband and our daughters on board with that plan though","isChecked":true,"level":1,"score":"122"},{"author":"CreativityWeaver","body":"Lost my job this morning! I had been writing software for airlines. First thing I saw this morning in my calendar was a meeting with HR, half an hour later myself and almost everyone I worked with was redundant.\n\nWe had all seen the issues of course, but we weren't expecting such a sudden cut down to a skeleton staff. I hope it's enough to keep everything running for the sake of my colleagues still there.","isChecked":false,"level":1,"score":"41"},{"author":"Jim_Dickskin","body":"I was looking for a job after college for a solid year, finally broke down and got one at a grocery chain doing online orders and hated it for a year. About a year ago I got hired and could use my degree with and was happy and getting paid well. I was able to pay my rent and my girlfriend's while she was in school. Got laid off 2 days ago with no indication as to whether I'll have a job when this is over and trying to figure out how I'll support us.","isChecked":true,"level":1,"score":"41"},{"author":"Sundevil115","body":"I’m a line cook in Las Vegas , NV. I was called on Saturday by my chef telling me Sunday would be my last day of service until further notice. The entire casino industry has been forced to close until further notice. A lot of my brothers and sisters in the Hospitality industry are hurting right now. I don’t know what to do because honestly no one is hiring. The grocery stores are sure but everyone has the same idea of applying to them now we have a 30 day quarantine in our state and they haven’t moved to freeze rent and mortgage payments for the time being. I’ve filed for unemployment and at this point all I can do is hope that this will fixed itself in the next 3 weeks. As a cook I always thought I’d never be out of a job, people always need to eat. It’s been an eye opening experience for me. I know no one might read this , but it’s got to get it off my chest. All my cooks , bartenders , dishwasher, servers , etc. keep your head up high. We will get through this. \n\n86 the restaurant industry.","isChecked":false,"level":1,"score":"117"},{"author":"Punkinprincess","body":"I'm a stripper which is a pretty big no go while people are social distancing. All the bars in my state closed on Tuesday and that same day I went to a hiring event at the grocery store near me and walked out with a job! I was scared because as a stripper I don't qualify for unemployment and my boyfriend also works in the service industry and his hours are getting cut. I also got a job with the census that was supposed to start on the 24th but that got postponed. \n\nOverall I'm kinda excited to work at the grocery store, I was kinda looking for a part time job anyways before this all started and maybe it will be good way to transition out of stripping.","isChecked":true,"level":1,"score":"80"},{"author":"blueshyperson","body":"I work for an eye doctor and they just had a really slow couple months after Christmas and had already cut down our hours. The doctor cancelled all appointments and has essentially closed down. She told us she has business interruption insurance which she originally thought would cover us all, but after several days of back and forth with them it’s totally still unclear if we will be covered and paid. In which case she will lay us all off and we must collect unemployment. I am hoping to know as soon as possible so I can file for it ASAP. I also filed for my tax refund 5 weeks ago and it’s still not come so I’m a little concerned. Actually really concerned but I know there’s nothing I can do. I’m hopeful I will be called back to my job after this but can’t be sure.","isChecked":false,"level":1,"score":"137"},{"author":"CayCay84","body":"I work for an eye doc as well. We were told yesterday that today was the last day for a while. He was awesome and printed all the steps for unemployment and gave us all TP. He’s a good boss. Hope to be back mid April.","isChecked":false,"level":2,"score":"29"},{"author":"thefamiliarity2014","body":"I lost my job in China, moved back home and shit hit the fan here.. made it through my quarantine and now nowhere is hiring.. my husband and I are now both without jobs.","isChecked":false,"level":1,"score":"138"},{"author":"GM_10","body":"My mother works in an office for a company that ships party products. Because of the crisis, no one is ordering anything and the business has come to a complete stop.  She's been told \" we'll call you if we need you,\" and i'm really worried how long she'll be laid off for. The worst part is that, she thinks she'll be called back in about a week or so, but my dad and I don't want to tell her what might actually happen because we don't want to break her heart. It's a tough reality that we're facing because of this virus","isChecked":true,"level":1,"score":"36"},{"author":"jimmythecomic","body":"I’m a tour guide- we make most of our money between March and June due to traveling school groups. All March and April shifts have been cancelled, I’m praying I get to work in May. When tours slow down in June I usually work in a summer camp, there’s some uncertainty there as well.","isChecked":false,"level":1,"score":"33"},{"author":"w0lfatthed00r45","body":"Live/theatre sound professional in NYC. Worked full time at a show called Sleep No More for 7 years. On Friday March 6th they laid off at least half the staff but promised us our jobs were safe and we weren't closing. We cancelled a lot of bands that normally play after the show. Then on Thursday March 12th the city announced Broadway would close and the management made the decision that that night would be put final show . The performers made the call that they would be more comfortable if we didn't have an audience ( since it is an immersive, intimate show with a lot of contact). We had a final party and some drinks and said goodbye. The next day we were informed the show would be closed until April 12th, when Broadway would reopen . Then on Sunday March 15th we were informed that the entire staff was terminated. Praying my landlord will give us some slack, but I literally lost 100% of my income. I live paycheck to paycheck with no savings. I'm scared. Already on Day 6 of quarantine.","isChecked":false,"level":1,"score":"38"},{"author":"greyman700","body":"In the middle of simulator training at the airlines and told to go home. Now I’m home. My old job is contracting and likely wouldn’t be a good option even if they took me back so I’m looking at alternatives.","isChecked":false,"level":1,"score":"99"},{"author":"80s-Dayglow-Kitten","body":"My fiancé is a freelance sound engineer. He’s not going to be working for the foreseeable future. Most of the big AV companies in our city have shut up shop. Thankfully it looks like my job is secure for now (software), but we’re going to move to a smaller place and do some serious belt tightening.","isChecked":false,"level":1,"score":"229"},{"author":"10ac","body":"My wife and I both work in Video/TV production - all of our shows and events cancelled, completely shut us down.","isChecked":false,"level":2,"score":"25"},{"author":"cbh94","body":"I’m in Hawaii with my brother. We’re both in the service industry and we’re both out of jobs now. We’re heading back to the mainland next week.","isChecked":false,"level":1,"score":"30"},{"author":"None","body":"Worked as a social media manager for a retail store. They let me go as they weren’t making enough sales to make sense paying me, and also made a point to say it wasn’t because of the virus or the bushfires (yet both severely impacted how many sales we made so..) I now can’t find a new job because nowhere is hiring.","isChecked":false,"level":1,"score":"33"},{"author":"None","body":"[deleted]","isChecked":false,"level":1,"score":"34"},{"author":"GrimSkey","body":"Server in NYC. Restaurants are shut down except for take out & deliveries. I've been out of a job for about a week and my last pay check hit today via direct deposit which was about $300 because of the few days I worked. Applied for unemployment but the site keeps crashing due to a huge volume of traffic. Nothing anyone can do right now tbh. Thankfully I live with my family two of which are pharmacy techs so it's not that bad. Future is still uncertain and that's causing a bit of anxiety but I gotta keep moving forward and doing what I can.","isChecked":false,"level":1,"score":"32"},{"author":"Cattopotato","body":"I quit my last job (shitty barely above minimum wage job) to take a month off and relax because I got 2 job offers from fairly decent careers.\n\n1st choice said training was cancelled, and 2nd choice soon after said the same.\n\n&#x200B;\n\nSo now I work part time at a grocery store  🙂 🔫","isChecked":false,"level":1,"score":"89"},{"author":"potatojoey","body":"I haven't technically lost my job yet...American living in Australia and I just finished my PhD in neuroscience, secured a postdoc at MIT and was set to start early April. This is now all postponed until the storm settles, meanwhile I now have no income and don't qualify for any aid from either country. Yay me.","isChecked":false,"level":1,"score":"65"},{"author":"Space_indian","body":"I live in Portland, OR. My gf and I both got laid off on the 16th when the governor ordered all bars and restaurants to close except for to-gos. We have no income and are just taking things day-to-day. \n\nWe've created a sub reddit for our 'hood, hoping to build a community and easy way for people to socialize. r/sullivansgulch . Join if you're in the area, share your stories.","isChecked":false,"level":1,"score":"242"},{"author":"theacemaverick","body":"This is what makes this a crisis. Previous financial crashes seem to focus on billions being wiped off the stock market which doesn't really affect the majority of workers (at least immediately). This has manifested itself so quickly and so brutally by completely removing any requirement for a whole host of jobs - people are feeling it at ALL rungs of the ladder. Not just some arsehole banker who has had his shares wiped out overnight. \n\n&#x200B;\n\nThe worst part is this is only just the beginning.","isChecked":false,"level":1,"score":"125"},{"author":"RayTrain","body":"Student lab assistant at my University. Didn't necessarily lose my job, they'll probably bring me back when campus reopens, but for at least a couple months I'll be unemployed.","isChecked":false,"level":1,"score":"121"},{"author":"DarrellKee","body":"Didn’t lose my job, but I think this comment belongs here. \nI own a business with 20 staff and told them that no one is getting laid iff because we...\n- always make sure to have savings \n- care more about the team than clawing back profits\n- love working together \n- are pivoting our business to get new customers \n- believe we will come out stronger \n\nLayoffs are sometimes necessary but companies need to do their best to take care of their own. Companies are made up of awesome people. If you take care of them, they’ll take care if you.","isChecked":false,"level":1,"score":"270"},{"author":"5ftBallofHate","body":"I am lucky enough to have work from home currently- but if anyone in Utah is seeking employment due to this, please let me know!\n\nI currently am working for a recruiting/staffing firm in SLC and have clients looking for sales reps (desperately needing sales reps with SOME experience), licensed insurance agents, and a myriad of other things from accounting clerks, some WFH CSRs, and the like who have committed to hiring candidates and training them from home/remotely as long as they can transition back to in office once it is safe to do so. \n\nWe, too, are all working from home to ensure our safety and health, so all interviews are being conducted via video chat or phone. \n\nIf I can help, please reach out!\n\nEdited to say: I do Social Media Strategy and Analytics for them, this post and any subsequent hiring does not result in ANY monetary gain for me. Nor it is at any cost to y’all, as candidates.","isChecked":false,"level":1,"score":"96"},{"author":"Yossi25","body":"Substitute teacher.  School district is closed till april 6th.\n\nI can't file unemployment since the district has plans of reopening.  But I know damn well it's closed till next year.\n\nSitting here twiddling my thumbs now","isChecked":false,"level":1,"score":"30"},{"author":"walkin_mudd","body":"I'm a hiking guide in a National Park, all of my backpacking trips and day hikes have been canceled until the end of April. Good thing I decided to wait to buy that used car.","isChecked":false,"level":1,"score":"30"},{"author":"Sattiebear","body":"I’m a professional musician, a drummer for two working bar cover bands, a well paid church gig, and a symphony orchestra. We’ve been told that all gigs and shows are canceled indefinitely, and all church services suspended. Wife and I have money saved and will be okay, but I have band mates in dire straights right now.","isChecked":false,"level":1,"score":"28"},{"author":"cyber_moon","body":"should've started on monday. I am working in the field of archaeology and heritage preservation. I got a call that they just won't hand me out the contract to sign it and I can do that \"when the crisis is over\". I moved states for this Job.","isChecked":false,"level":1,"score":"26"},{"author":"jackattack222","body":"This thread is heartbreaking","isChecked":false,"level":1,"score":"26"},{"author":"Aleksei199","body":"Long story short: proffessional cook, all restaurants, pubs, bistros,hotels and cruise ships are shut down. Not so great right now","isChecked":false,"level":1,"score":"75"},{"author":"winterbird","body":"I don't have any family in America, no one to turn to. I'm looking at being homeless with three pets.","isChecked":false,"level":1,"score":"110"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"55"},{"author":"winterbird","body":"Thank you. I'm so scared and feel so lost. ☹","isChecked":false,"level":3,"score":"37"},{"author":"backslash_arr","body":"I just landed my first job as a roadie/stagehand right before the virus hit England. My friend had given me an in by drafting me as a last minute replacement for staff that had cancelled one day. \n\nI had only done two shifts: one filling for the aforementioned unavailable staff, and the next after asking about more regular employment. \n\nAfter my second shift, I asked who to talk to about getting into the books and officially into employment. I emailed the right people and was told I’d be paid but not to worry about a timesheet. I asked if I’d get more work in an email sent on the day of the outbreak in the UK. \n\nNow all the gigs are being cancelled and I’m not getting replies to my emails from the higher ups anymore. A friend of mine, who’s been with the company for a year or so, told me that they had emailed her to let her know there’s nothing coming up in the next month. \n\nI don’t know whether I’m employed or not but something tells me I’ll not be receiving any more emails from that company.","isChecked":false,"level":1,"score":"23"},{"author":"sock_police","body":"I work backstage in theater/opera and on set for films/tv. We were the first industry to close, and likely wont be back for a long while. :T","isChecked":false,"level":1,"score":"25"},{"author":"None","body":"[deleted]","isChecked":false,"level":1,"score":"24"},{"author":"npapaya","body":"Luxury hotel downtown here, 300 employees essentially lost their jobs when the hotel announced closure until April 15th. I’m with the reservations department and luckily was able to work 1 day a week, essentially a one man department, along with a few co workers. Going to use my PTO (which I have plenty of) and apply for unemployment as a safety blanket. I pray for all those who are going through a more difficult time. Travel/hospitality industry got hit hard, seems almost over night.","isChecked":false,"level":1,"score":"24"},{"author":"minimumsquirrel","body":"I've been working for McDonalds for almost 16 years... I went back to school a few years ago and have been working part time at McDonalds as a manager. I got a call yesterday for an interview at one of my top picks for employment in the sector I want to work in. Got an email today that my interview has been postponed. I'm almost out and Corona Virus is keeping me there. :(","isChecked":false,"level":1,"score":"25"},{"author":"Brookeashleigh","body":"I just got laid off about 2 hours ago. My company which was in the health and wellness industry.. had over 1200 employees and everyone was laid off via a PDF on a company worksite, I had just gotten a promotion to a Area Manager last week.","isChecked":false,"level":1,"score":"53"},{"author":"TherapistOfOP","body":"I live paycheck to paycheck, finally got my life somewhat stable over the last year as a bartender.  I find out a couple days ago my only job is closing for the foreseeable future.  I cant afford food or rent this month and dont have health care.","isChecked":false,"level":1,"score":"126"},{"author":"curly-hair07","body":"Not my story but my boyfriends best friend is a singer. He sings at resteraunt/bars but they’ve been closing down and people haven’t been going out to these places so he can’t do his gigs anymore. It’s his source of income. So I know he’s taking a hit.","isChecked":false,"level":1,"score":"250"},{"author":"pic2022","body":"If anyone here has lost a job please look at the post office as an option. This time we definitely will need people. Some of your local offices may need people. Look to apply at www.usps.com/careers\n\nEDIT: for some reason link handling isn't working?","isChecked":false,"level":1,"score":"23"},{"author":"KGBBigAl","body":"You hear people saying all the time now “damn sports aren’t on, what am I gunna watch?!” Well that’s my job. I run camera for all the local sports in Colorado. We are all contractors and none of us are getting paid. You hear a bunch of teams offering money to the hourly employees, which is great, but that doesn’t include the people who actually get the game on the air for people at home to watch. Being out of work for a month can be devastating on our livelihoods as some of the lower positions could’ve only been on one or two shows before this crisis happened. Really rooting for a stimulus of some sort to come through.","isChecked":false,"level":1,"score":"66"},{"author":"PeperoMuncher","body":"After enduring almost a year of unemployment, then two jobs back to back where I had managers that both bullied me and made fun of me in front of the entire office - I finally landed my dream job in animation where I had colleagues that valued me, and were willing to teach me more skills.\n\nNot even a week after I started the job, I got made redundant. I'm so heartbroken. I never thought I'd ever work in a creative field, and the moment I finally do? Gone, just like that. I don't even feel like working any more. I'd rather just stay in bed and ignore people.","isChecked":false,"level":1,"score":"69"},{"author":"JD_McLaugh","body":"That sounds so defeating. You couldn't have planned for a virus to affect your job status.. BUT you planned and followed through with getting a dream job. Not a virus, you! Things will look up again. Be prepared with that same can-do attitude when it does.","isChecked":false,"level":2,"score":"23"},{"author":"PeperoMuncher","body":"The funniest thing about this job is that I didn't even find it or look for it. I called them with some crazy request so I could impress my manager and make him happy with my work, and they found it so absurd and hilarious that they created a role purely for me.\n\nI'm never going to find such luck like that ever again. Keeping in touch with them though, while I pursue my own endeavours. Luckily I have a few shoots and mini-projects to keep me busy.\n\nThank you so much for your comment! You have no idea just how much you've made me smile. It was needed. So, so needed. Hope things on your side are okay too.","isChecked":false,"level":3,"score":"21"},{"author":"throwthatoneawaydawg","body":"As someone who is still employed, reading these stories hurts. I really hope something is done to help you guys. I can only send positive vibes your ways. This is really heart breaking to read.","isChecked":false,"level":1,"score":"85"},{"author":"Innovapants","body":"I had the audacity to start a new job on January 6th. Last to arrive first to be shown the door. Ain’t nobody fuckin hiring right now so I gotta find out which bills I can skip. Everything is great!","isChecked":false,"level":1,"score":"23"},{"author":"Mnb_azad","body":"I’m in university and just got laid off my host/expediter job at a fancy restaurant in the city. I was supposed to move next month to across the country which will be postponed anyways but after this next month I stop receiving student grants and if I don’t have my job soon, I may not be able to move anyways. My girlfriend lives where I was planning to move to so I may not see her for another few months.","isChecked":false,"level":1,"score":"20"},{"author":"Snickerssnickers13","body":"I lost my job on March 13th a day after my birthday, I work in a planetarium on a college campus delivering lectures (that I make) about astronomy and physics. As we got closer and closer to shut down we began losing shows (many shows are field trips from k-12 schools) and on friday we were told to cancel our last remaining public showings. I'm terrified now about what I'm going to do financially and I'm even more worried about the consequences of the decisions I will have to make. Not only do I work at the college but I also attend classes there as well to study astronomy and physics. My big concern now stems from a little backstory so here we go. I left my old job in retail almost a year ago to the day after trying to work up the courage to change my life for years. I decided to go back to school to change my life and because of this decision I was able to land basically my dream job at the planetarium. I have been nothing but happy this last year, that is until recently when I was laid off because of coronavirus shutdowns. Now my decision is to try and weather the storm and wait until I can go back to work, or get a job in retail again (I have recent enough managerial experience that would make this pretty easy) to pay the bills. This worries me because it feels like the opposite of progress and I'm worried I wont be able to get back to school when the pandemic ends. Dont really know what I'm gonna do but I have a couple side hustles that might pan out enough to get me and my family through this. Sorry for the long post but this is basically the only time I've talked about this to anyone besides my wife.","isChecked":false,"level":1,"score":"20"},{"author":"tobsn","body":"someone told me 97% of las vegas casinos employees got laid off with a note they will be rehired instantly once the lockdown is over... can anyone confirm that?","isChecked":false,"level":1,"score":"20"},{"author":"Brain5torm","body":"I'm screwed 😑","isChecked":false,"level":1,"score":"21"},{"author":"deadlypliers","body":"Lol I just got laid off 30 minutes ago, fml.\n\nI was a contractor with a major hospital corporation in the US doing software development.\n\nNot much to the story: they're worried that the current situation is going to have a significant impact on their financials, so they're letting all of their contractors go as a first measure.\n\nIf I take a purely optimistic outlook on this, at least I'm ahead of the major waves of lay-offs for full time employees, and I have a slightly better chance at finding my next gig.","isChecked":false,"level":1,"score":"19"},{"author":"lagreenlmw","body":"I’m a dental hygienist, and they figured that putting my hands in strangers mouths was piss poor social distancing. I’m hopeful that my job will be reinstated at the end of all this... whenever that may be.","isChecked":false,"level":1,"score":"21"},{"author":"llambles","body":"I’m one of the owners of a very small worker owned co-op bakery. It is physically impossible in our extremely small baking space for us and our employees to be 3-6 ft away from each other. We chose to close today and have made ethical plans to financially support our employees.","isChecked":false,"level":1,"score":"20"}],"id":"flgaml","submissionData":{"author":"greensypoop","body":"","score":"79495","subreddit":"AskReddit","title":"People who lost their job due to this crisis what is your story?"},"url":"https://www.reddit.com/r/AskReddit/comments/flgaml/people_who_lost_their_job_due_to_this_crisis_what/?sort=top"}