{"commentsData":[{"author":"RainbowHoodieGang","body":"I built a 13 foot tall t rex with Christopher Walken's head, and New York magazine called it high brow and brilliant","isChecked":true,"level":1,"score":"1486"},{"author":"ecofreckle","body":"My dad’s name is Luigi and my uncle’s name is Mario. They are brothers.\n\nETA: I forgot to add that my dad is also a plumber.","isChecked":true,"level":1,"score":"2441"},{"author":"pen15alwayswins","body":"This is my favorite of them all!","isChecked":false,"level":2,"score":"73"},{"author":"CountPeter","body":"I died first, and then was born.\n\nI’ve told this story a few times on reddit, but I enjoy telling it so here we go again.\n\nDuring the Caesarian to bring me into the world, there was some major complication on my mother’s end. She started bleeding internally, drowning me in the womb.\nWhen I was removed, the doctors tried to get me breathing but couldn’t. I was declared dead.\nMy mother was still unconscious, but my dad was brought in to say goodbye to me. He held me in his arms, was saying goodbye when out of nowhere I started coughing up blood and screaming as babies do. Apparently it was the weirdest moment in his life, being abjectly terrified and overwhelmed with joy that I was alive. \n\nIt’s my favourite story to tell, because weirdly it takes some pressures off on birthdays. I don’t do well with to much attention by family/friends, but celebrating my “death day” doesn’t bring people the same connotations.","isChecked":false,"level":1,"score":"2903"},{"author":"PermaDM","body":"Similar situation. Umbilical cord was wrapped around my neck five times and was starting to pinch shut. Culled from my mother, I was blue in color and \"in distress\" or whatever the terminology of the early 80s was.  \n\n\nAside from ear infections necessitating myringotomy & awful allergies to everything as a child (both of which I outgrew), I've fortunately had no other significant medical issues.","isChecked":false,"level":2,"score":"78"},{"author":"owoBP7oT6RByPN1rfl0o","body":"I grew up \"on the wrong side of the river\", was considered by all to be the town loser, and went to work as a janitor while still in high school... then... in my 40s I set a goal for myself (while still working full time) to take one class at time until I either graduate or die, whichever comes first.  At age 49 I finished my Bachelors of Science Degree, at age 52 my MBA, and age 61 my Ph.D.  Never let the arrogant elitists define who you are or what you can be!","isChecked":false,"level":1,"score":"1817"},{"author":"testbotV1","body":"I never graduated high school but I have a bachelor's degree.  I was homeschooled and my mom never went through the legal steps to actually get me a real diploma, so she made one in photoshop that was then used to get me into this podunk community college that didn't verify it. From there I got my associate's degree, which I then used to get into a decent university where I got my bachelor's","isChecked":false,"level":1,"score":"5936"},{"author":"unsolicited-opinion","body":"I homeschooled and didn’t have a legit transcript when I applied for college. I made one on my computer. They accepted it. I was shocked.","isChecked":false,"level":2,"score":"1700"},{"author":"88GrandWagoneer","body":"My great-grandma ran a brothel back at the turn of the 20th century.  She was Algonquin and people were pretty racist back then so she had a hard time getting business.  Since it was a coastal town (Maine) she bought up a couple leaky old rowboats and would load them up with hookers and booze and row them out to the ships at night.  When ships came in to port most of the crew would get shore leave and hit the bars and brothels in town, but they always had to leave a few sailors on the ship to keep an eye on it.  My Great-grandmother figured those guys had money too and probably felt left out.  She basically set up waterbased lot lizards.  Or UberHoes.\n\nMy Grandpa and his sisters grew up in the brothel and no one would talk to them or socialize with them.  My Grandpa met my Grandma picking green beans for a local farmer.  They fell in love.  When they wanted to get married they had to leave the state to get away from her family that were utterly disgusted that she would marry the son of a whore.  So they ran off to Detroit because GM was hiring and that's how my family came to Michigan.","isChecked":true,"level":1,"score":"1419"},{"author":"None","body":"[removed]","isChecked":false,"level":1,"score":"2139"},{"author":"dontaskmeforfeetpics","body":"Yes name please! And why didn't you make anything from it?","isChecked":false,"level":2,"score":"553"},{"author":"justalurkerkthxbai","body":"It was called *Souls & Shadows*, and it was an anthology. The cost of advertising/marketing/artwork exceeded sales. Since the book cost .99, we earned very little after the sellers (Amazon, BN) took their share.","isChecked":false,"level":3,"score":"870"},{"author":"CaseOfWater","body":"What’s its name?","isChecked":false,"level":2,"score":"260"},{"author":"PepperFinn","body":"I am allergic to lettuce.\n\nLike I carry an epi pen allergic","isChecked":false,"level":1,"score":"2466"},{"author":"Lastdandelion","body":"Really, lettuce? Like ALL lettuce?","isChecked":false,"level":2,"score":"123"},{"author":"PepperFinn","body":"Yup\n\nRocket too and pineapple","isChecked":false,"level":3,"score":"86"},{"author":"__slamallama__","body":"I was once sponsored by the CRUNK energy drink company for sailing.  I imagine I was the only sailor on their list.  I literally just emailed them saying that I sailed and asked if they wanted me to put stickers on my boat.  They sent me a few cases of the drink, t shirts, hats, the works.  My car was known as the crunk-mobile.","isChecked":true,"level":1,"score":"23531"},{"author":"iOnlyUseShotties","body":"That’s badass","isChecked":false,"level":2,"score":"2429"},{"author":"ImRickyAndImSticky","body":"I bought a can of NOS one day and it was half empty. Called them to make sure it was safe to drink and wasn't some nasty defect. They said it's just a glitch in their system that happens every couple of thousands of cans (I took a sip but it was completely flat so I tossed it), and they sent me a coupon book with 5 free drinks and five half price drinks. Not as exciting as yours, but I didn't ask for compensation and tried to refuse them but the guy insisted that I take them.","isChecked":false,"level":2,"score":"339"},{"author":"TechnicallyHuman","body":"Similar thing happened to me but with Pepsi. Got a 12 pack and 6 of them were sealed but ENTIRELY empty. They gave me 6 free 12packs and a coupon. Was pretty sweet when in college lol.","isChecked":false,"level":3,"score":"176"},{"author":"mid-youthcrisis","body":"My grandmother has mild dementia and one time she got pretty upset that the Reese’s Christmas tree shaped cups didn’t actually look like trees.\n\nShe called Reese’s (or Hershey’s, whoever owns it) and they sent her a bunch of free chocolate and swag. She’s really sweet. She definitely didn’t yell or anything. But it’s pretty petty, lol.","isChecked":false,"level":4,"score":"122"},{"author":"theironmanatee","body":"My great grandfather worked in the textile business and started importing rayon fabric from Japan in the late 60s and 70s. Keep in mind this was during the early days of synthetic fabrics and travelling to Japan was not all that common. On a business trip, he met some Japanese business men who were selling newly designed transistor radios. His contacts wanted to setup an exclusive import agreement for their electronics to North America, but my great grandfather declined, because how many of these radios could you possibly sell?\n\nTurns out that was a short sighted business decision, because that company was called Sony Electronics. He turned down the exclusive import contract for Sony.\n\nOn the other side of my family, my Canadian relatives walked away from 100 acres of land in Alberta during the dust bowl and great depression. They decided it was not worth paying the taxes on their land. Turns out that land was right in the heart of the Alberta oil deposits. \n\nAlso on my mother's side of the family, they used to have a citrus orchard near Los Angeles. They sold it cheap to some land developers. That farm was right at Hollywood and Vine. \n\nMy family on both sides is bad at seeing long term investments.","isChecked":false,"level":1,"score":"5919"},{"author":"scoby-dew","body":"Sooooo...dump any stocks recently?","isChecked":false,"level":2,"score":"3045"},{"author":"Fantasticxbox","body":"So what recent business did you reject?","isChecked":false,"level":2,"score":"92"},{"author":"saltfish","body":"I saw the former prime minister of Poland in his underwear.","isChecked":false,"level":1,"score":"21454"},{"author":"mrbadxampl","body":"that's not how the rhyme goes...","isChecked":false,"level":2,"score":"8153"},{"author":"l_l_l-illiam","body":"I see London\n\n\nI see France\n\n\nI see... The prime minister of Poland in his underpants?","isChecked":false,"level":3,"score":"5348"},{"author":"shnopps","body":"I can see a hat\n\nI can see a cat\n\nI can see the prime minister's \"\"baseball bat\"\"","isChecked":false,"level":4,"score":"132"},{"author":"MrBrendino","body":"This is why we all agreed to never be creative again.","isChecked":false,"level":5,"score":"79"},{"author":"threelonmusketeers","body":"*former prime minister","isChecked":false,"level":4,"score":"88"},{"author":"Vastaisku","body":"I have seen the current PM of Finland in her underwear.\n\nEdit: Actual story very dull; I used to work at the same supermarket as she did eons ago.","isChecked":false,"level":2,"score":"420"},{"author":"imgonnabutteryobread","body":"While she was wearing the rest of her clothes?","isChecked":false,"level":3,"score":"93"},{"author":"youngthugsmom","body":"I was at a store when Tony Hawk was signing autographs.  I was only 10 at the time and was a huge fan.  One of his early video games had just come out.  The store had a couple tv’s on the wall and some video games to play.  Being a kid I waited for one controller to open up and someone leave.  A kid ended up leaving and I grabbed the controller and started playing and minding my own business.  A couple minutes later the store wanted to grab photos of Tony playing his own video game.  He came over and grabbed the second controller and began to play multiplayer with me.  Probably played for 10 minutes.  The bonus was it was also my 10th birthday.  So I played Tony Hawk Pro Skater with Tony Hawk.\n\nEdit:  Wow I made this comment and didn’t return to reddit until just now.  Was not expecting it to be that big of a hit.  Thank you!  I do not have photos of myself playing the game with him but I believe my parents have a couple of photos of me with him and getting his autograph.  I still have the signed board on my wall.","isChecked":false,"level":1,"score":"40767"},{"author":"Heres20BucksKillMe","body":"Nice try sneaking that bs in at the end. We all know you were turning 11","isChecked":false,"level":2,"score":"7660"},{"author":"MsBMorpho","body":"This is pretty cool man. I have a similar ish story but sadly no playing games or anything in mine.\n\nWhen I was about 11, I won a competition for some free cinema tickets and a DVD copy of Tarzan 2. The animated one, I loved the first movie and George of the jungle so it was a big deal for me. Bouncing off the wall on the day we went to the cinema! \n\nSo I'm outside the Fact cinema in Liverpool waiting for the doors to open for this movie. Theres me and my mum, a man with shades and maybe 2 other kids and a parent. Not really many people at all. Like I said, I was bouncing off the walls. Looking in through the windows, nose up against the glass kind of thing. In typical kid style I keep checking my watch for the time because it would open at 10am on the dot. \n\nImpatiently I was asking my mum why it was taking so long, not bratty  really just really excited. She told me to chill and just keep an eye on the time. \n\nI check my watch over and over and finally it says 10am. I started bouncing like crazy even more. 'Omg its 10! It's 10am!' \n\nBut then this dude with cool shades leans down, takes off his shades and laughs. He said 'Um no, its 9.55 darlin' He was pretty cool, made me laugh and chatted with me while we waited. I told him about the competition and the movie and he was really patient with me, just mild chit chat sort of thing and I don't remember much tbh. Meanwhile my mum said nothing at all and just watched us.\n\n10am finally comes around and the doors open.  Cool dude says 'Enjoy your movie kid' and walks off with some of the staff to an elevator. \n\nMy mum grabs me and takes me to the desk for pur tickets and just as the elevator closes she says to me 'You do know who that was right?' I shook my head. No clue at all. \n\nTurns out it was Johnny fucking Depp. He must have been there for some meeting or something. (Fact is a central based cinema, film office and museum that deals with all sorts. Less big things these days but still used for a lot.) I was still only 11 so I had no clue what he looked like sans pirate outfit but my mind was blown. I pretty much spent the rest of the time we were there before the movie looking out for him. I think he might have gone to the top floor though (offices) so I never did but my mum was pretty in shock. She freaking loved that dude. \n\nTarzan 2 was pretty sick too btw. (Y)","isChecked":false,"level":2,"score":"199"},{"author":"TempusVenisse","body":"Lol your mom's reaction. She just stands there stunned and probably making a funny face while you casually chat with a movie star. I love it.","isChecked":false,"level":3,"score":"78"},{"author":"linuxthrowaway2020","body":"That's actually pretty cool. Were you in any of the shots? Was he good? :P","isChecked":false,"level":2,"score":"186"},{"author":"gloomy-burrito","body":"Ten minutes with Tony hawk on your tenth birthday! Say that ten times fast!","isChecked":false,"level":2,"score":"87"},{"author":"septicman","body":"I took my mother for a surprise trip to NYC.  She got married to my father there in '68.  The surprise was manufactured by way of telling her we were going to Australia (we live in New Zealand, so a trip to Australia is not a huge deal, it's the type of thing you could do for the weekend) and therefore she packed a bag and brought her passport.  We got to the airport and said \"Surprise! We're going to New York!\" and she cried her eyes out with delight.\n\nWhen we arrived, on our first morning, I said \"Okay, what do you want to do?\"\n\nShe said \"When I was last here, in 1968, the Twin Towers weren't complete, so, I'd like to go to the top of them.\"\n\n\"Your wish is my command!\" I said and off we went to the WTC.\n\nThat was the afternoon of September 10th, 2001.  Suffice it to say, there was a particular poignancy when we looked out the window at around 8am the next morning.","isChecked":true,"level":1,"score":"13276"},{"author":"toxickomquat","body":"Damn, that’s eerie! What was the aftermath like for you guys?","isChecked":false,"level":2,"score":"756"},{"author":"septicman","body":"Spooky. Anyone who was there at the time will remember three things that might not be obvious to anyone who wasn't. One, the smell. Everything smelt if burning for a full week. Two, the F16s in the air and law enforcement with automatic rifles everywhere. Three, the missing posters. The last of these I will never forget. It was heartbreaking. Every available surface was covered in missing posters. It brings a lump to my throat thinking about it even now.","isChecked":false,"level":3,"score":"1153"},{"author":"postcardsfromthec","body":"As a Native New Yorker, you described it so exactly. The only thing you’ve left out was desperately trying to contact everyone we knew to make sure they were okay, and trying to do a headcount of our extended network. Who’s cousin’s wife was downtown that day? Which friend’s niece’s fiancé was a first responder on duty? The waiting was agonizing, and hearing that calling waiting signal was awful. My dad worked for the MTA his entire career, and I remember that he didn’t come home that night, or the next. We had no idea where he was, because all transit supervisors had to work doubles and triples to support first responders. Hearing him come through the front door is probably the best sound I’ve ever heard in my life to this day.","isChecked":false,"level":4,"score":"912"},{"author":"Trotter823","body":"My first thought was why didn’t he just call you and tell you he had to....oh yeah...Cell phones hadn’t proliferated like that in 2001. It feels a very short and long time ago which is a weird sensation for me. What a relief that must’ve been!","isChecked":false,"level":5,"score":"95"},{"author":"solom_","body":"Wish you could see my chills","isChecked":false,"level":2,"score":"2475"},{"author":"AisisAisis","body":"Literal. Chills.","isChecked":false,"level":3,"score":"311"},{"author":"GammaAlphaYankee","body":"That’s crazy man, just imagine if your flight had been delayed one day.","isChecked":false,"level":2,"score":"152"},{"author":"piggybank124","body":"Once in college I applied for a job at the library help desk. I figured I would help people find books. Didn’t give it much more thought than that.\n\nDuring the interview, I aced all of the customer service questions. Then they asked me whether I knew how to defrag a hard drive. Cue alarm bells in my head, but I kept calm outwardly and said no, but you can teach me. \n\nI worked in IT for three years by accident. They were too nice to fire me.","isChecked":false,"level":1,"score":"16897"},{"author":"kalidava","body":"I made my last boss swear on her life she wouldn't call me for tech support. They call my cell when I'm sick in bed and ask how to reinstall the printer not a dang week later.","isChecked":false,"level":2,"score":"4493"},{"author":"LegalAdviceTA1979","body":"It's always the printers that get you.  You can be a 55 year old CTO, but when then CEO's printer stops working, you're the one who has to open it up and pretend like *anyone* knows how to fix a printer.","isChecked":false,"level":3,"score":"2470"},{"author":"linuxthrowaway2020","body":"Printers are the reason we have Free Software. Richard Stallman wanted to change the behavior of a printer and couldn't get access to the source code. So he went and started an entire social movement to ensure people could get and change source if they wanted to. Dedication!","isChecked":false,"level":4,"score":"941"},{"author":"LegalAdviceTA1979","body":"Bet he never fixed that printer though.  I swear we've been domesticated by printers.","isChecked":false,"level":5,"score":"218"},{"author":"linuxthrowaway2020","body":"    PC LOAD LETTER","isChecked":false,"level":6,"score":"130"},{"author":"aoyfas","body":"I found out my \"father\" wasnt my biological father in 10th grade Biology class.  We were learning about blood types and traits.  I raised my hand thinking I was a smart ass, \"You're chart isnt accurate, my dad has AB negative and I'm O positive.\" My teacher said \"I think your mom has some explaining to do!\".  And we all chuckled.\n\nTurned out, he was not my father.","isChecked":false,"level":1,"score":"7897"},{"author":"SayingAndUnsaying","body":"So how did that play out?","isChecked":false,"level":2,"score":"1552"},{"author":"aoyfas","body":"I came home and laughed about it to my mom.  Went to a friends house and got home around 8PM.  \n\nWhen I got home, my mom was waiting for me.  My mom had a stack of pictures on the foot  of my bed and told me \"that's your real father\".  Lol!  So that's how I found out.  I was actually ok with it.  The person I thought was my father was already kind of a loser dead beat.  Turns out my dad was also a loser deadbeat.  No loss I guess.  Would have been awesome if my dad would have turned out to be a decent human being.  So, tragic story....not a happy ending.  At least I can look back and laugh....kind of a funny way to find out?","isChecked":false,"level":3,"score":"3467"},{"author":"xkikue","body":"I just found out my abusive druct-addict bio father is actually not my father. My adopted dad is okayish, but kind of a fuck up as well. Ancestry DNA recently surprised me with a third (and actually biological) dad. This guy seems good and normal, and we have plans to meet when it's all good to fly again!","isChecked":false,"level":4,"score":"310"},{"author":"danielleteamtrinidad","body":"3rd dad’s the charm :)","isChecked":false,"level":5,"score":"262"},{"author":"Kaibethha","body":"A horse threw me in the air when I was a child. But I wasn’t on his back. He grabbed the skin of my back with his teeth and yeeted me.","isChecked":true,"level":1,"score":"6395"},{"author":"oldlittlegirl","body":"Asshole horses, l had one bite my back and stomp on me. My mum didn’t believe me till she saw the teeth marks later.","isChecked":false,"level":2,"score":"904"},{"author":"Kaibethha","body":"Ahh yes I got stomped by another horse a few years later, I feel you","isChecked":false,"level":3,"score":"123"},{"author":"staygold_pony_boy","body":"Why is \"yeeted me\" so damn funny?","isChecked":false,"level":2,"score":"141"},{"author":"Seve7h","body":"The first time I ever rode a horse I was probably 8 or 9, it was at a fair, horse ended up kicking me in the leg as soon the the guy in charge helped me up onto it, had that bruise for like a week even though it barely hit me, didn’t care much for horses after that.\n\nThen one day a few years ago my great uncle needed some help on his ranch, so we went up there to move some rocks that had messed up part of his fence. He had horses at his ranch and I was warned to never turn my back on any of the horses or they would attack, we had to keep shooing them away from us so we could work.\n\nSo here I am thinking horses are all just a bunch of assholes, when my step dad says “hey watch this” and takes a rag and ties it to one of the fence posts, the horses all froze up for second and then started freaking the fuck out and ran off. \n\nHe explained to me that horses aren’t assholes, they’re *stupid* assholes and will lose their shit at pretty much anything.","isChecked":false,"level":2,"score":"161"},{"author":"Txbi89","body":"my dad kidnapped me and took me to Singapore for very malicious purposes (i'm sure you could imagine). i was 15 and my dad literally had fake documents and suitcases filled with random clothes. when we got there we went to a sketchy hotel and after 15 minutes he went to the bar. a bit after that, some guy just walks in. i was confused but he began muttering saying i was 'too pale' and 'too old' and he left. i called my dad but he didn't answer so i climbed out through the window and went to the police. they put me on a plane home that same hour. \n\ni don't really tell people because it's a bit of a crazy story and sounds made up (hence why it's here) but yeh.","isChecked":true,"level":1,"score":"7416"},{"author":"UniversalFarrago","body":"Holy. Fucking. Shit.\n\nAre you ok?","isChecked":false,"level":2,"score":"2266"},{"author":"Txbi89","body":"yeh i'm totally fine. this was 2 years ago anyway and nothing has happened since it's just crazy to think about. the most fucked up thing to me is that my dad did it deliberately. it wasn't like this rando dude came into the wrong room, it was strategically timed. but yeh, thanks i'm all gucci now","isChecked":false,"level":3,"score":"2462"},{"author":"UniversalFarrago","body":"Is your dad in prison now? He should be","isChecked":false,"level":4,"score":"725"},{"author":"Txbi89","body":"unfortunately not but he's been charged with something (i'm not allowed to know because i'm not 18 which is bs) and he's allowed monitored visits with my siblings and I (my siblings have to go by law and I get a choice bc i'm 17) but yeh.","isChecked":false,"level":5,"score":"1007"},{"author":"UniversalFarrago","body":"Wow. What the fuck. He shouldn't be allowed within 40 feet of a minor, at minimum. Glad you're okay, though. Hopefully your father will get what's coming to him.","isChecked":false,"level":6,"score":"976"},{"author":"Txbi89","body":"yeh hopefully. thanks though, my close friends know about this and it's awkward to explain sometimes so it's good to vent to a stranger.","isChecked":false,"level":7,"score":"351"},{"author":"YellowMinx","body":"“Too old” is such a haunting thing to save your life. I’m so glad you’re okay. What happened to your father?","isChecked":false,"level":2,"score":"118"},{"author":"milkbong420","body":"I sneeze when I think of sex. Every. Single. Time. \n\nMy wife likes to give me shit if I just sneeze innocently. She thinks she's a riot.\n\nEdit: judging by all the \"me too\" comments, this isn't as unheard of as I thought.\n\nIf you sneeze because of sex, don't worry you're still a freak, but you're not alone.","isChecked":true,"level":1,"score":"5700"},{"author":"dadlit47","body":"Now you wife gets turned in by people sneezing. Reverse card.","isChecked":false,"level":2,"score":"1408"},{"author":"Connie-the-Jellyfish","body":"Me too. It's the same mechanism as when some people sneeze from sunlight. It's because the sneeze  controlling part of your brain is too close to the sex part, which results in the sex thoughts accidentally setting of a sneeze.","isChecked":false,"level":2,"score":"308"},{"author":"milkbong420","body":"Thought I was the only one haha.","isChecked":false,"level":3,"score":"108"},{"author":"TypicalPakeha","body":"It's a super real thing but massively under reported. It's actually a bit of an enigma in the medical community, no one really understands it properly due to the huge lack of data\n\nhttps://en.wikipedia.org/wiki/Sexually_induced_sneezing","isChecked":false,"level":4,"score":"88"},{"author":"Sissinou","body":"\"honey we're going to visit my mother this week\"\n\n*atchooo*","isChecked":false,"level":2,"score":"155"},{"author":"alaena_moon","body":"My husband (I’m 30), has been my best friend since I was 7. He was the new kid at school and I walked up to him and said, “we are going to be best friends”. He said, “no we aren’t. Leave me alone.” I bugged him every day for two weeks before he finally said, “if I’ll be your friend, will you shut up about it?” We were married 20 years later. Proved his ass wrong. 😂","isChecked":false,"level":1,"score":"2117"},{"author":"TimmeyTheTurtle","body":"And that kids, is how I met your mother","isChecked":false,"level":2,"score":"300"},{"author":"thisisdavecass","body":"I once won a $500 raffle during a routine visit to my local tea shop.\n\nIt was the building's annual Black Friday event and there were 5 baskets with varying amounts of goods, services, and coupons. I needed tea, so my only stop was the tea shop. It cost me $20 to fill my tins, but they said raffle tickets were given out after a $25 purchase. I said 'fuck it' and got a hot tea for me and the woman in line behind me.\n\nEntered with that one ticket. I got a call a few days later saying I won the top prize basket. When I went to claim, they asked about my purchases. I told them and they said the drawings had over 1,000 tickets and many people had over a dozen entries.\n\nThe raffle prize included $25 to the tea shop.","isChecked":false,"level":1,"score":"9167"},{"author":"UnauthorizedGoat","body":"I once won an expensive blanket in a raffle at work.   The raffle was for charity and they bugged me to enter so I bought one, one dollar ticket while all the older work ladies bought five or ten because they really wanted the blanket. I was the only person at the department store who only bought one ticket. (This was in the early 90s and I was only making $4.10 an hour 20 to 25 hours a week and that dollar came out of my gas money).\n\nThe day of the drawing I sat in the break room and as I passed by the blanket I thought, \"I better not forget to take that home tonight\". I snorted in disbelief at the silly thought and went off to do work.  A couple hours later I was informed that I had won the blanket and yes, I was freaked out and yes, I remembered to take it home.","isChecked":false,"level":2,"score":"2428"},{"author":"sadahgreen","body":"So cool that you knew it would be yours before you even won it","isChecked":false,"level":3,"score":"121"},{"author":"OverallDisaster","body":"I won a $500 dress for my prom. I had fallen in love with one specific dress in a catalog I got in the mail but it was way too expensive, so I was prepared for a cheap Penny's dress for <$100. The company that made the dress I wanted hosted a giveaway where you could pick any one of their dresses, and I won! It felt like a dream.","isChecked":false,"level":2,"score":"95"},{"author":"Waterboardyourkids","body":"Spent a really cool day in London with Christian Slater and his mum. His mum is adorable.","isChecked":false,"level":1,"score":"8397"},{"author":"dontaskmeforfeetpics","body":"Christian Slater is adorable as well.","isChecked":false,"level":2,"score":"3156"},{"author":"Maiesk","body":"My parents decided not to go out to the pub one night when we lived in the Isle of Man. When they went there the next night all anyone was talking about was how awesome it was that Christian Slater was there the night before.","isChecked":false,"level":3,"score":"167"},{"author":"ravenpotter3","body":"One of my ancestors was dumb and bought one of Napoleon’s doorknobs. It turns out it’s fake. Doorknobs were invented after Napoleon died.","isChecked":false,"level":1,"score":"19275"},{"author":"94rellic","body":"I'm intrigued by the fact that this is the story that your family decided to pass on from one generation to the next far enough to lose track of the relation and just refer to the subject as \"ancestor\".","isChecked":false,"level":2,"score":"6542"},{"author":"Awe101","body":"Man I would really hate it if my great^14 grand children had a story like this about me.","isChecked":false,"level":3,"score":"3594"},{"author":"Exzodium","body":"See your ancestor had this holographic Charzard....\n\nKid: Say no more Gram Gram...","isChecked":false,"level":4,"score":"116"},{"author":"Ohpoorcicero","body":"This is honestly my favorite response.","isChecked":false,"level":2,"score":"1217"},{"author":"s_c_w","body":"Huh, I know someone who bought Napoleon's hair. It keep with a certificate of authenticity but turned out to just be one tiny single hair.","isChecked":false,"level":2,"score":"224"},{"author":"0dineye","body":"I was a rocket scientist\n\nI worked on the 114-AGM. The science was 'verifying' rocket bodies. The back bone of science is to repeat experiments. My job was to make sure we were gonna get the same result every time. \n\nPeople call me a liar all the time because the idea of a 'rocket scientist' is Von Bruan.","isChecked":false,"level":1,"score":"1284"},{"author":"imaterriblemother","body":"I've been stabbed 8 times\n\nEdit: this is a fairly new account so I'm prepared to identify myself\n\nhttp://www.scotland-judiciary.org.uk/mobile/8/2139/HMA-v-Fernando-Carrasco-Dos-Santos-and-Ruben-Goncal-Ves-Semedo-Correia\n\nhttps://www.google.com/amp/s/www.eveningtelegraph.co.uk/fp/i-am-a-bit-of-a-mess-dundonian-left-with-ptsd-and-blind-in-one-eye-by-knife-thugs-in-attempted-murder-at-perth/amp/\n\nEdit:\n\nI didn't get the chance to tell my story in court as they pled guilty before I was called. I was drunk and I came out the pub I was in to get some fresh air. I walked past 3 guys and one of them asked me for a cigarette. I told him I don't smoke and he became immediately aggressive. I argued with him for a while and his friends started shouting at me and threatening me. At this point he kind of disappeared behind me. One of the others showed me a knife so I turned and walked away. I knew they were following me as was walking back to the pub. I had a bus stop on my left hand side and a building on my right. I looked up and saw the first guy walking towards me. It was fight or flight and I had nowhere to fly to so I decided that attack was the best form of defence. I think I managed one punch before the 3 of them jumped me. They had been robbing and beating up people all over town for about 2 weeks beforehand.","isChecked":false,"level":1,"score":"15717"},{"author":"iknowthisischeesy","body":"Please tell me it has nothing to do with your username.","isChecked":false,"level":2,"score":"11389"},{"author":"tomatoaway","body":"Kids amirite","isChecked":false,"level":3,"score":"6195"},{"author":"dmcleod94","body":"In my day we walked to school up hill both ways while being stabbed 8 times","isChecked":false,"level":4,"score":"151"},{"author":"Jamon_User","body":"In the snow. Backwards.","isChecked":false,"level":5,"score":"74"},{"author":"TheRetroGamer547","body":"At once?  Or on separate occasions","isChecked":false,"level":2,"score":"1745"},{"author":"ihitrockswithammers","body":"\"Try not to get stabbed on the way to the parking lot\"","isChecked":false,"level":3,"score":"1540"},{"author":"cetacean-sensation","body":"\"In a row???\"","isChecked":false,"level":4,"score":"100"},{"author":"HoldMyCross","body":"Ouch. Care to explain details?","isChecked":false,"level":2,"score":"513"},{"author":"Deceus1","body":"Nasty kitchen accident involving 2 forks.","isChecked":false,"level":3,"score":"794"},{"author":"Crazyviclol","body":"I got hernia by sneezing too hard.","isChecked":false,"level":1,"score":"20234"},{"author":"Diesel_Daddy","body":"I got mine trying to match my wife's pregnant belly.\n\n*pop*","isChecked":false,"level":2,"score":"13991"},{"author":"Crazyviclol","body":"I feel sorry for laughing, what a way to get it.","isChecked":false,"level":3,"score":"6774"},{"author":"Diesel_Daddy","body":"You're telling me!  I've done so much stupid shit in my life, and *that's* what earns me a Dr visit?","isChecked":false,"level":4,"score":"721"},{"author":"Wrastling97","body":"My girlfriend is skinny as hell and always calls herself fat so I like to stick my stomach out as far as I can (I’m muscular with 0 gut) and I always have to push really hard. I’m never doing that again after reading this. It’s the “pop” that got me","isChecked":false,"level":5,"score":"338"},{"author":"Diesel_Daddy","body":"Dude, that's exactly it, I was pushing to match my 7 mos preggo wife. I'm a bigger guy, but not Dunlap fat.  $2500 surgery and a 6 week recovery to look forward to.","isChecked":false,"level":6,"score":"215"},{"author":"Anonymous18650","body":"> $2500 surgery and a 6 week recovery to look forward to\n\nfuuuuuuuuuuuck","isChecked":false,"level":7,"score":"101"},{"author":"drh0tdog","body":"When I was a kid, I woke up to find my cat giving birth to her kittens on my pillow, one inch from my face. I took it as a compliment.","isChecked":true,"level":1,"score":"26739"},{"author":"kalidava","body":"It totally is. That's like the cat Congressional Medal of Honor.","isChecked":false,"level":2,"score":"13502"},{"author":"XC_Griff","body":"Right!? If a cat closes its eyes around you it means it trusts you, but if it fuckin births kittens inches from your face you must be like family.\n\nEdit: I should include sleeping as well.","isChecked":false,"level":3,"score":"6136"},{"author":"alematt","body":"The Olive Garden, \"When the cat gives birth near yah face, you're family.\"","isChecked":false,"level":4,"score":"440"},{"author":"brawlingharbor8","body":"That's so sweet, must mean she really trusted you! My cat went into labor at 4:00 in the morning when I was in highschool. She had licked my leg until I woke up and followed her to her nest so that I could be there and comfort her while she had her three beautiful kittens","isChecked":false,"level":2,"score":"851"},{"author":"RedditDiditGotTshirt","body":"That is so damn beautiful!","isChecked":false,"level":3,"score":"122"},{"author":"Almondxxx","body":"My cat did this too if I remember. I came home from school and she kept meowing in her bed.\n\nI went over to her and I was like dang she’s about to have kittens lol.\n\nRip kitty, she died a year ago :(","isChecked":false,"level":3,"score":"101"},{"author":"RedTreeko","body":"Dude that means your cat has the utmost trust of you.","isChecked":false,"level":2,"score":"840"},{"author":"Jucoy","body":"Not only did it feel safe around op, but it probably actively expected him to fend of predators.","isChecked":false,"level":3,"score":"176"},{"author":"lahttae","body":"This happened to me also! Once with kittens and another time diarrhoea. The kittens one wasn’t my cat though, the poop one was","isChecked":false,"level":2,"score":"206"},{"author":"drh0tdog","body":"What a rollercoaster this comment has been","isChecked":false,"level":3,"score":"154"},{"author":"chandlrs","body":"My grandpa left his royal status to marry my grandma.","isChecked":false,"level":1,"score":"10978"},{"author":"dontaskmeforfeetpics","body":"Who's your grandpa?","isChecked":false,"level":2,"score":"4588"},{"author":"LucioTarquinioPrisco","body":"Prince Harry. He's from the future.","isChecked":false,"level":3,"score":"9144"},{"author":"meow_747","body":"Harry, you're a prince!","isChecked":false,"level":4,"score":"442"},{"author":"AdolfKoopaTroopa","body":"I'm not a prince Hagrid, I'm just Harry!","isChecked":false,"level":5,"score":"260"},{"author":"None","body":"[deleted]","isChecked":false,"level":3,"score":"2726"},{"author":"saahiir","body":"It's definitely Saudi royal family","isChecked":false,"level":4,"score":"489"},{"author":"WideMistake","body":"Sounds it. Plus the hint at there being numerous people in line.","isChecked":false,"level":5,"score":"267"},{"author":"saahiir","body":"Yeah, and negative opinion of people regarding the royal family","isChecked":false,"level":6,"score":"204"},{"author":"SimmerSassenach","body":"My great great grandfather was a Pinkerton Detective, acted on Vaudeville, and had 5 wives in 2 different states that knew nothing of each other. He also slightly changed his last name each time and never got caught until Ancestry website happened lol","isChecked":false,"level":1,"score":"16628"},{"author":"bread_cats_dice","body":"Sounds a bit like my great grandfather. He had a wife in France, and then 2 in the US in neighboring counties. He was caught tho. My great grandmother was wife #2, she found out about wife #3 and divorced him. No one knew about the first wife in France until I pulled his service records from WWI.","isChecked":false,"level":2,"score":"5232"},{"author":"DoMoreWork","body":"Please tell me how to pull service records from WWI. I would love to see what my grandfather was up to back then. TIA","isChecked":false,"level":3,"score":"169"},{"author":"bread_cats_dice","body":"I did this research in 2008. I believe I had to write to the National Personnel Records Center a few times. First request was under his final name. I had to provide information about the bloodline, etc. A month or two later I got a letter saying there were no records for that name for that time period. Some more research in church/local records indicated he had legally changed his name in the 30s to get rid of the stigma of a German name, so I had to submit a second request under his birth name. He’d lied about his age to enlist, which made it a little more difficult as well. He was just shy of 15 when he enlisted, and 16 when his plane was shot down in France. When his records picked back up, it indicated he was married and listed a local church. Unfortunately I don’t speak French so that’s where the rabbit trail ended.","isChecked":false,"level":4,"score":"172"},{"author":"Chri5ti4n733","body":"Did he ever encounter vanderlinde or o’driscoll gangs?","isChecked":false,"level":2,"score":"1845"},{"author":"Kanin_usagi","body":"Just one big score and then it was off to Tahiti","isChecked":false,"level":3,"score":"149"},{"author":"5H_n_DBH","body":"harvestin’ mangoes in tahiti","isChecked":false,"level":4,"score":"79"},{"author":"TonyRonyPhony","body":"Damn O’Driscolls","isChecked":false,"level":3,"score":"369"},{"author":"Firewolf420","body":"O'Driscoll's are just a bunch of savages anyhow","isChecked":false,"level":4,"score":"91"},{"author":"Mattzorry","body":"I have A PLAN!","isChecked":false,"level":3,"score":"70"},{"author":"Kongtron1","body":"Have you ever heard of the legend of Dutch Van Der Linde?","isChecked":false,"level":2,"score":"141"},{"author":"Bitter-Basket","body":"In Minnesota in the 70's, I was sixteen taking my drivers test.  Nervous as hell.  A highway patrol officer was the \"road tester\" back then which was even more nerve wracking.  But I thought I was doing pretty good the whole time because I had lots of practice with my parents. \n\nTHEN towards the end of the driving test, I was at a \"T\" intersection across from a hospital, I was hesitant to turn onto the road because traffic was busy.  I could tell the officer was getting a little impatient, but he was nicely telling me to be a little aggressive.  Suddenly at the hospital across from us, someone pushed out a screen from a window on the third floor (psych ward).  A women jumped out the window onto a garage roof underneath, then jumped to the ground and ran across the road right by us.  \n\nThe officer had me turn around (I was in my mom's car) and chase the girl in the neighborhood.  When I would pull up to a stop sign during the chase, he would say \"GO GO GO, JUST GO THROUGH IT\".  After awhile, when she started to get away, he gave up with me being the \"chase driver\" and told me to head back to the DMV office.  I was a complete shaking mess at this point - ready to accept the fact I would not get a license anytime soon (devastating for a sixteen year old boy).  He grabbed my score sheet.  Said \"You passed.\"   And handed it to me.  I got an 88 score.  He ran to his HW patrol car and tore off to continue the chase. \n\nI go in the office a complete mess.  My Mom was already really nervous because we were gone so long, then she saw me looking like a ghost.  She said \"WHAT HAPPENED\".  Told her I passed, then told her the story on the way home.  She wasn't amused and pretty pissed at the highway patrol guy.  When I tell the story, I say \"No BS, just ask my Mom.\"","isChecked":false,"level":1,"score":"466"},{"author":"SpaceManBalls83","body":"At age 50 odd and with limited to no video game experience, my mother completed Mario64 before I did, in about half the time it finally took me to do it.","isChecked":false,"level":1,"score":"28210"},{"author":"Pakeeda","body":"\"Git gud, sweetie\"","isChecked":false,"level":2,"score":"15446"},{"author":"DJ-spetznasty","body":"*kisses forehead*","isChecked":false,"level":3,"score":"5633"},{"author":"Lean_Mean_Threonine","body":"*drags an actual teabag across your face* \n\n\"Isn't this what the kids these days do, darling?\"","isChecked":false,"level":4,"score":"351"},{"author":"Ninjya_Bakon","body":"My brother is 31 (I’m 19) and when he was born his grandmother (we don’t share the same father) bought him a NES. My mother, not knowing what to do with it, turned it on and played Super Mario Bros. She spent two months every day trying to beat the game, even buying a strategy guide to go through it. She beat the game and never touched a video game again.","isChecked":false,"level":2,"score":"6584"},{"author":"Zumvault","body":"My mom bought my brother and I a Sega, then every night after we went to bed she would play Sonic.\n\nAs a kid I thought she just loved playing games, as I got older I realised she only did it so that when we asked her for help she would be able to.\n\nA few years ago for her birthday I got her a Sega with Sonic and Sonic 2.\n\nI bought everything from the Sonic edition Sega (just the box, no special skins back then) and everything that came in it. I spent months getting every individual piece including the books and I had to buy nearly everything separately because they aren't exactly producing them anymore and people didn't exactly stock up on them as collectibles back in the day.\n\nBy her birthday I had it all assembled, some of it nearly in tatters due to age and wear and tear but I did it.\n\nShe loved it, and then about a month later I saw the full set in near pristine condition for sale on eBay (not her or her's) and for about a tenth of what I had paid to assembled my mom's tattered set.\n\nStill the favorite gift I've given.","isChecked":false,"level":3,"score":"3216"},{"author":"boswell_rd","body":">As a kid I thought she just loved playing games, as I got older I realised she only did it so that when we asked her for help she would be able to.\n\nAww, this is so beautiful and so incredibly moving.","isChecked":false,"level":4,"score":"329"},{"author":"outstanding_outcast","body":"I lost my heel in a lawn mower accident\n\nEdit: Here's the story\n\nI was 4 at the time and I wont say who exactly did it. But he was mowing and it was a riding mower and the hitch on the back where you can hook a little trailer, I loved to stand on that part and ride. Well this time I saw a frog in the grass and being the 4 year old I was at the time, I jumped off the mower and onto the grass and put my hands over the frog to catch it and he didnt realize I had jumped off and he backed up.","isChecked":true,"level":1,"score":"8809"},{"author":"dontaskmeforfeetpics","body":"JFC That sounds very unpleasant. \n\nWhat happened exactly?","isChecked":false,"level":2,"score":"5517"},{"author":"MidvalleyFreak","body":"No offense but I think he just earned your username, lol","isChecked":false,"level":3,"score":"8943"},{"author":"JohnLayman","body":"At least now you have no weakness.","isChecked":false,"level":2,"score":"111"},{"author":"mrsmayne2018","body":"Jesus, these stories are terrifying. \n\nWe lost my cousin when he was 6 years old. He fell off the back of the mower and my uncle didn’t realize. I don’t think my family will ever get over that. He wasn’t as lucky as you.","isChecked":false,"level":2,"score":"104"},{"author":"GravyxNips","body":"This made me shiver","isChecked":false,"level":2,"score":"277"},{"author":"Sirnando138","body":"I bought a guitar amp from Brad Whitford, of Aerosmith, when I was 17. He and Steven Tyler served up cheeseburgers for me and my friends.\n\nEdit: as requested:\n\n\nSo, Brad’s son was a punk and I knew him from the scene. I was in a band that had some small local marginal success. This is 97/98 in Boston. I needed a new amp for our first US tour but had very little money. I was getting drunk with his son and, on a whim, I asked him if his dad had any amps laying around that he didn’t need. We laughed and carried on partying. \n\nThe next day, I get a call at my home. It was Mr. Whitford himself. He was super nice but to the point. “My son says you got a band and need a good rig for your les Paul. I have something in mind for you. Just gotta have my guy get it from the warehouse. Come by my house in Norwell this weekend and check it out”. That was the gist of the call. Obviously, the whole band came with me. And our roadie. \n\nWe get to his house and it’s totally him. So weird. These guys were like gods in Boston. I wasn’t the hugest fan but knew him from his work with Wayne’s World. He takes me to (one of) his garage(s) where there is this cool full stack. The brand is Bedrock. An old company from New Hampshire that made good quality amps in the 80’s. This one was custom made for Brad. Basically Marshall components. 4 tubes. All the knobs go to 11. Not kidding. Still has the “property of Aerosmith” stickers on it. He plugs it in and rips a crazy solo on his les Paul and then hands it to me and I play a couple power chords. He asks for $300 for the whole thing. I pay him and he tells his son to give us a tour of the house. \n\nThis is where shit gets nuts. It’s just like you expect. Tons of gold records, platinum records...Pictures of him with people like John Lennon, Robert DeNiro and Joey Ramone. Then we get to see his studio and THE LARGEST COLLECTION OF MARSHALL AMPS IN THE WORLD. Seriously, like 200 cabs. A wall of guitars. Guitars so pretty and amps so cool, it made sense for him to find the one he sold me dispensable. \n\nAfter the house tour, he told us to meet him at the little bar and grill they own in town. When we get there early and he arrives 30 mins later with muthafuckin Steven Tyler in tow. “You guys the punk group?!” He was so nice. They went in the back and came out with burgers for us all on the house. Then they straight up left. Irish goodbyed, even! I still have the amp. I used it on the road for almost 10 years in five bands. Now, it’s just a conversation piece. But it still works! I’ll crank her up every now and then.\n\nEdit 2: pics. \n\nhttps://i.imgur.com/2q8mT6W.jpg\n\n\nhttps://i.imgur.com/iyi05AY.jpg","isChecked":false,"level":1,"score":"23143"},{"author":"mepeeonu","body":"The fact that they just dipped without saying anything makes this story x2 cooler for me for some reason","isChecked":false,"level":2,"score":"1430"},{"author":"SmashMcGee","body":"“he hands it to me and i play a couple power chords” had me rolling. The hallmark of being a young punkass in a band. Brings back a lot of memories.","isChecked":false,"level":2,"score":"618"},{"author":"Sirnando138","body":"Dude. It was so embarrassing. He played this crazy BB King style thing and played a D into a G.","isChecked":false,"level":3,"score":"372"},{"author":"SunEyedGirl3","body":"I met Steven Tyler 3 times as a kid. He had a house in Marshfield MA where I grew up. He is super nice! Met him once at cvs, one at the grocery store, and once at the circus where his daughter was riding an elephant. He actually sang to me in the grocery store before his wife told him they had to go and dragged him away. My name is Jennifer, but I used to go by Jenny as a kid. He sang \"Jenny's got a gun\" to me. I was probably like 5 or 6, but I still remember it. I also used to hide behind paper towel and toilet paper displays in the grocery store as a kid. I'd pop out and scare people because I thought it was funny. I once popped out on the drummer from Aerosmith and he was pissed. Sweared at me and walked away, haha.","isChecked":false,"level":2,"score":"131"},{"author":"otelroc","body":"You could have just said that you bought a bedrock amp for 300 bucks and I wouldn't have believed it","isChecked":false,"level":2,"score":"88"},{"author":"JWRealtor","body":"Details please! What amp? When/where was this? I'm a rock nerd and stuck at home for the normal reasons. Please indulge me with a grand and mostly true story.\n\nEdit: Thank you for the story! My highest voted comment is requesting a story about one of greatest American rock bands ever and my request was granted and I'd have it no other way. Super cool you still have the amp. I'm jealous and hungry for cheeseburgers now. Probably gonna turn on ROCKS and spray weeds in my lawn after the daily Trump ramblings. God, I'm getting old.","isChecked":false,"level":2,"score":"1969"},{"author":"Sirnando138","body":"So, Brad’s son was a punk and I knew him from the scene. I was in a band that had some small local marginal success. This is 97/98 in Boston. I needed a new amp for our first US tour but had very little money. I was getting drunk with his son and, on a whim, I asked him if his dad had any amps laying around that he didn’t need. We laughed and carried on partying. \n\nThe next day, I get a call at my home. It was Mr. Whitford himself. He was super nice but to the point. “My son says you got a band and need a good rig for your les Paul. I have something in mind for you. Just gotta have my guy get it from the warehouse. Come by my house in Norwell this weekend and check it out”. That was the gist of the call. Obviously, the whole band came with me. And our roadie. \n\nWe get to his house and it’s totally him. So weird. These guys were like gods in Boston. I wasn’t the hugest fan but knew him from his work with Wayne’s World. He takes me to (one of) his garage(s) where there is this cool full stack. The brand is Bedrock. An old company from New Hampshire that made good quality amps in the 80’s. This one was custom made for Brad. Basically Marshall components. 4 tubes. All the knobs go to 11. Not kidding. Still has the “property of Aerosmith” stickers on it. He plugs it in and rips a crazy solo on his les Paul and then hands it to me and I play a couple power chords. He asks for $300 for the whole thing. I pay him and he tells his son to give us a tour of the house. \n\nThis is where shit gets nuts. It’s just like you expect. Tons of gold records, platinum records...Pictures of him with people like John Lennon, Robert DeNiro and Joey Ramone. Then we get to see his studio and THE LARGEST COLLECTION OF MARSHALL AMPS IN THE WORLD. Seriously, like 200 cabs. A wall of guitars. Guitars so pretty and amps so cool, it made sense for him to find the one he sold me dispensable. \n\nAfter the house tour, he told us to meet him at the little bar and grill they own in town. When we get there early and he arrives 30 mins later with muthafuckin Steven Tyler in tow. “You guys the punk group?!” He was so nice. They went in the back and came out with burgers for us all on the house. Then they straight up left. Irish goodbyed, even! I still have the amp. I used it on the road for almost 10 years in five bands. Now, it’s just a conversation piece. But it still works! I’ll crank her up every now and then.","isChecked":false,"level":3,"score":"2709"},{"author":"hamsolo19","body":"Awesome, dude. One of the coolest things I've read on this website.","isChecked":false,"level":4,"score":"407"},{"author":"Sirnando138","body":"It’s definitely in my top 5 stories.","isChecked":false,"level":5,"score":"134"},{"author":"Kraz3","body":"What a life you've lived that this isn't the top story holy shit.","isChecked":false,"level":6,"score":"99"},{"author":"Decent_Tennis","body":"Long time lurker but I just made an account to comment here. You should edit this into your original comment. This is by far the coolest story on this thread! Wish I could give you gold!","isChecked":false,"level":4,"score":"94"},{"author":"LastOfTheCamSoreys","body":"I had my tongue surgically enhanced for more reach and flexibility when I was 8\n\n\n\nEdit: I’m super jazzed by how many of us are out there!","isChecked":false,"level":1,"score":"13234"},{"author":"big_mama_blitz","body":"Interesting. Ive never met anyone that has had their tongue clipped. Had mine done as a toddler and I guess they sort of overshot the mark because I ended up with a Gene Simmons style.","isChecked":false,"level":2,"score":"4462"},{"author":"LastOfTheCamSoreys","body":"Yeah mine was bad enough that I couldn’t really reach the back of my upper front teeth so L’s were a particular issue until I had it done","isChecked":false,"level":3,"score":"1932"},{"author":"JeeEyeElElEeTeeTeeEe","body":"Lingual frenectomy. I could never bring myself to get it, so my tongue’s a bit of an underachiever","isChecked":false,"level":2,"score":"88"},{"author":"GotMyOrangeCrush","body":"I once drove a locomotive backwards through the Canadian Rockies.","isChecked":false,"level":1,"score":"5266"},{"author":"ShibertInu","body":"A pelican engulfed my head with its massive fucking beak when I was a small child. Pelicans are cunts.","isChecked":true,"level":1,"score":"37113"},{"author":"BabaxGanoosh","body":"Pelicunts","isChecked":false,"level":2,"score":"20697"},{"author":"Chriogenosis","body":"Having lived around pelicans, I can confirm this.\n\nAlso, I'm sorry, I know that most have been traumatic....but I am laughing so hard right now after reading this. Because I'm imagining a pelican trying to eat a child's head. Like I am actually in tears from your comment making me laugh so hard.","isChecked":false,"level":2,"score":"7033"},{"author":"ShibertInu","body":"It was super terrifying for little me at the time but it makes for a great story now so it's not all that bad.","isChecked":false,"level":3,"score":"2948"},{"author":"Icehawk4","body":"I can smell some illnesses and chronic symptoms. My sense of smell is normally pretty average, but I can sometimes smell if a person is sick before they start showing symptoms, and have been able to identify/predict 2 seizures, a diabetic blood sugar drop, and multiple chronic migraines before they happened.","isChecked":false,"level":1,"score":"6275"},{"author":"loCAtek","body":"Are you a service dog?","isChecked":false,"level":2,"score":"5390"},{"author":"Icehawk4","body":"No, but if I could actually work as a service dog that would be freakin awesome","isChecked":false,"level":3,"score":"2407"},{"author":"core-void","body":"Someone else mentioned the super-taster thing.  There are jobs in the food industry, probably others too, where super senses like that are in high demand.  You ever look into it?","isChecked":false,"level":4,"score":"279"},{"author":"Icehawk4","body":"I've heard of that kind of thing before, like a guy who could smell cyanide being employed by a police force to identify cyanide poisonings, but I've never really looked into it. I'm still in college at the moment, so I really don't know what I'm gonna do with my life, something using this trait could be a good backup plan if I end up not being able to decide or want something new.","isChecked":false,"level":5,"score":"137"},{"author":"rawrberry_","body":"I have won an actual WWE match.  \nedit:  \nFor everyone that is asking. I did not have a stage name. It was a one time deal. It was during the 2006 Tribute to the Troops. The guy I faced was Chris Masters.  \n[Proof](https://www.youtube.com/watch?v=EhAz5Ul41o8)  \nObviously I am the dude in uniform. My hair is not as beautiful as it is now. It was short because I was in the Army.","isChecked":false,"level":1,"score":"8681"},{"author":"danny_2332","body":"My dad grew up with Shawn Michaels idk if thats how he spells his first name or not","isChecked":false,"level":2,"score":"1586"},{"author":"scienceismydogma","body":"Did your Dad say what he was like?","isChecked":false,"level":3,"score":"315"},{"author":"danny_2332","body":"After he got real big with wrestling he became a different person really drugs snd what not but his mom is a total sweetheart i can confirm that much","isChecked":false,"level":4,"score":"388"},{"author":"scienceismydogma","body":"Interesting. Seems like his real personality was similar to his WWF personality.","isChecked":false,"level":5,"score":"107"},{"author":"BlueHorseshoe614","body":"Holy shit, I was there!!! Thats right in front of Al-Faw palace in Dec 06. I remember that happening. I think that’s the MNF-I patch you’re wearing. I was with 303rd MI BN and attached to MNC-I in the CACE inside the palace from 08/06-10/07. \n\nFun fact: The exact spot where the ring is, was rocketed on 09/11/2007 by several 240mm Katyusha rockets. Their way of reminding us of 9/11 and celebrating. I believe it killed 13, and wounded 30ish. Mostly TCN’s, but my commander got torn up pretty bad from it; a piece of shrapnel entered at his wrist and went right up his arm exiting at his tricep. They saved his arm but its basically the Terminator arm now. I had walked across that spot maybe 90 seconds earlier. Scary what would be the numbers if it hit that day. 240mm’s were remarkably rare because it was obvious they came from outside countries help (cough cough fuck you Iran). Those fuckers are some 6-7 feet tall and weigh hundreds of pounds; have to be launched off trucks or vehicles. The explosion of those things is terrifying, especially when close. \n\nHope you’re doing well, congrats on the undefeated WWE career.","isChecked":false,"level":2,"score":"97"},{"author":"Manford_Munchbox","body":"Against who?","isChecked":false,"level":2,"score":"72"},{"author":"Ignatz27","body":"I won two TV game shows. \"The $10,000 Pyramid\" (won $10,300) in 1975, and \"Sale of the Century\" (was on the show for 9 days; won $34k in cash and prizes) in '85.","isChecked":true,"level":1,"score":"35388"},{"author":"clit-eastwould","body":"Who was the celebrity guest you played with on PYRAMID?\n\nAnd what was he/she like?","isChecked":false,"level":2,"score":"545"},{"author":"Ignatz27","body":"My first round was with Michelle Lee (Knotts Landing on 70s TV); she was very pleasant. She helped me win $300. Gary Berghoff (Radar on MASH; also 70s), was terrific. He helped me win the $10k. We actually had a further encounter about a year later, on a Hartford, CT, local morning TV show. Very nice guy.\n\nI also had a (less than pleasant) encounter with Dick Clark himself. I won't bother with the details.","isChecked":false,"level":3,"score":"380"},{"author":"Bluest_waters","body":"> I won't bother with the details.\n\ndetails is literally what we are all here for, lol","isChecked":false,"level":4,"score":"275"},{"author":"Pocket_MonSTAR8","body":"He played with this one dude who said, “Paper! Snow! A ghost!” multiple times.","isChecked":false,"level":3,"score":"754"},{"author":"dontaskmeforfeetpics","body":"Nice. I've never won anything in my life.","isChecked":false,"level":2,"score":"34343"},{"author":"s_c_w","body":"Now you have :)","isChecked":false,"level":3,"score":"13301"},{"author":"Bugsy0508","body":"Awww that’s so fuckin sweet","isChecked":false,"level":4,"score":"3639"},{"author":"insertstalem3me","body":"I even lost at the genetic lottery","isChecked":false,"level":3,"score":"691"},{"author":"W_Rooshing","body":"I was born 12 weeks early (and was nearly born earlier- my mom had a weak uterus from endo, so they had to push me back and stitch her up). \n\nThe doctors told my parents to expect me to be unable to breathe, walk, etc on my own. The doctor performing the c-section nearly dropped in surprise and how hard I was screaming and flailing.\n\nI do have a few health problems, but it could have been much worse.\n\nEditing since others are mentioning their experiences and health issues:\n\nI had hydrocephalus, it was treated poorly (the doctor thought I was fine, and my parents were overreacting when I was seizing and turning colors). It was treated, and now had ~6 ft of tubing in the form of a shunt, as well as seizures I'll never outgrow. They're treated with medication.\n\nOtherwise, outside asthma and other smaller things, I live a normal life. I graduated high school a few years ago, and hope to be married soon.\n\nEdit 2: Thank you everyone for your stories! Tbh, I'm a bit overwhelmed: I didn't expect my comment to blow up like this! I'm going to do my best to respond to everyone, but I apologize in advance if I don't. I promise I'm reading every comment, and they all mean so much!","isChecked":false,"level":1,"score":"8954"},{"author":"skullkid00","body":"I'd just imagine that baby screams translate to \"put me back fuckers. You did it once, you can do it again.\"","isChecked":false,"level":2,"score":"3731"},{"author":"themrs0830","body":"Right there with you! I was born 14 weeks early and was told I probably wouldn’t make it or I’d be blind. I can see although I have a really strong prescription and no heath problems. Micropreemies unite!","isChecked":false,"level":2,"score":"159"},{"author":"Coolinee--Kerman","body":"i definitely read that as \"micro peenies\"","isChecked":false,"level":3,"score":"148"},{"author":"sierra-_-charlie","body":"Arrested and spent three days in a holding cell for a crime that I didn’t commit; about a year after the whole matter was done and dusted with.\n\n\nMind you. I say didn’t commit the crime.\nBut I was involved in the story from start to finish.","isChecked":true,"level":1,"score":"11427"},{"author":"dontaskmeforfeetpics","body":"What was the crime you were accused of?!","isChecked":true,"level":2,"score":"5021"},{"author":"sierra-_-charlie","body":"My wife(then girlfriend) and I eloped.\n\nWe crossed over three states in India over a 5 day period to get married.\n\nMy father-in-law (then mortal nemesis) is a well-connected man.\n\nHe got in touch with his contacts in the police department to try and get a hold of us and filed a formal complaint as part of due process.\n\nLong story short, We got married. The rather inept police couldn’t find a couple of 21 year olds.\n\nOver the next 4 months, all of it was sorted out.\n\nFirst, we were vilified, then the parents were mollified, etc etc.\n\n\nBut in the beautiful ending to that story, my father-in-law forgot to retract his complaint.\n\n\nProceed to our first wedding anniversary and we were taking a flight out of the country for a celebratory vacation.\n\nFrom Bombay airport, India to Dubai Airport, The United Arab Emirates.\n\nI was flagged at immigration and was taken across to a cell where I was duly arrested.\n\nMy crime?\n\nKidnapping.\n\n\nI was being accused of having kidnapped the lady I was now married to.\n\nTaken to a cell. Whilst my wife tried to explain the misunderstanding.\n\n\nOne cunt of a cop told her, “madam, don’t worry, we know how Stockholm Syndrome works”, “you are safe now” etc.\n\nAnd this was on a Friday evening.\n\nDue judicial process was followed and I was released by the judge on the following Monday.\n\n😂\n\nHell of a story to share with people when we include all the details of the planning and execution.\n\n\nEDIT: We marked our 10th anniversary on the 12th of this month and the 9th anniversary of me getting my ass hauled to jail. 🤪","isChecked":true,"level":3,"score":"12615"},{"author":"SexThrowaway1126","body":"I’m glad you’re ok, and frankly I’m glad that Stockholm Syndrome is at least taken seriously (albeit disastrously applied).","isChecked":false,"level":4,"score":"2496"},{"author":"JrxJake","body":"Dude, make a movie","isChecked":false,"level":4,"score":"3672"},{"author":"Nerfherder_328","body":"That is every single love story in bollywood","isChecked":false,"level":5,"score":"231"},{"author":"hydrosalad","body":"Just add 27 song and dance sequences","isChecked":false,"level":6,"score":"101"},{"author":"yusenye","body":"I survived a plane crush in the dessert, trapped there for 2 days, and was rescued by two dudes who were trying to bet if they can cook an egg in the sand.","isChecked":false,"level":1,"score":"1710"},{"author":"leskowhooop","body":"So can cook an egg in the sand?","isChecked":false,"level":2,"score":"700"},{"author":"1SweetChuck","body":"The albumen (whites) of chicken eggs coagulate between 144° and 149° F, the yolks coagulate between 149° and 158° F.  The sand in a desert is often 30° to 40° F above the air temperature.  Death Valley's high temp is 139° F and often sees 120° in the summer.  So sand temperatures should be enough to cook an egg.","isChecked":false,"level":3,"score":"201"},{"author":"Vyzantinist","body":"I once successfully ran an unfunded shelter for ~100 homeless veterans....as a homeless civilian.","isChecked":false,"level":1,"score":"14760"},{"author":"yi_kes","body":"How did this come to be if I may ask?","isChecked":false,"level":2,"score":"3864"},{"author":"Vyzantinist","body":"I lost my job and housing in early 2017. I'd been homeless before and slept rough on the streets, although that was in California where the weather was at least bearable. This time I was living in North Dakota, and I'd seen what the winters were like. I figured if I was going to have to sleep on the streets again, I'd better move somewhere where I didn't have to contend with hypothermia for a good part of the year, so used the last of my money to relocate to Arizona. \n\nI had a totally impractical plan of finding work (and then housing) within a few weeks before my remaining funds ran out, but the deadline came and went and I found myself on the streets again. A homeless advocate I'd reached out to tried to get me sheltered at a place for homeless veterans but being a civilian, they turned me away. Aforementioned advocate reached an accommodation with the veterans by setting up an overnight shelter for homeless civilians next door that I would run for him. In exchange, I would be allowed to sleep on their property (outside the walls), use their facilities like showers and bathrooms, and join in their communal meals if they had enough food.\n\nBecause the civilian shelter was an overnight thing I really didn't have much to do, or anywhere to go, in the day so I spent more and more time with the vets. I took it on myself to help them with odd jobs like security, packing lunches for the local homeless (who didn't/couldn't live with them) to come and get, unloading donations from concerned citizens, and security (\"fire watch\") while the camp slept at night. I soon became the camp's unofficial-official cook, which was awesome, because I love cooking and it was a challenge cooking meals for so many people so quickly, using an outdoor \"kitchen\" with barebones facilities. \n\nI gradually began to take on more responsibilities with the vets and the overnight shelter was more like a side gig. The vets repeatedly asked me to move into the walls and stay with them, making me \"full time\" but I refused at first because I felt like it would be letting down the guy who I was running the overnight shelter for. I woke up one day to see the vets dismantling the tent we used for the overnight shelter and one of them wryly asked me \"where are you going to stay now?\" I moved in with the guys later that day. \n\nA couple of months later, the incumbent base \"commander\" and his family had secured housing for themselves and he didn't ask as much as *tell* me I would be taking over for them. They had thought about who was going to take on the job after they left and decided I was apparently the only one fit for the role, due to my diligence and enthusiasm for helping my newfound friends. \n\nNgl, there were parts of it that were tough, and really grated. I felt like I had to constantly prove myself to the \"big dick swinging\" mentality veterans, who felt that, as a veterans camp it should have been run by a vet. I was also just as homeless as my men; we had nothing but tent fabric to protect us from the elements, sometimes little food or water, and constant issues with the local tweekers and criminal elements of the homeless. But, helping these people get off the streets and/or reunited with their families is hands-down one of the most fulfilling things I've ever done in life.","isChecked":false,"level":3,"score":"7941"},{"author":"yi_kes","body":"Dude that is an amazing story, thank you so much for sharing!","isChecked":false,"level":4,"score":"391"},{"author":"DickOfReckoning","body":"You did more than i will ever do in my entire life. You should be proud, thank you for being an awesome human being.","isChecked":false,"level":4,"score":"125"},{"author":"Vyzantinist","body":"Thank you for your kind words, friendo :)\n\nBut you never know where life will take you. 3 years before that I had my own apartment and was working for a stock broker in a cushy, if boring, job. Never, ever, would have imagined moving overseas, becoming homeless, and all the (mis)adventures that followed.","isChecked":false,"level":5,"score":"132"},{"author":"accidentallatte","body":"When my mom was in grad school she took several labs where she worked with cadavers. Because my dad worked nights she often had to take me to class with her, and she'd usually just plonk me down on the table with the cadaver while she worked on it.","isChecked":true,"level":1,"score":"23596"},{"author":"dlordjr","body":"\"Can I go to work with you?\"\n\n\"Over my dead body.\"","isChecked":true,"level":2,"score":"22605"},{"author":"2fast-4ramadan","body":"*slams bodybag onto breakfast table*  \n  \n*laugh track*  \n  \n\"So uh... workin' from home today Mom?\"  \n  \n*stares*  \n*more laugh track*","isChecked":false,"level":3,"score":"4138"},{"author":"drewhead118","body":"why do I imagine some macabre sitcom scene where, after little sleep, she's half way through a disection before she realizes she mixed up which one she should be disecting and which one she should be giving the bottle to","isChecked":false,"level":2,"score":"1814"},{"author":"I_love_pillows","body":"Subject deceased seem to have reverted to that of an infant stage. This is most unusual and requires further investigation.","isChecked":false,"level":3,"score":"295"},{"author":"leaky_eddie","body":"I ran out of gas outside of La Paz Bolivia. Luckily it was down hill for about 6km into the city. I coasted the whole way on my motorbike, passed busses and drifted into a gas station. Never missed a beat!","isChecked":true,"level":1,"score":"29044"},{"author":"Siphyre","body":"sounds like you saved a liter of fuel to me.","isChecked":false,"level":2,"score":"9761"},{"author":"SelectFrequency","body":"Not that much, only a few hundred mLs to be honest. Most bikes can get 20 miles a liter or more","isChecked":false,"level":3,"score":"312"},{"author":"danimal_44","body":"I bet they get more than that coasting downhill!","isChecked":false,"level":4,"score":"156"},{"author":"shahooster","body":"My calculations suggest ♾ miles per liter","isChecked":false,"level":5,"score":"200"},{"author":"cubiclequeen","body":"I can't look left. Seriously. I'm not an ambi-looker, it's like the Zoolander of birth defects! It's called [Duane's Syndrome](https://rarediseases.org/rare-diseases/duane-syndrome/) and my left eye can't turn left so if I try to look to my left I see double. \n\nGrowing up my parents raised me to believe it was a party trick and not a disability so I would always show it off to friends, which in retrospect I think was pretty sweet.\n\nEdit: My mom discovered that something was off when I was a baby and she was doing the \"airplane\" motion with the spoon of baby food to the left. My left eye was not cooperating lol\n\nEdit 2: Fun fact - now that i'm in my 30s I can see in photos that there is a bag under my right eye but not under my left eye, presumably because I use my right eye far more often\n\nEdit 3: I am so excited to see there are so many fellow redditors with Duane's and i'm not alone! I've never met anyone else who had it so it's really nice to hear from people who know what it's like\n\nEdit 4: A lot of you have asked about driving--It didn't impact me mainly because my mom taught me how to use my mirrors first by turning my head before even letting me turn the car on for the first time! She walked around the car and we tried to identify my limitations. I also have a blind spot detector on my car now which is super helpful (i try not to totally depend on it though)\n\nEdit 5: [here's a photo!](https://imgur.com/A6aIFOg)","isChecked":false,"level":1,"score":"22690"},{"author":"sirkeylord","body":"Props to your parents for expert-handling that situation, you probably grew without even thinking you had any sort of disability and found out until you were old enough it didn't matter anymore","isChecked":false,"level":2,"score":"5599"},{"author":"SamSparkSLD","body":"Doctor: is everything all right?\n\nOp: Well, actually...","isChecked":false,"level":3,"score":"107"},{"author":"Cubidasse","body":"Wow. I can't look up ! We should form a club. Together we'll be able to see everywhere !\n(Mine is called Parino's syndrome if I remember well)","isChecked":false,"level":2,"score":"883"},{"author":"dlordjr","body":"\"Don't worry, it'll be all right\" - your mom, probably.\n\nEdit: Removed implication that OP was male.","isChecked":false,"level":2,"score":"7830"},{"author":"-Thunderbear-","body":"The name of the condition is less believable than the condition!\n\n\"I have Duane's Syndrome.\"\n\n\"Oh, so you don't make more coffee when you take the last cup, eat other people's lunches in the office fridge, and don't use a turn signal, got it.\"","isChecked":false,"level":2,"score":"764"},{"author":"mox44ah","body":"I was baptized by a serial killer.","isChecked":false,"level":1,"score":"12471"},{"author":"a-bagel-with-butter","body":"Well you can’t just bloody leave us at that man","isChecked":false,"level":2,"score":"4480"},{"author":"Babybabybabyq","body":"The guy came back for him","isChecked":false,"level":3,"score":"2098"},{"author":"PermaDerpFace","body":"Vaya con dios","isChecked":false,"level":4,"score":"71"},{"author":"Kuroude7","body":"If I had to hazard a guess, BTK. Pure speculation on my part of course.","isChecked":false,"level":3,"score":"80"},{"author":"HouseCarder","body":"BTK??","isChecked":false,"level":2,"score":"1904"},{"author":"oszillodrom","body":"Baptize, Torture, Kill","isChecked":false,"level":3,"score":"5651"},{"author":"g-a-r-n-e-t","body":"Similarly, my dad sold his motorcycle to a lady who used it to drive to a city a couple of hours away the next day so she could axe-murder her ex-husband, his new wife, and their kids. She was apparently fascinated with me and told my parents to never let me get married.","isChecked":false,"level":2,"score":"2133"},{"author":"NoBulletsLeft","body":"Oh my god, I totally forgot about this. When I was in college, I was always in the computer room. One night a student I knew asked me how to print something on the lab's main printer at a specific time. I showed him how to set it up and went back to work.\n\nNext morning, he jumped out a 7th storey window and at the same time the printer spewed out his suicide note.","isChecked":false,"level":3,"score":"639"},{"author":"pattech2000","body":"My best friend's little brother killed himself with a Beretta pistol that he had bought the year before. We found out later that he had been planning the suicide for some time, but for us his reason for terminating his life was a mystery at the time.\n\nLittle brother had graduated with top honors in a Masters program from Tulane, had a great job, was making over 6 figures, liked his fellow employees,  and seemed to have his shit together. He wasn't bad looking either.\n\nMy friend and I searched little brother's apartment for a suicide note but none was to be found. At one point we had considered his death to be a homicide, but there was no motive. \n\nIt was a couple of weeks after the funeral that I borrowed a voice recorder from my friend, it happened to be the little brother's that he used while at Tulane. I found the suicide note while clearing space in the memory. After listening to the recording  several times I understood his reasoning and yet found it comprehensible that he hated himself so much for being gay that he would take his life. I knew that he had battled depression, and consequently it was the depression that claimed him. I was overcome with a such a deep, soul wrenching  sadness that left my mind flooded with thoughts of  \"If only I had...\"\n\nI told my friend about finding the suicide note. When I handed the device to him he pushed the DELETE  button and said that there was nothing on device that anyone needed to hear.\n\nThe consequence of being the only other human who knew the contents of younger brother's last words has been a heavy burden, one that I will deal with until I pass on.","isChecked":false,"level":4,"score":"320"},{"author":"karkarnar","body":"I just had 15 police officers in riot gear show up to my hotel looking for a murderer who had slit his father's throat in 2010 and was now breaking parole. Three days ago when I was working the night shift, he stopped to chat and asked about my natural hair color, eye color, and if my teeth were real?\nHe has not been caught yet and I'm terrified to go back to work. He was way to into my appearance.","isChecked":false,"level":3,"score":"99"},{"author":"aspastori","body":"Okay, I need to know more.","isChecked":false,"level":2,"score":"91"},{"author":"snowfarmerme","body":"I am one of very few people outside WW1 to live through mustard gas. So rare the doctors (1995 no internet) had no idea how to treat me.","isChecked":false,"level":1,"score":"20665"},{"author":"Furimbus","body":"My family ancestry can be traced back to a court jester who served in the court of King Jakob IV of Sweden.","isChecked":false,"level":1,"score":"10277"},{"author":"rpgfan87","body":"Whenever someone calls you a fool, you're just carrying on the legacy.","isChecked":false,"level":2,"score":"7496"},{"author":"HiddenMica","body":"That jester probably got in trouble. Most of Europe banned jesters from having kids because they were so good at inciting people and screwing with people they were afraid they would get people to revolt. Smart tongues and snarkiness were feared!","isChecked":false,"level":2,"score":"84"},{"author":"bushpotatoe","body":"I've literally never been sick, or at least never showed symptoms of being sick. No colds, no fevers, no viruses, no flu even. I really don't know what it's like to be sick or get sick, and frankly, I hope I never do.\n\nIt'd sure be ironic if the first time I got sick was now...\n\nEDIT: I'm 30 years old by the way, that was probably worth mentioning.","isChecked":false,"level":1,"score":"7250"},{"author":"kbounce24","body":"Out of curiousity, have you also been in 3 fatal train accidents and never had a scratch?","isChecked":false,"level":2,"score":"3392"},{"author":"SqulliamFancyson44","body":"Or been in contact with a man who runs a comic book store and has extremely brittle bones?","isChecked":false,"level":3,"score":"1366"},{"author":"davidouo","body":"I watched Glass a few days ago without knowing it was part of the trilogy. For about 80% of the film, I literally thought it was a rip off of a movie I watched a few years back. Wtf.","isChecked":false,"level":4,"score":"84"},{"author":"WORhMnGd","body":"You sound like my family. Some people just have better immune systems. I’ve been sick, but not often and not for long. \n\n\nWe all got mental disorder though so it’s a give and take.","isChecked":false,"level":2,"score":"452"},{"author":"Tortion","body":"I have phytophotodermatitis, which is a big fancy word for I can't get acidic juices (lemons, limes, apples, oranges, etc) on my skin and go out in the sun. Turns my skin brown like a rash. Doesn't hurt or itch, just discoloration. Happened three or four times in my life.","isChecked":false,"level":1,"score":"8179"},{"author":"BioLogicPodcast","body":"Is it permanent? Or will the discoloration fade?","isChecked":false,"level":2,"score":"1827"},{"author":"Tortion","body":"It goes away in about a week. It's real splotchy looking, not a rash with a border if that makes sense. Kinda blends out","isChecked":false,"level":3,"score":"2034"},{"author":"pgp555","body":"does anything else happen?","isChecked":false,"level":4,"score":"73"},{"author":"Tortion","body":"Nope. Not even dry skin for me. Without looking in a mirror I wouldn't even know","isChecked":false,"level":5,"score":"112"},{"author":"KatzDeli","body":"I’ve been in 3 fatal train accidents. Never had a scratch.","isChecked":false,"level":1,"score":"13880"},{"author":"KLWK","body":"Found the star of \"Unbreakable\".","isChecked":false,"level":2,"score":"7641"},{"author":"jml011","body":"And he is...Unstoppable","isChecked":false,"level":3,"score":"114"},{"author":"YeetMeatToFeet","body":"(Spoiler for Glass) >!Until he runs into a puddle!<","isChecked":false,"level":4,"score":"142"},{"author":"portablebiscuit","body":"Have you ever met a Mr. Glass?","isChecked":false,"level":2,"score":"1954"},{"author":"mythicreign","body":"Jeez. They should really stop letting you drive trains.","isChecked":false,"level":2,"score":"750"},{"author":"HoldMyCross","body":"Wait.. fatal to other people or do we got some undead stuff going on?","isChecked":false,"level":2,"score":"2146"},{"author":"MojoMonster","body":"All three trains died so that he could live.\n\nHe wasn't on any of those trains.\n\nedit: Obligatory effusive thankful acknowledgment!","isChecked":false,"level":3,"score":"2289"},{"author":"KatzDeli","body":"Yes. Fatal to others.","isChecked":false,"level":3,"score":"99"},{"author":"marimuthu96","body":"I am blind. Many online commenters think that I am lying. If I wanna lie, I would rather tell everyone that I am a rich traveller.","isChecked":false,"level":1,"score":"7188"},{"author":"anonymous_idunno","body":"Can you explain how you type?","isChecked":false,"level":2,"score":"1180"},{"author":"marimuthu96","body":"I type using a text to speach software.  Basically it is a program that reads everything from the screan. All android and Iphones come with this program pre-installed. Whatever letter I press on the keybord, it reads it. Even it reads the stickers. For example, if you send me a smiling face, it will read it as smiling face. Basically, you see the letters and type, I type through hearing.","isChecked":false,"level":3,"score":"3419"},{"author":"dontaskmeforfeetpics","body":"This is awesome!","isChecked":false,"level":4,"score":"1074"},{"author":"marimuthu96","body":"Thank you. Stay safe!","isChecked":false,"level":5,"score":"663"},{"author":"chaipotstoryteIIer","body":"Hey you're the one who writes poetry! I know you from r/indiaspeaks good luck with your book dude!","isChecked":false,"level":6,"score":"389"},{"author":"marimuthu96","body":"Thank you, thank you! Wonderful subreddit. I received such support there. \n\nStay safe and stay happy.","isChecked":false,"level":7,"score":"353"},{"author":"ShuuTsukTrash","body":"That's pretty cool. Smiling face","isChecked":false,"level":4,"score":"101"},{"author":"Grey_Hawk98","body":"My grandfather got a award from Mussolini in 1935. He was just born with 6.3kg (13 lbs 14.2 oz) and was awarded the award of \"Italy's Biggest Baby\"\n\nEdit: Wow, I didn't expected it to blow this way. Thanks for the Silver  [/u/xXSandwhichXx](https://www.reddit.com/u/xXSandwhichXx).\n\nAlso, since some people asked: my greatgrandma also worked as a cleaning lady ONE DAY BEFORE HE WAS BORN (he was born December 24th, and she worked until December 23rd of that year);\n\nAnd if you think my grandpa was big: recently a baby was born in India with 6.7kg (14.77lb), and the world record was for another italian baby, born in 1955 with flippin'  10.2 kg (22lb 8oz)","isChecked":false,"level":1,"score":"9937"},{"author":"fuckin_anti_pope","body":"My grandfathers birthday was on the 20th of april like Hitler. He really liked that as a child in Nazi germany since he had the day off on his birthday and could celebrate instead of going to school since the Führer birthday was a national holiday","isChecked":false,"level":2,"score":"3066"},{"author":"0xMii","body":"I cannot see 3D effects in movies or games. I didn’t know that until a friend showed me his new Nintendo 3DS and I asked him whether this thing was a scam because it didn’t look any different to me than a normal DS. \n\nWe had a fight over this because we both thought the other one was bullshitting him. \n\n“You’re holding it wrong! How the fuck do you not see this?”\n\n“Are you fucking kidding me right now? There’s nothing 3D about this thing.”","isChecked":false,"level":1,"score":"19935"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"5558"},{"author":"katerinafitness","body":"I'm monocular (only see out of the right eye) and have nystagmus and astigmatism. The world is not 3D to me, and I explain it exactly like you do.\n\nThe only time I ever see in 3D is when I'm high as fuck. Sometimes my eye relaxes just enough and I'm processing the image in 3D. It freaks me out.\n\nMovies have never looked 3D to me though.","isChecked":false,"level":3,"score":"2481"},{"author":"None","body":"[deleted]","isChecked":false,"level":4,"score":"877"},{"author":"Poes_hoes","body":"Same! I always thought it had to do with being colorblind when I was younger since they used the colored lenses. Years later I had my vision checked where they use two images, one for either eye, to check depth perception and I failed miserably.\n\nHow's your depth perception?","isChecked":false,"level":2,"score":"1366"},{"author":"yoloGolf","body":"If I'm understanding the test you described,  glasses fixed this portion of the exam for me.\n\nHowever I never noticed this \"problem\" except in this particular eye exam.","isChecked":false,"level":3,"score":"368"},{"author":"masturprocrastinator","body":"I got ran over by a car, but the driver didn't see me and proceeded to back over me.\n\nEdit: Thanks for all the kind words. I'm shocked at the amount of people who said that this happened to them or someone they know/knew as well, the world really is a weird place. And for all who are asking:\n\n* My legs are perfectly fine now. On a side note, I actually really enjoy running, it's one of my favorite things to do.\n* No I'm not from China nor have I ever lived there, I'm American (I don't quite understand why people are asking this??)\n\nEdit #2: A couple redditors have pointed out to me that its because killing someone in China is apparently less expensive, which is a horrifying thought, but thanks for the explanations.\n\nEdit #3: How is my mental health? Was I traumatized? Well, it very fucking terrifying at the time and I was definitely scared of cars afterwards. But if you're asking if I'm feeling any trauma *to this day*, then I would say not very much if at all. Thanks for asking though :)","isChecked":false,"level":1,"score":"33551"},{"author":"angrylawd","body":"Did you get any major injuries?","isChecked":false,"level":2,"score":"7987"},{"author":"masturprocrastinator","body":"Luckily they didn't get my torso, but they crushed my legs. This was about when I was 13-14 (about 4-5 years ago), so my legs healed and I'm walking again :)","isChecked":false,"level":3,"score":"15205"},{"author":"angrylawd","body":"Good to hear your that you've recovered!","isChecked":false,"level":4,"score":"4382"},{"author":"rubmahbelly","body":"Holy fuck that is terrible. Good to hear you are ok.","isChecked":false,"level":4,"score":"670"},{"author":"CatherineConstance","body":"So glad to hear you're okay. A girl in my town did this and killed the guy (she was 17 years old and was drunk and high at 7am). She killed a husband and father, and because her dad was a rich lawyer she served like 2 months in the end. I still see her around town and seeing her face makes me physically sick and I didn't even know the guy she slaughtered.","isChecked":false,"level":4,"score":"78"},{"author":"its_zammer","body":"“Is he dead?”\n\n“No.” \n\n*throws it into reverse*","isChecked":false,"level":2,"score":"11026"},{"author":"MiraiHunter","body":"PUT IT IN REVERSE TERRY!!","isChecked":false,"level":3,"score":"123"},{"author":"Shelbones","body":"My dad invented the hamburglar.","isChecked":false,"level":1,"score":"1913"},{"author":"danny_2332","body":"I can not taste any salt whatsoever\n\nEDIT: for people asking its a brain thing, food tastes bland, salted chips taste plain, and ive not had any British food\n\nEDIT 2: i can still taste other spices and herbs, no idk what cum tastes like(sorry to put you on blast dude but thats weird), salt water just tastes bad, MSG and other sodium based things just make me gag, getting on xbox, overwatch, etc. doesn't help but i can smell the salt","isChecked":false,"level":1,"score":"12786"},{"author":"Pizza_Guy68","body":"What do you taste if you put a bit of salt in your mouth?","isChecked":false,"level":2,"score":"3689"},{"author":"danny_2332","body":"Nothing ill feel it there but that ab it","isChecked":false,"level":3,"score":"3955"},{"author":"Pizza_Guy68","body":"That's pretty wild","isChecked":false,"level":4,"score":"1967"},{"author":"danny_2332","body":"It sucks bc i think tis because of a head injury bc before that happened i could taste it just fine","isChecked":false,"level":5,"score":"2035"},{"author":"Pizza_Guy68","body":"I have a cousin who can't smell anything because he had an issue with his brain ... I can't recall exactly the condition was though\n\nIt was some sort of physical issue like a blood clot i think","isChecked":false,"level":6,"score":"481"},{"author":"dmitryochkov","body":"Should be handy on Reddit","isChecked":false,"level":2,"score":"81"},{"author":"djauralsects","body":"I've had a headache since August 2015 and I will probably have it for the rest of my life. It's only on half my head, so I got that going for me, which is nice.\n\n\n\nhttps://www.ninds.nih.gov/Disorders/All-Disorders/Hemicrania-Continua-Information-Page","isChecked":false,"level":1,"score":"27014"},{"author":"ChaseH9","body":"Me too! ALSO since August of 2015! That's when I had a craniotomy to remove half a brain tumor. I've had a constant headache, right eye blindness, no feeling, and minor paralysis on the right side of my head. But, if you touch the right side of my head just the right way, even though there is no feeling to the head, it tickles my butt. Idk how it works","isChecked":false,"level":2,"score":"5443"},{"author":"djauralsects","body":"I had the headache first, they did a CT scan looking for the source if it and found a giant brain tumor. Unfortunately the tumor wasn't the source of the headache. A 12 hour surgery and 25 radition treatments later I still have thd headache.","isChecked":false,"level":3,"score":"1276"},{"author":"big_mama_blitz","body":"This made me \"ooooooh man\" outloud. I cannot imagine how you deal. I get headaches and migraines semi-frequently and sometimes to the point I feel like I am being tortured. Is there nothing they can do? How do you cope with a never-ending pain in your head? I genuinely hope you do NOT have this for the rest of your life.","isChecked":false,"level":2,"score":"9866"},{"author":"balthazar_nor","body":"Get addicted to Vicodin and perform insane doctorly acts","isChecked":false,"level":3,"score":"2374"},{"author":"OkayBuddy1234567","body":"I haven’t seen the show but from what I’ve heard about it I’m assuming that you’re talking about House","isChecked":false,"level":4,"score":"146"},{"author":"WhiteLookingGlass","body":"You should watch it. It doesn’t get talked about much these days but it’s a great ride, with some outstanding acting from Hugh Laurie","isChecked":false,"level":5,"score":"166"},{"author":"fishwhispers17","body":"I’ve had one on both sides for over 20 years. Completely unresponsive to everything a neurologist can throw at it.","isChecked":false,"level":2,"score":"2168"},{"author":"jondesu","body":"This does not give me much hope. I’m at 6 years. How have you coped for 20+?","isChecked":false,"level":3,"score":"1022"},{"author":"brian27610","body":"I will never fucking complain about my life ever again","isChecked":false,"level":2,"score":"130"},{"author":"Bio_Powered","body":"Worked during the summer at some kind of hotel/summer camp for people from Eastern Europe and one of my colleagues, the cook, found a wounded crow, healed it and then trained it. The bird would sit on her shoulder when she was cooking, would come to her on command and would share cigarettes with her (also while cooking).","isChecked":false,"level":1,"score":"732"},{"author":"Mikkiep","body":"My ex and I were having a huge argument in a hotel parking lot, my friend and exes dad were there as witnesses. Two big buses pulled up and Justin Bieber got off one of them with a security guard and walked right past us, I was crying and my ex was yelling at me and JB said, and I quote \"hey, stop that\", my ex yelled back at him \"white ppl shouldn't have dreads!\" and Justin just got onto the other bus w his guard. My friend was cracking up saying \"was that Justin Bieber?\" and sure enough, some people in his entourage or whatever were staying at that hotel and he was in town that night for a concert. \n\nTldr: Justin Bieber told my ex to stop yelling at me, and then my ex yelled at him.","isChecked":true,"level":1,"score":"6284"},{"author":"LeyreNonAnom","body":"This is the best one yet","isChecked":false,"level":2,"score":"438"},{"author":"Darktigr","body":"I like stories like these, where someone doesn't realize who they're talking to until afterwards. Part of me thinks Bieber kind of enjoyed the conversation because he was treated like a normal human being by your ex, even if that treatment was inhospitable.","isChecked":false,"level":2,"score":"419"},{"author":"GorillaX","body":"I had a class in college with Elizabeth Smart. We were even assigned as partners for a big project, so I got to know her a little bit and worked pretty closely with her. I obviously knew her name and knew about the girl that was kidnapped, but I never made the connection. I figured it was just a common enough name and didn't think about it again, until I saw her on TV a few years later. I felt really dumb for not realizing she was THE Elizabeth Smart at the time, but then I figured she probably appreciated me just treating her like any other girl so 🤷‍♂️","isChecked":false,"level":3,"score":"266"},{"author":"Saltynole","body":"Grandma did genealogy of my family and proved we’re related to Edgar Allan Poe","isChecked":false,"level":1,"score":"3494"},{"author":"Bionic_Ferir","body":"He was the original goth kid","isChecked":false,"level":2,"score":"100"},{"author":"AhigaRiot","body":"I once fell over a chair during a massive bar fight,  in the process kicking a German marine out a second story windows in the middle of downtown Queensland.","isChecked":false,"level":1,"score":"392"},{"author":"BebeDarke","body":"Nobody knows why I'm half blind - not even WHO.\n\nI went blind in my left eye when I was 7 - my optic nerve atrophied. There is no explanation as to why. I have had everything tested, and my body is (was at the time) completely normal. Ive had plenty of tests, met far too many experts (I've had several specialists come to hospitals near me to inspect me and all sorts) and I've had far too many tests and the answer is -\n\nWell. It just happened, we guess.  There's plenty more, my life kind of reads like some kind of awful sitcom or something - but the eye thing is the easiest to digest.  \n\n\nEDIT: About the 'WHO' bit - at one point the guy in charge of looking after me etc. took my file to a WHO conference or something and came back with a load of blanks. Fun.","isChecked":false,"level":1,"score":"380"},{"author":"TheMerk10","body":"Despite having a genetic tremor I've been playing guitar passionately for 8 years \n\nEdit: changed generic to genetic","isChecked":false,"level":1,"score":"189"},{"author":"AidansSeenSomeShit","body":"I was almost named Storm because I was born at 3 am in the middle of a massive tornado storm (one touched down actually a few minutes after I was born). I was also essentially dead (docs thought they were going to lose both me and my mom) but somehow I lived bitches.","isChecked":false,"level":1,"score":"7664"},{"author":"Pinkeeee","body":"Did your mom also live?","isChecked":false,"level":2,"score":"2610"},{"author":"AidansSeenSomeShit","body":"Yep we're all happy and healthy, also got a sister 5 years later with way less complications.","isChecked":false,"level":3,"score":"3094"},{"author":"skotgil","body":"my 1st word was cheese","isChecked":false,"level":1,"score":"3673"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"3011"},{"author":"mythicreign","body":"She's almost certainly referring to the ridiculous cost of ink these days.","isChecked":false,"level":3,"score":"1268"},{"author":"atomicbob1","body":"My son's first sentence was \"you stay here,  I'll be right back\"  \nMight not mean much to anyone else, but going from \"daddy\" to a sentence with pretty complex parts of speech was a bit much for my wife and I. We were like, \"ok then, we'll wait right here.\"","isChecked":false,"level":3,"score":"75"},{"author":"AdamInChainz","body":"I was mugged in Belgium, and I mugged the muggers back. Got my wallet and my friend's purse back.\n\nI'm a pretty quiet low key guy, so no one believed the story, and it's so disappointing because I'm pretty sure I'll never be that awesome again.","isChecked":false,"level":1,"score":"1272"},{"author":"pinkawapuhi","body":"A stranger stole my bra in a women’s locker room when I was a teen. Several days later, I saw it hanging by her shower and stole it back. So, samesies right?","isChecked":false,"level":2,"score":"365"},{"author":"pajamakitten","body":"I beat anorexia. I'm a guy and I do not have photos of me from that time (due to shame) so I have no proof. I have gone from 70lbs to ~130lbs.","isChecked":false,"level":1,"score":"9486"},{"author":"TheKlic","body":"Me too, high five!\n\n115 -> 185 now.","isChecked":false,"level":2,"score":"2414"},{"author":"floorwantshugs","body":"Congratulations! Good for you, dude!","isChecked":false,"level":2,"score":"902"},{"author":"theitdude1987","body":"Reading these comments made realize how boring i am","isChecked":false,"level":1,"score":"2882"},{"author":"scoooberdooober","body":"someone got decapitated on my first day at a minimum wage job","isChecked":false,"level":1,"score":"826"},{"author":"Zee_End","body":"I need more details on this","isChecked":false,"level":2,"score":"113"},{"author":"scoooberdooober","body":"Was working at a marina, the man was up fixing his mast and the rope holding him snapped. Unfortunately, his neck directly hit the gunwale/side of his boat when he fell.","isChecked":false,"level":3,"score":"222"},{"author":"DeusVULT1097","body":"I was shooting some stuff in my village and a bullet ricochet and hit me in the torso. I was afraid my parents would kill me if they found out (I was young) so I used a knife and tweezers to remove the fragment and a stapler to stitch it up and then covered the wound and they never found out until a few years later when I told them.","isChecked":true,"level":1,"score":"9357"},{"author":"RikkRakk","body":"That's savage dude","isChecked":false,"level":2,"score":"3941"},{"author":"DeusVULT1097","body":"The motive was childish fear of the slipper though. Also I need to say that I don’t feel pain to the extent most people do (which has cause some unnecessary burns when cooking and other injuries) so the pain of stitching and cutting wasn’t that great. Digging for the fragments was a real bitch though","isChecked":false,"level":3,"score":"2845"},{"author":"RikkRakk","body":"Yeah I imagine. Is the scar bad","isChecked":false,"level":4,"score":"152"},{"author":"DeusVULT1097","body":"The funny thing is that no it’s not too bad. The spot is much darker than the rest of my body and a bit bumpy but not what you would expect","isChecked":false,"level":5,"score":"207"},{"author":"RikkRakk","body":"That's pretty impressive actually. You must have done a good job digging it out","isChecked":false,"level":6,"score":"134"},{"author":"DeusVULT1097","body":"Lol no it was actually pretty sloppy and I used the knife to make the hole bigger cause I couldn’t see the fragment. It was pretty small but I made the hole much larger. I study medicine now so I’m sure I could do a much better job now","isChecked":false,"level":7,"score":"268"},{"author":"Comander123SUV","body":"Lmao try again, see if your better at it","isChecked":false,"level":8,"score":"199"},{"author":"ClutzyMe","body":"Fear of the chancla can be pretty motivating.","isChecked":false,"level":4,"score":"111"},{"author":"CanOfBirds","body":"I've pet a Penguin before","isChecked":false,"level":1,"score":"4193"},{"author":"Darkmaster666666","body":"Lucky","isChecked":false,"level":2,"score":"1448"},{"author":"EchoPerson14","body":"I can't drink the red Gatorade. This isn't super uncommon but the red dye makes me nauseous and freak out. The funny thing is I used to drink it all the time without a problem, but one year I started feeling weird and sick all the time, and I stopped. It definitely helped, and I don't drink it. I tried it again a little while ago. Still nope.\n\nEdit: Woah! I have 88 messages! Thank you I think!","isChecked":false,"level":1,"score":"4894"},{"author":"rattpackfan301","body":"My bio teacher in high school’s daughter has that same allergy to red 40.","isChecked":false,"level":2,"score":"1280"},{"author":"howbouthemapples20","body":"Its actually a common allergy. I know atleast 3 people with it.","isChecked":false,"level":3,"score":"135"},{"author":"HhhHhm","body":"I've skinned and dismembered a human corpse. This freaks a lot of people out, but it's actually more common than most people realise.","isChecked":false,"level":1,"score":"2054"},{"author":"Schlaughtowver","body":"You're a doctor, right? This is included in basic medical schooling. My father is a doctor and he has done the same thing.","isChecked":false,"level":2,"score":"1163"},{"author":"HhhHhm","body":"Bingo.\n\nNever a doctor, but I did go through med school. Now I work in a totally different field so when I mention this fact to friends or co-workers, they never make the connection and I just watch their brains freeze.","isChecked":false,"level":3,"score":"1499"},{"author":"ahumanpileofgarbage","body":"My grandfather went AWOL on the French Foreign Legion and was banned from ever going back to France. All because he left to marry my grandmother\n\n\nEdit: oh god this blew up, Reddit youtubers please don't feature this comment.","isChecked":false,"level":1,"score":"10439"},{"author":"Zbaker282","body":"One of my dad's friends was in the RAF, but he got bored of it and went AWOL and joined the French Foreign Legion. However he got bored of that to so he went AWOL and whent back to the RAF and took his punishment.\n\nHowever, this is not where the story ends. Later he and his platoon (including my dad) where going on a skiing training camp in Italy. However the route took them through France. This is the bit where he informs his platoon leader that they need to do a detour around France because he would be atrested upon entering France. Safe to say his friends where not impressed.","isChecked":false,"level":2,"score":"3501"},{"author":"plipyplop","body":"There's always that one guy.","isChecked":false,"level":3,"score":"1192"},{"author":"deathinactthree","body":"I was taught kung fu by a homeless Chinese monk.  I studied with him for years and eventually ran my own school.","isChecked":false,"level":1,"score":"4017"},{"author":"sledgehammer0019","body":"this is a movie material bud","isChecked":false,"level":2,"score":"1474"},{"author":"Spideroo7","body":"He should call it the ‘’Kung fu kid”\nWait...","isChecked":false,"level":3,"score":"162"},{"author":"TheMiddlechild08","body":"My mom drove me to the airport at 5am for a booty call when I was 30. \n\nI am 30.","isChecked":false,"level":1,"score":"1022"},{"author":"xEman26x","body":"Is your mom a pimp or were you making the booty call?","isChecked":false,"level":2,"score":"198"},{"author":"Alwin_","body":"I've eaten a piece of the Berlin wall, it got me suspended from school and grounded for a months.","isChecked":false,"level":1,"score":"335"},{"author":"success10","body":"I completed GTA San Andreas in 3 days. I never slept, eat nor shit.","isChecked":false,"level":1,"score":"5009"},{"author":"Torchoflittleton","body":"Are these two separate facts?","isChecked":false,"level":2,"score":"5059"},{"author":"Different_States","body":"I repelled off The C.N. Tower in Toronto Canada to paint the top white.\n\nEdit:I  did not expect that much of a reaction. So cool little detail. We were anchored at the very very top (get in and out through hatches up there.) When you went down a bit and has enough rope above you, you could kick out, seeing right out into open air above the city. If you kicked out at an angle when you came swinging back to miss the tower and end up circling it, winding your rope around the tower (it's relatively thin up there maybe) and then you'd unwind and circle back the other way. It was like flying 1800 feet above the city. I miss that job.","isChecked":false,"level":1,"score":"3153"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"69"},{"author":"rafael-a","body":"I lost my virginity before my first kiss.","isChecked":false,"level":1,"score":"7815"},{"author":"RaskolDreams","body":"Was it a mutual agreement not to kiss during or what?","isChecked":false,"level":2,"score":"1406"},{"author":"rafael-a","body":"No, she just ended up kissing me after I was already in, so technically the kiss happened after.","isChecked":false,"level":3,"score":"2896"},{"author":"RaskolDreams","body":"Ahhhhh ok then, cool","isChecked":false,"level":4,"score":"669"},{"author":"rhemasu","body":"Was that a positive experience?","isChecked":false,"level":2,"score":"1532"},{"author":"rafael-a","body":"Yes it was","isChecked":false,"level":3,"score":"1908"},{"author":"rhemasu","body":"Ok good. I just wanted to make sure you weren’t stating a traumatic experience and people were making jokes. I’m glad it was a good experience","isChecked":false,"level":4,"score":"2237"},{"author":"rafael-a","body":"Thank for the concern, it was the opposite of traumatic.","isChecked":false,"level":5,"score":"1201"},{"author":"rhemasu","body":"Yeah I get that now. I also read your other comment and saw you kissed her pretty much right after so all good. Much better than I feared:)","isChecked":false,"level":6,"score":"423"},{"author":"efan9411","body":"I am related to William Henry Harrison - the president who died from hypothermia because he wouldn't wear a jacket. My great grandfather and his son both died from hypothermia as well but under slightly different experiences. I have almost died from eating way too many vitamins, jumping into a ceiling fan, and jumping from a cliff. My dad almost lit a gas station on fire. Basically, we are a very dumb bloodline starting from William Henry Harrison.","isChecked":false,"level":1,"score":"26405"},{"author":"fiftymilesofbadroad","body":"SOMEONE GET THIS MAN AN AGENT!","isChecked":false,"level":2,"score":"7793"},{"author":"Ghlitch","body":"AND A JACKET!","isChecked":false,"level":3,"score":"6909"},{"author":"C4se4","body":"I want you in a movie","isChecked":false,"level":2,"score":"1102"},{"author":"brujita44","body":"I immediately thought about parks and rec","isChecked":false,"level":2,"score":"972"},{"author":"fatrabbit61614","body":"rumor has it that i have an almost supernatural level sense of smell when it comes to food. i would spontaneously say \"i smell or whos eating [insert food name here]\" and i would be correct, even if the scent was barely in the air and oftentimes would be a room away.\n\nbut surprise, i just really have an oversensitive olfactory organ, so much so that its literally like a canine sense of smell. that also means any kind of really strong smell like smoke, paint fumes, perfume or powder easily overpowers me to the point of gagging.\n\nEdit: its amazing how many people are like me! I always thought something was wrong with my sense of smell being it so unaturally strong, but turns out its more common among the populace than i thought.\n\nEdit 2: for those wondering nope its not delibitating to me. Nice smells dont hurt my nose, but strong chemical based or really really really foul smells are the ones that hit hard.","isChecked":false,"level":1,"score":"1938"},{"author":"Trippydippy1","body":"Food companies pay a lot for 'super tasters' and such, you know those odd news stories were some has a body part insured for an insane amount of money? It's usually the company employing them doing it, as they need a base line in production at all times.\nThe coffee and tea industry's are crazy like this making sure that batch's blend is the same as last.\nEver thought about looking into it? Crazy money to be had.","isChecked":false,"level":2,"score":"807"},{"author":"sadsolocup","body":"I have ridden a bicycle 100,000 miles (~161,000 kilometers)","isChecked":false,"level":1,"score":"3814"},{"author":"dontaskmeforfeetpics","body":"I bet you have killer leg muscles","isChecked":false,"level":2,"score":"1960"},{"author":"sadsolocup","body":"Yep. My legs are so muscular that even athletic cut pants don’t fit correctly.","isChecked":false,"level":3,"score":"1915"},{"author":"ktka","body":"Pics so we get off or something like that reddit always say.","isChecked":false,"level":4,"score":"1083"},{"author":"juanabeewolf","body":"When I was a young adult I was jumped by a group of guys while attending a party weekend at a lake.\n\nI was roughed up pretty good, but with the help of a beer bottle that I found while getting stomped on the ground I managed to turn the tables and deal out a shit kicking of my own.\n\nI seen my attackers in the light of the next day and a couple of them were looking pretty rough.  I also later found out that one of my attackers was a 30 year old male who had to get wedding pictures with stitches and bruises on his face.","isChecked":false,"level":1,"score":"2619"},{"author":"IM_SAD_PM_TITS","body":"I love that story. Sorry it happened to you, but I'm glad they got what came to them.","isChecked":false,"level":2,"score":"305"},{"author":"Chocolatefix","body":"How old exactly were you and what was the reason for the fight?","isChecked":false,"level":2,"score":"75"},{"author":"rosachk","body":"There's a scientist who died on the same day I was born and her research subject was very very close to mine. Not just the field but down to some articles she wrote and some of her side interests. Some tidbits of her personal life also echo some of mine. I only found out after I graduated and now I low-key feel like reincarnation might be a thing. ETA : I don't really believe reincarnation is a thing. That was a joke. Jesus, people","isChecked":false,"level":1,"score":"6810"},{"author":"foundoutaug2019","body":"Welcome back.","isChecked":false,"level":2,"score":"4269"},{"author":"Cryotechnium","body":"you respawned to finish the quest as a different class","isChecked":false,"level":2,"score":"1490"},{"author":"astral_kranium","body":"I have a single chest hair, in the centre of my chest. I have had it for 15 years (I am 30). Sometimes it falls out, but then grows back within a few days.","isChecked":false,"level":1,"score":"563"},{"author":"notpynchon","body":"I karaoke'd my own song and scored a 0 out of 10.","isChecked":false,"level":1,"score":"296"},{"author":"Jetsgopro","body":"Having two failed out-patient surgeries in 15 years to fix a recurring pilonidal cyst, I refuse to go back and now have two “buttholes” I can fart out of. And that’s likely enough reddit today for all of us.","isChecked":false,"level":1,"score":"543"},{"author":"DevilsHandyman","body":"Some unique bragging rights.","isChecked":false,"level":2,"score":"114"},{"author":"DepressedPancake4728","body":"The Volkswagen Beetle on the cover of “Abbey Road” by The Beatles belonged to my Grandfather.\n\nEdit: We are not 100% sure that it was actually his, but he was in London when they were doing the photoshoot, he had that exact car in that exact color, and it had a few other telltale markings. He also claims that that is where he parked on that day.","isChecked":false,"level":1,"score":"3457"},{"author":"northeastpicker","body":"Crazy. I was just listening to \"Abbey Road\" and was looking at the VW wondering if it was placed there or was just there. Strange world.","isChecked":false,"level":2,"score":"467"},{"author":"Son_Kakkarott","body":"I went on a guided tour of the World Trade Center on 8/11/2001. I was on the rooftop and everything.","isChecked":false,"level":1,"score":"1606"},{"author":"-Night_Knight-","body":"There was a typo on my birth certificate. Legally, my middle name is spelled Kimberlyy.","isChecked":false,"level":1,"score":"405"},{"author":"kevnmartin","body":"Husband and I fell in love at first sight. Moved in together after two days. Married five months later. Still married. It will be forty years in may.","isChecked":false,"level":1,"score":"21030"},{"author":"Lunar_Wolf770","body":"Congrats on 40 years! That's amazing; I want to find love like that someday.","isChecked":false,"level":2,"score":"4498"},{"author":"MomPancakes","body":"That's an amazing leap of faith. Congratulations!","isChecked":false,"level":2,"score":"1672"},{"author":"kevnmartin","body":"Thank you. It's been a wild ride and we're still crazy about each other.","isChecked":false,"level":3,"score":"1881"},{"author":"Jaewol","body":"That’s absolutely wonderful for the both of you, if you don’t mind me asking, how did you meet each other and what made you want to live together so soon?","isChecked":false,"level":4,"score":"78"},{"author":"kevnmartin","body":"I worked in my mom's design business. One day she sent me to put gas in her car and I went to the wrong gas station. My husband was the owner's son. He asked me out on the spot and I said maybe and gave him my business card. He called before I got back to the office which was two blocks away. We talked for a bit and I gave him my home phone number. That night he called and we talked for two hours. It was like we'd known each other our whole lives. We went out the next night and I moved my shit into his house the day after that.","isChecked":false,"level":5,"score":"304"},{"author":"Jaewol","body":"I admire the confidence he had","isChecked":false,"level":6,"score":"147"},{"author":"FitzyJay","body":"I've Planted almost 1 Million Trees- 920k","isChecked":false,"level":1,"score":"685"},{"author":"FlakyMortgage","body":"I've shot an actual RPG-7. Now if i was in the army that might be less surprising to others but i'm not. There was a range in Cambodia that let's you shoot it for a very steep price. \n\nOnce in a lifetime experience, tho i might go for twice in a lifetime if i ever go back there hehe.","isChecked":false,"level":1,"score":"2860"},{"author":"WholeGrainMustard","body":"I almost did this in Cambodia until I realized I had to go to the airport in a few hours. The risk of an explosives test at the airport followed by indefinite detention wasn’t worth it.","isChecked":false,"level":2,"score":"1225"},{"author":"PaleGutCK","body":"For the best, those ranges are typically run by corrupt military officials and fund the illegal arms trade.","isChecked":false,"level":3,"score":"633"},{"author":"iknowthisischeesy","body":"I fell off a roof (from about 12 ft height) to a concrete floor and did not have a single scratch as injury.","isChecked":false,"level":1,"score":"674"},{"author":"HouseCarder","body":"I did that off the roof of my dads shed. Freaking crazy! Landed flat on my back and after a second or two realized I was fine.","isChecked":false,"level":2,"score":"155"},{"author":"AkoOsu","body":"I can't burp. If I drink something with too much carbonation it makes me feel like throwing up and I have to wait for the little bubbles to make their way out one at a time.","isChecked":false,"level":1,"score":"462"},{"author":"twitchy_taco","body":"I'm allergic to meth. One of the main ingredients in meth is pseudoephedrine, which I'm deathly allergic to.","isChecked":false,"level":1,"score":"253"},{"author":"86_1","body":"A police helicopter picked me up by accident.","isChecked":false,"level":1,"score":"460"},{"author":"Anthoz","body":"I never knew if it hit me or close to me, but a bolt of lightning sent me flying a couple meters onto a wall when I was a kid. Walked it off completely unscathed but with newfound respect for thunderstorms.","isChecked":false,"level":1,"score":"239"},{"author":"Penguin4561","body":"I killed someone. Most people think I’m joking.","isChecked":false,"level":1,"score":"1693"},{"author":"YourHatredSustainsMe","body":"What's your story?","isChecked":false,"level":2,"score":"598"},{"author":"Penguin4561","body":"Well it’s significantly less interesting with the story, still kinda interesting I guess. This was ages ago and a man broke into my house. I was a teenager at the time living with my family. I heard something downstairs so I got up in the night and went down to the kitchen and I saw him standing there, dressed in black holding a bag. He immediately clocked me and i don’t know I guess he freaked out, he went for this sharp metal out of his pocket and I completely freaked out and, I guess out of instinct, just grabbed a kitchen knife and swung it. I hit him in the stomach and just started screaming and crying. My dad rushes downstairs and just looked at it all and called the police and ambulances. The knife was really long and I’d already taken it out his body. I was in shock and my dad tried to wrap tissue paper over the cut but he may as well have been dead already. He died on the kitchen floor. I was told all this after though, I was just in a really hazy state of shock and disbelief. Still just makes me feel, I don’t know, out of body talking about it.","isChecked":false,"level":3,"score":"2779"},{"author":"YourHatredSustainsMe","body":"I'm sorry to hear about this. I mean, I wasn't expecting a fun story, but it definitely sucks more to hear that this happened at such a young age. \n\nI can imagine something like this having a very severe impact on the rest of your life and I'd hate for that to haunt you in your further development. That said, I'm glad you was able to get on top of the situation and that your father was quick to try and take the right steps. I hope you are okay these days! Thanks for sharing!","isChecked":false,"level":4,"score":"921"},{"author":"iRan_soFar","body":"You protected your self and your family. You did nothing wrong.","isChecked":false,"level":4,"score":"659"},{"author":"GravyxNips","body":"First of all, it’s definitely an interesting story. Second of all, Jesus that’s intense dude.","isChecked":false,"level":3,"score":"311"},{"author":"smashedpancake","body":"I have orgasm synthenesia! But only from penetrative orgasm. Whenever I orgasm I see purple. Sometimes it's like a field of purple flowers or a whole bunch of grapevines or something, but it's always this lovely purple image, except the one time it was Barney the dinosaur, lol. Sometimes it's just a full picture of just a lovely lavender color, like my brain blanks on lavender.","isChecked":false,"level":1,"score":"841"},{"author":"fuckin_anti_pope","body":"Imagine nutting and seeing Barney the dinosaur looking at you.\n\nI kinda want that","isChecked":false,"level":2,"score":"624"},{"author":"None","body":"[deleted]","isChecked":false,"level":1,"score":"113"},{"author":"Arteragorn","body":"I was the best man on both sides of a lesbian wedding because I had dated both the bride and the bride, stayed close friends and introduced them to each other after our breakups.","isChecked":true,"level":1,"score":"43733"},{"author":"execdysfunction","body":"Where did you stand?","isChecked":false,"level":2,"score":"1723"},{"author":"Arteragorn","body":"Thank you to all the responses, it was definitely one of the most unique experiences of my life.  As for where I stood, I started on one side and they had a point in the middle of the ceremony where I moved to the other side.","isChecked":false,"level":3,"score":"3585"},{"author":"aurisor","body":"You know who else went over to the other side ayyyy lmao","isChecked":false,"level":4,"score":"4152"},{"author":"Csantana","body":"Benedict Arnold. \n\nAnd I will NEVER forgive him.","isChecked":false,"level":5,"score":"2032"},{"author":"Kaysic","body":"And in conclusion, Carthage must be destroyed.","isChecked":false,"level":6,"score":"124"},{"author":"iknowthisischeesy","body":"You, sir, are a true bro.","isChecked":false,"level":2,"score":"15235"},{"author":"TannedCroissant","body":"Yeah, he may not be a girl, but he was the best man they ever dated","isChecked":false,"level":3,"score":"10910"},{"author":"drlqnr","body":"Get out","isChecked":false,"level":4,"score":"1425"},{"author":"Robertiocoolman1","body":"Imagine turning two women lesbian after dating them","isChecked":false,"level":2,"score":"8513"},{"author":"Arteragorn","body":"I wish I could say it was only two.  LOL.  I have been informed by ex partners that I come across as a safe person and it makes people feel comfortable having me as a testing ground when they are unsure or a cover story when they aren't out yet.  Doesn't bother me, I take it as a compliment at the end of the day.","isChecked":false,"level":3,"score":"6809"},{"author":"slayer991","body":"All joking aside, it really is a testament to your character that they feel comfortable enough to be themselves.","isChecked":false,"level":4,"score":"3789"},{"author":"Arteragorn","body":"Thanks!  This will be my last response until I wake up, I have work in 8 hours.  Night all.","isChecked":false,"level":5,"score":"1898"},{"author":"buckyballss","body":"He even gave us heads up that he will not be responding to future comments. You sir is an upstanding citizen.","isChecked":false,"level":6,"score":"495"},{"author":"adastrally","body":"I'm a triplet and all 3 of us graduated college by age 19.","isChecked":false,"level":1,"score":"1380"},{"author":"CIAboy","body":"Whoa, that's cool. What did the three of you study?","isChecked":false,"level":2,"score":"156"},{"author":"adastrally","body":"Psychology for me, economics for both of them.\n\nTook two years off to work, then started grad school.  I'm 23 and in my 3rd year of a clinical psych PhD program now","isChecked":false,"level":3,"score":"289"},{"author":"Icecream_Sumbitch","body":"I caught a bird once","isChecked":false,"level":1,"score":"867"},{"author":"ASpaceOstrich","body":"I’ve had chronic constipation all my life. I’m shitting more frequently than ever before at the moment with a blistering 1.5-2 shits per week. The longest I ever went without was roughly a month, which resulted in passing something the size and consistency of a brick.","isChecked":false,"level":1,"score":"305"},{"author":"TimmeyTheTurtle","body":"Sorry to say this but\n#*HOLY SHIT*","isChecked":false,"level":2,"score":"70"},{"author":"PetitePrincessAriel","body":"I don't have joint sockets where my jaw connects to my skull.","isChecked":false,"level":1,"score":"212"},{"author":"cipherd2","body":"I was shot in the head and didn't go to the ER about it for 2 weeks.","isChecked":false,"level":1,"score":"206"},{"author":"PepperidgeFarmMembas","body":"I am related to an NFL player and you would never know it.  He’s 6’8, 265 and black; I’m 6’, 195 and white.  We’re second cousins through his mom (a 5’ 2 Irish woman) and grew up together very close and still stay in touch.  I get to see him a couple times a year and we pick up like nothing has changed.  Out of all the cousins I think he spoils me because I’ve never once asked him for anything and always turn down gifts because, as I keep telling him, it’s awesome enough to see what he’s become for himself and it’s gift enough that we’re still as close as we are.  It pisses me off when family shamelessly asks him for money, like wtf it’s not yours it’s his and he earned it.\n\n*EDIT* - I've had enough DM's asking so I'll just answer it here, we only get to see each other in person a couple times a year, but we text every day and facetime/voice call at least 3-4 times a week.  We are really close and I am so proud of him.  I also want to address the money thing, after his first year we talked and I told him he would end up just like all the athletes we laughed at growing up if he didn't hire a real financial manager and start investing his money wisely because he couldn't possibly predict everything and his career could get cut short due to injury at any time.  I can happily say he is very, very smart (smart enough that I know what he will do when he does retire) and has cut toxic people from his life who prioritized his money and not him.  When he signed his new contract, he had several funds set up to plan for his eventual retirement so he is set for life.  He tried to buy me a car/pay for my student loans as a thank you for the advice and I, you guessed  it, turned it down and reminded him what the hell did we just talk about.  Love him like he's my own brother.","isChecked":false,"level":1,"score":"102"},{"author":"totallyrandom09","body":"My old apartment building had 6 apartments in it. We were all low income, living paycheck to paycheck. Our landlord was was the meanest woman I have ever met. She was racist, homophobic, and downright cruel.  Over the years, she just became a nightmare. One day, she gathers all of the tenants up in the parking lot, and handed us all eviction notices. We were literally all in one large group, learning that we were all gonna be homeless in 30 days. There was an 80 year old woman named Thelma, who lived across the hall. She was old, and had no living family members. She was gonna end up homeless. My dad and sister both have multiple sclerosis. I was basically the only one who could move our belongings in 30 days, after work. We were gonna have to live with my uncle until we found a place. There was a single mother raising her son in the apartment below us. We were all going to be homeless...and the landlord didnt care.\n\nWe all had 30 days to leave the building. She was raising the rent by $300 dollars, and renovating the entire place.  She had the balls to show us the type of appliances she was putting in our apartments... She said we were all \"The saddest tenants she ever dealt with\". My father talked to the landlord and asked if she would reconsider her the eviction at all, due to the fact that all of the tenants were struggling. She pretty much laughed in his face, and said she was going to Vegas for the weekend, and \"Wont be accepting pity phone calls\"\n\nCut to October 3rd, 2017. I get home from work. My dad is watching the tv with a crazy look of astonishment on his face. He reads the victim list of the Las Vegas Shooting. Our landlord was one of the 58 poor souls that were gunned down. We were in a total state of shock. 3 days after the woman evicts 6 lower-income families from an apartment building, she is gunned down during a Las Vegas country music concert. She was a straight up nasty, cruel, evil person...but she DIDNT deserve to die. She was somebodys mother, daughter, wife.\n\nmy life changed from that moment on. I was afraid that if I treated someone poorly, or was mean to them, that karma would get me...I was depressed and riddled with anxiety. My life changed at that moment","isChecked":false,"level":1,"score":"197"},{"author":"Charl1edontsurf","body":"My maternal ancestors were assumed to be French, coming across with William the Conqueror. However, they've been found to be Norsemen, who came through England and into France to fight Charles the Fat. They then went back and fought Charles the Stupid. William granted them land for their loyalty. I just think it's amusing my family made their name by fighting against fat and stupid.","isChecked":false,"level":1,"score":"99"},{"author":"Mereatives","body":"(First comment ever) I helped prevent a terrorist attack on a prominent U.S. bridge. I’m a social worker. (Edit - see the details under the comment below.)","isChecked":false,"level":1,"score":"2010"},{"author":"faterthehater","body":"Whoa. Wanna share?","isChecked":false,"level":2,"score":"370"},{"author":"Mereatives","body":"Ok, my friends, here’s the story. (I’m also an author so this will probably come out a bit flowery - apologies.) \n\nI’ve always been good at getting people to bare their souls. I’m not manipulative, just empathetic. People can sense that I’m trustworthy. They open up to me. \n\nYears ago an elderly homeless man came through the line at the soup kitchen. I sat down with him and we chatted. He said he was from Iraq. That was all I got out of him that first day. \n\n3 months of conversations later, of me encouraging him to reveal more about himself, he finally admitted the truth: he was homeless because he escaped a sleeper cell that had been assembling in New York City over the course of 10 years. He was a member of Al-Qaeda. If his friends ever found him, they’d murder him for his betrayal. He’d had a change of heart and didn’t want to be a killer anymore. \n\nI’ve never felt so exposed and scared. I expected a bullet through my head. \n\nI told him that I had to tell the police about this. He said “I know. There’s something important I have to tell them.” \n\n“Why are you telling ME this?” \n\n“You make me brave,” he said. “You made me realize that the right thing to do is turn myself in.” \n\nWe walked, hand in hand, to the police station. The FBI came and picked us up (my friend insisted that I go with him). I shit you not - they arrived in a black SUV wearing black suits and fucking black sunglasses. I’m not sure what I expected - maybe to be driven to some secret underground bunker? - but we drove to another, bigger, police station. We sat in one of those interrogation rooms with the three agents. \n\nMy friend told them a little bit about his background. And then he said (I’m trying to remember this word-by-word), “My friends are planning an attack. I want to help you stop it... They’re going to blow up the Brooklyn Bridge.” \n\nI don’t know what happened next. I was escorted out of the room and was driven back to the soup kitchen. When I left I glanced back at my friend and he gave me one or those half-smile nods with trembling lips we all interpret as saying “Thank you.”\n\n(As I type this I feel my arms going numb. My fingers feel disconnected. My eyes feel hot. The few times I’ve told this story I always feel like I’m on the precipice of a panic attack). \n\nI like to think that my friend gave the FBI the location of the sleeper cells and his ex-comrade’s names. I like to think he was rewarded and he isn’t in Guantanamo Bay. I like to think he’s somewhere safe in witness protection or something. \n\nWhatever happened... all I know for sure is that bridge still stands. My very, very minor role in all this may seem trivial, but I find it significant. Sometimes a pair of ears and an inviting spirit can do more for this country than a gun.  \n\nTry today to help someone be brave!\n\n(Edit: to clarify, I’m a woman)","isChecked":false,"level":3,"score":"1877"},{"author":"drlqnr","body":"that was a good read. you're a hero","isChecked":false,"level":4,"score":"252"},{"author":"Yarragh","body":"I once fished a bird out of the sky. \n\nI casted my reel and the line caught a damn passing bird. It plummeted directly into the lake and almost got eaten by alligators.","isChecked":false,"level":1,"score":"355"},{"author":"r0x0r","body":"I was born last millennium in the country and that city that both no longer exist.\n\n\nI was born in Leningrad, USSR.","isChecked":false,"level":1,"score":"277"},{"author":"TewsdayAddams","body":"I cannot see images in my mind’s eye when I imagine something. It’s called Aphantasia and it’s a relatively new concept that is still currently being researched, I believe. If you were to tell me to close my eyes and imagine an apple, I do not “see” the apple. I see black lol. I know what an apple looks like through memory, and I can describe an apple, but I cannot “see” it in my mind. \nAlmost all of my imagination consists of conversations, verbal remarks, and music. If someone asks me to recount a memory of a concert, for instance, I don’t see the stage or how it was set up, but I instantly recall the music.","isChecked":false,"level":1,"score":"271"},{"author":"lifeisledzep","body":"When I was 11 years old my chihuahua named Taco was stolen by an eagle while I was distracted watching two lizards hump. In traumatic shock, I watched the dog fly off into the sunset in the grasp of the eagle’s talons \n“TACO NOOOOOOOO!”","isChecked":false,"level":1,"score":"633"},{"author":"umbrellajoe","body":"I feel awful for poor Taco, but I just needed you to know that this comment singlehandedly sent me into hysterics and I cannot stop chuckling over it. Full on cry-laughing over here. That poor dog. Poor you. I can’t breathe.","isChecked":false,"level":2,"score":"146"},{"author":"teilzeitfancy","body":"Not about me:\nMy mother moved to a third world country when she was little.\nHer father tried to auction her off to potential husband's, but she escaped with the locals drug dealer. Married him, had my sister. Sister almost died of pneumonia, she wanted to leave him. He tried to shoot her, she fought him and escaped with sister.\nMet a millionaire, had my brother.\nHad 3 miscarriages and it turned out his ex girlfriend had cursed my mom and there was a voodoo doll of her in the garden, buried underneath. They burned the doll, my mom got pregnant.\nMillionaire-Man didn't want the child, hired men to kill mother.\nMother escaped to home country with kids, heavily pregnant.\nHad my brother, worked for a while, met my dad through an ad. Turns out he'd been in prison for the 20th time and wanted a companion. They married, had me and my brother, got divorced cause dad became an alcoholic. Got married again and divorced this year.\n\nI swear, most of my friends don't believe a word when I tell them about my family. Until my mom tells them.\n\n\n\nEdit: I just told my mom I posted her story here and translated the comments for her.\nShe was so, so happy people took their time to read her stories. \n\nShe also said: \"Daughter, I know you can write. I've got a lot more. The worst stories. I never told you, but if you want to write them down, I will\".\n\nNow she's telling me about all the shootings and the corpses she witnessed as a child. Oh lord.","isChecked":false,"level":1,"score":"685"},{"author":"brown_paper_bag","body":"Just to make sure I read this correctly:  \n\n* 1 child (sister) with local drug dealer  \n* 2 children (brothers) and 3 miscarriages with Millionaire Man  \n* 2 children (you & brother) with your father\n\nSounds like your mom has had quite an extraordinary life. I hope she's well.","isChecked":false,"level":2,"score":"253"},{"author":"Game_of_Jobrones","body":"I've published four peer-reviewed scientific papers on hamster testicles.\n\nEDIT - Holy shit.  I never thought I would write this, but \"RIP my inbox\".\n\nI'm currently working on a critical COVID-related project which doesn't involve testicles and thus would be much less exciting for Redditing purposes :)","isChecked":false,"level":1,"score":"38874"},{"author":"TannedCroissant","body":"That’s quite the achievement but why didn’t you publish them in journals.","isChecked":false,"level":2,"score":"6543"},{"author":"MinimalistFan","body":"This reminds me of a column I read in the Dallas Morning News 20+ years ago about the woman who was the first head of the insect zoo at the dinky little natural history museum.\n\nShe had been a biology major and into bugs and was working in a lab when a friend found out that the museum was looking for a director for its new bug zoo. She got a phone interview with some museum bigwig, who asked what she was currently doing. She replied, “I’ve been dissecting female mosquitoes to find out if they’re virgins.”\nHe replied, “You’re hired.”","isChecked":false,"level":2,"score":"9763"},{"author":"Clemantthegymleader","body":"How do you dissect a mosquito? They're so small, must be really difficult...","isChecked":false,"level":3,"score":"2302"},{"author":"Sultan_Of_Ping","body":"They have tiny scalpels. Made for ants.","isChecked":false,"level":4,"score":"2111"},{"author":"Jaewol","body":"That’s nuts","isChecked":false,"level":2,"score":"7827"},{"author":"michaelm63","body":"My birthday is 01/02/03 and I was born at 4:56 in the morning, if that ain’t weird enough I was 7 pounds 8 ounces at birth. So yeah, all my documents look fake as shit.","isChecked":false,"level":1,"score":"92"},{"author":"tinydre","body":"My stomach is in 2 parts. I have hiatal hernia so a part of my stomach pushed thru the diaphragm and sits above the diaphragm and the other portion sits below it. \n\nI joke it’s a pre party stomach leading to the main event","isChecked":false,"level":1,"score":"617"},{"author":"Rezzone","body":"I had a diaphragmatic hernia when I was little. No one had any clue until one night I got kicked in the stomach while roughhousing with a friend. Within an hour I was turning gray, puking, essentially dying right then and there. The kick had pushed my intestines and part of my stomach up into my chest cavity. They were constricting my heart and lungs.   \n\n\nNeedless to say after a very awful night of emergency testing to figure out why I was suddenly dying, I was put under for surgery at like 3am. I was seven years old.  \n\n\nThen in middle school we discovered I had an inguinal hernia that didn't present normal symptoms because of the other hernia. Usually inguinal hernias are discovered in infants. Turns out intestines only go one direction or the other. Had to get that corrected too. I kinda miss my third intestinal testicle.","isChecked":false,"level":2,"score":"130"},{"author":"Klown1327","body":"I had a dream about the 2017 Las Vegas shooting about a week before it happened","isChecked":false,"level":1,"score":"455"},{"author":"foundoutaug2019","body":"On the morning of one of the terrorist attacks on my city I woke up with a feeling I shouldn't use public transport that day, so I took a taxi into work.\n\nIt could be a coincidence, but maybe not.\n\nI've had prophetic dreams too, but they are usually about mundane things. I had one last week.","isChecked":false,"level":2,"score":"221"},{"author":"kmkmrod","body":"I went to give blood and found I have a blood disorder so my state wouldn’t take it, but the nurse said the neighboring state not only WILL take it, they give it to pregnant women.  How stupid is it that?  It’s not good enough for my state but the next state over gives it pregnant women. \n\nSo I drive 45 min every 112 days and donate. I’m up to 3 gallons so far 👍","isChecked":false,"level":1,"score":"172"},{"author":"megthegreatone","body":"Probably my entire medical history - if you hear it all you're definitely getting into \"oh ok yeah right\" territory. Some highlights:\n\n* I had a 32-pound ovarian cyst when I was 12 and another (5-pounds) when I was 14\n* I have permanent double vision and had NO IDEA that most people did not see two of everything in their peripheral vision until like last year (I'm 28)\n* I suffered from chronic pain and was constantly in the ER for very severe abdominal pain to the point that everyone there thought I was a drug addict. After about 10 specialist visits, turns out that I have a severe but atypical irritation to dairy \n* I have a bizarre psycho-neurological issue that makes it so I lose my ability to walk if I get too stressed with absolutely no underlying cause\n\nI have never made anything up medically but I rarely go to doctors anymore because they generally stop beleiving me/think I'm faking and hearing \"yeah we have absolutely no idea\" every time just gets tiring.\n\nEDIT: Here's a few more of anyone is interested\n\n* I recently developed some kind of resistance to anesthesia. I woke up during a colonoscopy and an endoscopy and have not been able to have one of my teeth fixed because the numbing stuff was just not working at all\n\n* I had to have an emergency root canal on a tooth I already had a root canal on because the first one \"didn't get everything\" and I very very narrowly avoided oral surgery (this was, thankfully, before the anesthesia resistance started)","isChecked":false,"level":1,"score":"834"},{"author":"None","body":"[deleted]","isChecked":false,"level":1,"score":"635"},{"author":"thebaldfrenchman","body":"Was pistol whipped then shot in the face during a mugging. Large portions of my upper lip were missing. The plastic surgeon reconstructed it with labia tissue from a recently deceased organ doner.","isChecked":false,"level":1,"score":"171"},{"author":"JayDenWeirdo","body":"When I was in primary school, I was one of the smartest kids in school. I got straight A's on every test, could do math without needing a pen and paper, and had an IQ of 150 with potential to reach 170 as I got older. Because of this, I always ended up going on special field trips and doing advanced classes and tests. \n\nI was also getting letters. I would get letters from special camps, colleges, and even some universities. One letter was from DC. They were picking gifted children to meet the president. I was one of the ones picked. Of course I never got to go. My family was very poor and my stepfather was an abusive asshole.\n\nOne of the reasons that this is unbelievable is that I'm not smart anymore. Even after getting away from my stepfather, I still dealt with PTSD, anxiety, depression, and suicidal thoughts. I fell behind in school and my grades suffered. Then my mom's health got worse and I dropped out of school to get a job. Now I'm 20 and am just now overcoming my mental problems and am working towards getting my GED.\n\nEdit: Thank you all for the positivity and supportive comments. I don't hear stuff like that very often and it means a lot to me to know that there are such nice people out there!","isChecked":false,"level":1,"score":"305"},{"author":"MrSmileyMcSmiles","body":"I have been involved in 2 bike crashes, 2 bus crashes, 1 drive by bus shooting, and 1 major car crash by the age of 17. None of them I am responsible for and didn't have to pay a dime for damages.","isChecked":false,"level":1,"score":"238"},{"author":"uffdaiprocrastinated","body":"My dad was on the drug task force and he did a stake out from our living room window for the house across the street from us. His coworkers and himself were in our living room with all the equipment needed and when they sent in the undercover person they caught on tape the person saying “we have to be careful fucking (dads name) across the street is a cop.” Everyone burst out laughing and almost disrupted the investigation. I was about 8 at the time and thought I was a total badass because I got to ‘help’ my dad in an investigation.","isChecked":false,"level":1,"score":"368"},{"author":"SteveWhitman","body":"My nose is crooked because my mother hit me with the kitchen sink. \n\nWhen I was eleven I was leaning into the sink to clean a bowl, my mother swiveled the faucet thinking it would swing right in front of me but I was in perfect position for it to hit me directly across the nose. It broke pretty clean but healed crooked on my face. It isn’t at a crazy angle and I can breath and use it (mostly) normally, but after folks look at my face long enough they always notice “somethings not quite right”\n\nIt was a complete accident and she is a fantastic mother but she made me promise to never tell anyone how it happened (sorry mom)","isChecked":false,"level":1,"score":"164"},{"author":"grannybubbles","body":"I was once the trainer of the world's smallest horse.","isChecked":false,"level":1,"score":"84"},{"author":"BouquetofDicks","body":"There was a successful manga series in Japan where I was the main character. Real life name, looks, clothes and everything. \n\nI didn't know it at the time, but my new friend was a very famous manga artist and we had several adventures together (more like I showcased my city/country off while they were visiting). \n\nAnyways, about a year after the author returned to Japan, I receive a parcel in the mail and inside was the signed first episode of the manga . The series became a hit and several more were made.\n\n*Edit: Sorry, I don't want to say the name of the manga series. It was very popular and the main character is literally me. My real name, looks (as far as a manga character can resemble a real person), where I lived etc is all there so I don't want to give up my anonymity.","isChecked":false,"level":1,"score":"939"},{"author":"rpgfan87","body":"omg are you Naruto???","isChecked":false,"level":2,"score":"624"},{"author":"Basti52522","body":"Omg Goku I always knew you were real!","isChecked":false,"level":2,"score":"162"},{"author":"PhoenixSelarom","body":"I had a speech class in college and had to do a speech on any topic of my choosing in front of the class with a PowerPoint and everything. The night before I had absolutely nothing, not even an idea what to speak about. Its now 5am the day of the presentation and still nothing and I'm desperately trying to think of something to BS for this and then it hits me: I will BS a speech and PowerPoint in like 3 hours about how to get away with bullshitting a speech.\n\nFor example, my speech's second point was to simply restate everything using different phrasing (classic technique) and my 3rd point was literally the same phrased differently to illustrate the point. It was funny seeing the class slowly realize what was happening on that part cause many were surprisingly slow on the uptake. I also included a slide from my previous speeches PowerPoint (about surviving bear attacks in Florida???) on purpose to make it even shoddier.\n\nAfterwards I walk to the teacher who was instantly grading us afterwards and he gave me an A. I literally turned to the class and was like \"holy shit, I can't believe that worked.\" Thankfully my best friend was in that class so I have a witness and honestly I wouldn't have been comfortable enough to do it otherwise.","isChecked":false,"level":1,"score":"299"},{"author":"themasterperson","body":"I was robbed by monkeys","isChecked":false,"level":1,"score":"159"},{"author":"TheBrinyolf","body":"I was born with 4 kidneys. My body has now absorbed 2 of them and 1 has shrunk a bit.","isChecked":false,"level":1,"score":"72"},{"author":"w1nterness","body":"I was born below sea level, exactly 100 years after J. R. R. Tolkien.","isChecked":false,"level":1,"score":"1492"},{"author":"HITHEREIS","body":"Explain?","isChecked":false,"level":2,"score":"204"},{"author":"GotGhostsInMyBlood","body":"There are many places in the world with dry land below sea level. https://geology.com/below-sea-level/","isChecked":false,"level":3,"score":"336"},{"author":"w1nterness","body":"[It's not that uncommon](https://en.m.wikipedia.org/wiki/List_of_places_on_land_with_elevations_below_sea_level) but it sounds cooler when you say it that way :)","isChecked":false,"level":3,"score":"73"},{"author":"aaronpbentley","body":"I did not get my first tooth cavity until age 40.","isChecked":false,"level":1,"score":"611"},{"author":"floorwantshugs","body":"You are one of those people who make me sure that dental hygiene is luck and genetics more than anything else. I've always taken meticulous care of my teeth, being gentle but thorough. Brushing, flossing, water pick, mouthwash, the whole nine yards. And yet I always have cavities.","isChecked":false,"level":2,"score":"342"},{"author":"The_RATifier","body":"I've never been on pornhub","isChecked":false,"level":1,"score":"600"},{"author":"BrexFlexx","body":"Most impressive so far","isChecked":false,"level":2,"score":"197"},{"author":"mildlydrifting","body":"When I was born some of my organs were in the wrong places. The doctors put me in NICU and told my parents not to get too attached. The next day they checked and all my organs had migrated into the correct places. \n\nMaybe this isn't true but if it is a lie it's a pretty well coordinated effort on my entire extended family going on for the past 35 years.","isChecked":false,"level":1,"score":"215"},{"author":"NoMeowNoFun","body":"I was almost beaten to death by my stepfather when I was a child, he also molested me. I ran away and became a drug addicted prostitute, extremely poor and with no place to go.  Then I was saved by a cat (in fact, the bestest cat) and now I am writing my PhD, am an expert on my science field, a well known political activist and will soon publish my 8th book. That's it.","isChecked":false,"level":1,"score":"209"},{"author":"Sparkmaiker","body":"I have a scar on my left eyebrow from getting ran over by a shopping cart when I was 3.","isChecked":false,"level":1,"score":"76"},{"author":"Mother-Bored","body":"I never learned how to ride a bike.","isChecked":false,"level":1,"score":"973"},{"author":"Miki1A","body":"I'm going through a hard time where I can remember conversations and questions I had with people from ten or so years ago, but I cant remember their faces; and if I do remember their faces, i start to have a panic attack where I *just need a hug to know that it's him or her*. \n\ntldr: hug me if you know me.","isChecked":false,"level":1,"score":"135"}],"id":"fruade","submissionData":{"author":"dontaskmeforfeetpics","body":"","score":"77072","subreddit":"AskReddit","title":"What is something about yourself that sounds totally made up but is 100% real?"},"url":"https://www.reddit.com/r/AskReddit/comments/fruade/what_is_something_about_yourself_that_sounds/"}