{"commentsData":[{"author":"eggsmashumactually","body":"I served Daniel Radcliffe his dessert at an event, and tripped and spilled some of it on him, probably due to seeing that I was serving Daniel Radcliffe, and he stood up and started apologising profusely to ME. Was very sweet and asking if I was ok.","isChecked":true,"level":1,"score":"3265"},{"author":"peterdpol","body":"The correct British response! I like\nHow fame never seemed to Give him a big head","isChecked":false,"level":2,"score":"751"},{"author":"Frednotbob","body":"From what I understand, fame almost *destroyed* him.  The stress of being 'Harry Potter' (and the uncertainty as the film series ended) contributed to a fairly serious drinking problem.\n\nI was happy to learn that he's been sober since 2010.  More power to him!","isChecked":false,"level":3,"score":"1"},{"author":"jetsam_honking","body":"He did an episode of Who Do You Think You Are? last year, and you could tell from his interactions with the genealogists/historians that he has some social anxiety and his fame hasn't gone to his head at all.","isChecked":false,"level":2,"score":"1"},{"author":"LOUDCO-HD","body":"Years ago working hotel security in Edmonton I was escorting Dolly Parton and Kenny Rogers at 0400 in the elevator down from their rooms to the lobby to get in their Airport Limo. I am 6’5”, and so I towered over her. Dolly looked me up and down and said in her cute southern drawl “they sure grow ‘em big up here in Canada!” She was just as sweet as you could imagine.\n\nKenny, on the other hand, and I feel bad for saying this, due to his recent passing, treated me like the help (which I of course was) and even made a huffy impatient noise when, slightly flustered by Dolly’s remark, I struggled to find the key to put the elevator into independent service. Dolly touched my arm, looked me in the eye, and said “Darlin’, don’t you pay him any attention, we appreciate y’all!”\n\nI guess I got the good and the bad in one shot.","isChecked":false,"level":1,"score":"3452"},{"author":"Braelind","body":"Jesus, Dolly has got to be one of the most wholesome people to ever walk the earth!","isChecked":false,"level":2,"score":"808"},{"author":"Hotdogs-Hallways","body":"I named my car Jolene in Dolly’s honor","isChecked":false,"level":3,"score":"174"},{"author":"High_Stream","body":"Careful, that car will take your man!","isChecked":false,"level":4,"score":"72"},{"author":"cthefish","body":"Ive never met dolly parton but she seems like an absolute sweetheart!!","isChecked":false,"level":2,"score":"47"},{"author":"starstarstar42","body":"I met John Candy on a plane when I was a little kid while traveling with my family.  He was a *big* man. He had the whole row to himself in front of us with the armrest up between seats so he could be more comfortable.   The stewardesses were blocking anyone from coming up and bothering him, even though they themselves were not exactly leaving him alone what with  talking to him constantly and laughing at his enjoyable banter the whole trip.\n\nAt some point he got up to go to the bathroom. When he came back he looked at me, pretended to do a double-take like he was surprised and said , \"hey, you're the quietest kid ever, don't you talk?\"  The way he said it was so friendly that I just smiled and giggled. Then he had a pleasant conversation with my parents, who had been DYING to talk to him the entire flight, but were too polite to bother him.\n\nNot even 2 weeks later we heard he had passed.","isChecked":true,"level":1,"score":"24343"},{"author":"nola_mike","body":"> \"hey, you're the quietest kid ever, don't you talk?\"\n\nI literally heard him say that in my head as I read it.","isChecked":false,"level":2,"score":"7495"},{"author":"eskamizzle","body":"Those eyes.","isChecked":false,"level":3,"score":"1592"},{"author":"Yoiks72","body":"I just imagined his “hidden pain” look from the end of Planes, Trains and Automobiles and it made me sad. \n\nTangentially, does that movie have an Oxford comma or no?\n\nEdit: Removed Oxford comma","isChecked":false,"level":4,"score":"69"},{"author":"TenebraeVisionx","body":"Did he take his shoes and socks off? “Dogs are barkin’”.","isChecked":false,"level":2,"score":"1641"},{"author":"starstarstar42","body":"Ha! Actually I remember he had a very inexpensive, almost cheap looking, cardigan sweater on.  Had it been anyone other than John Candy, I don't think anyone would have paid this man any mind at all.\n\nWe saw him one more time after disembarking the plane.   There were two men waiting for him at the luggage pick up area, both impeccably dressed.  They had hand-stitched logos on their blazers that said \"Hatteras Yachts\".   I guess Mr. Candy was there to buy a boat or something.  Sad to think he likely never got a chance to enjoy it.","isChecked":false,"level":3,"score":"999"},{"author":"Jandalf81","body":"A man with the name of _Candy_ cannot ever be evil, right? \n\nPlease note:  \nThis was written completely free of irony and sarcasm!","isChecked":false,"level":2,"score":"477"},{"author":"brucewillischugswine","body":"Calvin Candie would like a word with you","isChecked":false,"level":3,"score":"35"},{"author":"TheJadedSF","body":"John Candy in a plane bathroom, sounds like that scene from Tommy Boy lol\n\nBut seriously sounds like a warm guy, passed too young ;(","isChecked":false,"level":2,"score":"504"},{"author":"ac1dre1gn77","body":"He seemed like he was an excellent guy. I miss his movies.","isChecked":false,"level":2,"score":"272"},{"author":"krinklekut","body":"That's awesome. I also met John Candy when I was a kid. I had a relative working on the crew of one of his movies. My sister and I were allowed to visit the set one day and he came and talked to us (He totally did not have to because he was the star of the movie and our uncle was a working crew member. Not a hot shot or anything.). He was super nice. I was really little so I don't really remember exactly what he said to us, but I remember him being really fun. He was like a big kid.","isChecked":false,"level":2,"score":"35"},{"author":"BroadStreetElite","body":"John Candy had a tragic life, I always assumed he died in his fifties, he was only 43.  His father also passed in his thirties.  He told people the men in his family always died young so he wasn't too fussed about his weight, he always knew he wasn't long for this planet.\n\nTerrific dude though, you saw the guy and just got a sense of warmth from him.","isChecked":false,"level":2,"score":"38"},{"author":"tikikatt","body":"I met A few celebs working as an event photographer for fundraisers from time to time.\n\nChevy Chase, well, the stories are true. He was a huge jerk.\n\nJamie Lee Curtis was one of the sweetest people I've ever met, bar none and easily the nicest celeb I met working the camera. Very considerate and thoughtful person. She kept checking with us to see if she could do anything for us or if we needed any more shots she could help with. Great sense of humor too.","isChecked":true,"level":1,"score":"2232"},{"author":"GSSari","body":"Jamie Lee Curtis seems to do a good job remembering her extras. They did a bit on James Corden's show and she picked out the lady that did a scene with her several years ago.","isChecked":false,"level":2,"score":"97"},{"author":"IamCaptainHandsome","body":"I've heard that Pierce Hawthorne was basically just Chevy Chase.","isChecked":false,"level":2,"score":"57"},{"author":"nstb21","body":"Met Dave Chappelle a few years back. Long story short, a friend of a friend got me and two friends into an after party. We were sitting at the bar when his manager offered us some shots. We talked with his manager for a while. Then Dave sat down near us. Dave was kind of sitting by himself and he looks over at us and goes “What’s going on fellas?” And we talk to him for about an hour. We thanked him for coming to our town, talked about music, sports, all kinds of stuff. Super cool dude. One of my favorite memories.","isChecked":true,"level":1,"score":"7247"},{"author":"thestereo300","body":"What going on fellas?\n\nI read that in his voice.","isChecked":false,"level":2,"score":"2570"},{"author":"DannySaiz","body":"It’s impossible not to.","isChecked":false,"level":3,"score":"94"},{"author":"icarus_swims","body":"Is there any other way to read it?","isChecked":false,"level":3,"score":"41"},{"author":"josecuervo2107","body":"In his white voice","isChecked":false,"level":4,"score":"50"},{"author":"SenorEsclavo","body":"Also met Dave once at a Starbucks at Wright State where I attended college (Dayton, OH) absolutely a fantastic guy","isChecked":false,"level":2,"score":"48"},{"author":"sendgoodmemes","body":"My mom and sister met the Rock when he was still a wrestler. They had a couple car seats and tons of bags having a hell of a time getting off the plane and people were waiting and then this massive guy offered to carry some things for them and they happily took the help, he grabbed some bags and held the baby carrier with my niece in it and helped them off the plane and left. After people kept going up to them asking how they knew the rock and they were very confused until someone explained who he was.","isChecked":false,"level":1,"score":"12664"},{"author":"TannedCroissant","body":"Everything I ever hear about him he’s super cool.  He [did a rap](https://reddit.app.link/6bYQSntiy5)  from Moana with some dude interviewing him for the guys kids because the guys kids were massive Moana fans.\n\nI reckon he’s so nice that on the aeroplane, I bet you he let the person next to him have the armrest.  He probably thought this isn’t the Rock’s elbow room, this is the people’s elbow room.","isChecked":false,"level":2,"score":"8815"},{"author":"RonnieHasThePliers","body":"I wish I could upvote more than once for that fantastic people's elbow room line. Made my day!","isChecked":false,"level":3,"score":"1005"},{"author":"Fulgurata","body":"Upvoted him for you","isChecked":false,"level":4,"score":"32"},{"author":"NotClayMerritt","body":"I believe every good story I hear about The Rock because there's not a single person on this Earth who seemingly has a bad thing to say about him. They all say that he's nicer than he has any right to be and lives like a regular guy, with a kind heart despite him being the most famous person in the world.","isChecked":false,"level":3,"score":"42"},{"author":"kryten2k35","body":"The Rock literally is the greatest guy. One of the few that managed to do the Wrestling biz and come out relatively unscathed.","isChecked":false,"level":2,"score":"61"},{"author":"christo334","body":"Damn I only met Dwane Johnson. They were so lucky","isChecked":false,"level":2,"score":"33"},{"author":"cridhebriste","body":"Guy I knew well did work at his house- Rock used his legal name so he was surprised the first time. He was very friendly offering food and beverages, etc.  Every time he went back over the years Dwayne remembered his name and asked about things and people they’d talked about a year or two before. All around genuinely friendly guy no arrogance at all and a funny sense of humor. The guy beamed when he talked about his client.","isChecked":false,"level":2,"score":"31"},{"author":"weekendbrainsurgeon","body":"I met Vin Diesel at a truck stop diner when I was a kid.  \n\n\nIt was like 4 in the morning and me, my grandpa and vin and his friend were the only ones in the diner, and we ended up getting sat at the table next to them. \n\nVin and a friend were getting ready to go on some fishing trip which was made obvious by the clothes they were wearing. My grandpa struck up a conversation about fishing with him, completely oblivious to who he was. He was a really nice guy and apparently knew a great deal about fishing techniques. \n\n\nI was a bit geeked out and didn’t say much or contribute to the conversation but I spent the next hour of our road trip explaining to my grandpa who vin diesel was and why it was a huge deal we just met him.","isChecked":true,"level":1,"score":"6385"},{"author":"tennisdrums","body":"I bet for Vin it was probably refreshing to have a casual conversation with someone about a personal hobby that didn't center around his celebrity status.","isChecked":false,"level":2,"score":"1422"},{"author":"Creeggsbnl","body":"\"THAT GUY DOES MOVIES, GRANDPA\"\n\n\"Shh, did you remember what he said what type of bait is best for...\"","isChecked":false,"level":2,"score":"2153"},{"author":"michaltee","body":"Did he offer you any beer, as long as it’s a Corona?","isChecked":false,"level":2,"score":"58"},{"author":"DontTellMyLandlord","body":"Man, this is such a prime example of why grandpas are just the best.","isChecked":false,"level":2,"score":"44"},{"author":"tommyboy6733","body":"I was working on a set once where John C. Reilly acted as one of the main characters. It was a pretty small set and low budget (not even sure if the show ever aired) so we all found ourselves working closely together for the most part.\n\nI sat across from him during lunch one day and we chatted for a bit about random stuff. The guy talks the same way he acts, which is why I think he plays such a great character in any comedy because he quite literally plays his own attitude in many roles.. at least it seems. \n\nBut anyway he was a very nice and down to earth guy, I found it hard not to giggle every time he spoke because I just couldn't shake the image in my head of all the roles he's played.","isChecked":false,"level":1,"score":"3115"},{"author":"GunnerBax","body":"[Check It Out! with Dr. Steve Brule](https://www.adultswim.com/videos/check-it-out-with-dr-steve-brule) ?","isChecked":false,"level":2,"score":"282"},{"author":"Alexallen21","body":"Turn the machine off I’m dry!","isChecked":false,"level":3,"score":"57"},{"author":"uvegotthelove","body":"For your health!","isChecked":false,"level":3,"score":"36"},{"author":"elevenghosts","body":"I met him at an event like 10 years ago. He was very pleasant and gregarious with us before moving to chat with other people. Later in the night, one of my friends comes back from the bathroom and says \"I just had a really awkward interaction with John C. Reilly.\"\n\nApparently, he was finishing a phone call at the dead end of a hallway past the bathroom when my friend walked by. My friend had a poster from whatever movie he was promoting, and asked him to sign it. And he got very anxious, and clearly did not want to sign it but I guess felt boxed in so he signed it quickly and rushed off. My friend's like \"What the hell? He was so nice earlier.\" Then later on we find out he's really nice but doesn't like giving autographs.","isChecked":false,"level":2,"score":"40"},{"author":"rain-dog2","body":"When I was a teenager, I met Neil Armstrong at a retirement ceremony that my dad brought me to.  It was at a museum and it was a private event.  There was time for everyone to wander the museum, and my dad saw Mr. Armstrong looking at one of the planes that my dad helped design. Nobody else around.  They struck up a conversation and Neil asked me questions about what I was studying and how I felt about the work my dad did (my dad worked on classified planes when I was much younger).  He seemed like such a gentle guy to me.  A bunch of other men suddenly joined as and started asking him for autographs, which he declined.  It seemed to snap him out of his happy mood, and he kind of shut down and walked away.  At that time I thought he was a bit of a jerk for not saying goodbye or anything, but I recently read about the hard time he had with fame, and I guess it makes sense.","isChecked":false,"level":1,"score":"9490"},{"author":"AllthatJazz_89","body":"Sounds like he’s really nice, but overwhelmed with the accidental stardom. I don’t blame him. I’d be the same way after years of that.","isChecked":false,"level":2,"score":"3360"},{"author":"TannedCroissant","body":"Don’t you mean accidental *moon*dom?","isChecked":false,"level":3,"score":"2756"},{"author":"willis1988","body":"Genuinely amazing that you got to meet him, and 1 to 1 (with your dad) at that. He'll always be a one of a kind for what he achieved so you should feel very lucky to have met him :)","isChecked":false,"level":2,"score":"1100"},{"author":"rain-dog2","body":"Thanks. My dad was thinking the whole time “I should ask for an autograph” but he realized after the crowd showed up that the best you would’ve gotten from him was a conversation, and my dad got that. Nothing to put on your mantle, but a special moment still.","isChecked":false,"level":3,"score":"649"},{"author":"lucky_ducker","body":"In general, fond memories are better than mementos.","isChecked":false,"level":4,"score":"39"},{"author":"zerbey","body":"Armstrong was an engineer and preferred to just stay out of the limelight, I'm sure he enjoyed the chance to just talk engineering stuff with someone.","isChecked":false,"level":2,"score":"706"},{"author":"IrascibleOcelot","body":"From a lot of interviews, Armstrong stated that if he knew what being “the first man on the moon” meant, he wouldn’t have done it. Buzz Aldrin’s got a bit of an ego and *absolutely* would have done it.\n\nWhich is why NASA made sure Neil went first.","isChecked":false,"level":3,"score":"570"},{"author":"pixel_of_moral_decay","body":"I’ve read this as well.\n\nBuzz was a bit of an egomaniac, not who they wanted with that distinction. But brilliant, quick thinker and always cool under pressure.\n\nArmstrong wasn’t their first choice (he became the choice after the Apollo I fire), but he was the better person for the task.\n\nLikewise Collins wasn’t a random pick either. He was also considered ideal for that role and this mission. Totally underrated part of the team. He’s a brilliant speaker/writer.","isChecked":false,"level":4,"score":"195"},{"author":"zerbey","body":"That's my understanding too, he had the proper personality to get the job done without letting it all go to his head.","isChecked":false,"level":4,"score":"227"},{"author":"WatchTheBoom","body":"I ran into Adam Sandler outside of a Planet Fitness in Brooklyn in early 2016. \n\nAs I was leaving the Planet Fitness, it looked like he was walking in. We made eye contact, so I stopped and held the door for him. He got to the door and stopped right before he walked through, in one of those fake poses that little kids make when you tell them to freeze. I stood there holding the door, plenty confused. For about five seconds, we just stood there- him, motionless and I, standing there holding the door. Finally, he turned his head and said in the stereotypical Adam Sandler voice, \"Ahhh, who we kidding? I'm not going in there!\" Giant grin on his face. We both laughed and then he continued down the street. \n\nAwesome.","isChecked":true,"level":1,"score":"33008"},{"author":"Joey_AP2","body":"He was in my town in NY shooting something for Netflix a few years ago. When he was done for the day he went down to the local park and started playing pickup games of basketball with people.","isChecked":false,"level":2,"score":"5468"},{"author":"norcaln8","body":"I went to Grad school at Pepperdine in Malibu, down the road from where he lives. Adam used to come a play pick up ball on campus pretty often. Nice guy for sure.","isChecked":false,"level":3,"score":"2529"},{"author":"Pacdoo","body":"I met him down in Nantucket one summer a few years ago. I had no money and so he bought me and my friends a pizza and shared it with us. Probably the greatest moment of my life.","isChecked":false,"level":2,"score":"10075"},{"author":"RemarkableNebula","body":"Where’s the picture? You HAD to take a picture.","isChecked":false,"level":3,"score":"2065"},{"author":"SufferingWithYou2","body":"He shook my hand before I went to pee. Then when I reentered the comedy club he asked me how it went. \n\nIt was glorious.","isChecked":false,"level":2,"score":"2423"},{"author":"elevenghosts","body":"I saw him do standup in the mid-90s and afterward noticed him waiting for his ride. So my friend and I went to say hello. He was really funny and self-deprecating, and kept ignoring the woman trying to get him to stop talking with us and get in the car. Pretty cool.","isChecked":false,"level":2,"score":"1772"},{"author":"spwf","body":"Sandler is great. Whenever he comes into my job, he’s always a class act. He jokes around with the staff and is always super polite and grateful for the service.\n\nYou wouldn’t believe how much your fandom of someone is affected by how they are in real life. Before Sandler was a regular at my job, I liked some of his movies but since he’s come in a bunch I think he’s great and I found myself watching more Sandler stuff.","isChecked":false,"level":2,"score":"1361"},{"author":"mrpriveledge","body":"Same here.  He was a regular at my job in Santa Monica. Kevin James brought him in for his birthday.  Gave Adam my card/number but he never calls before he comes in,  doesn’t expect anything special.","isChecked":false,"level":3,"score":"600"},{"author":"spwf","body":"Yeah that’s always my favorite thing about celebs, when they don’t draw attention to themselves. I’ve had celebrities call ahead and request to use the side of back entrances, they ask when the “best” time it would be to come in unnoticed, etc. It’s like “okay, dude/lady”. Sandler just strolls in, either by himself or with his family, just all “hey guys”","isChecked":false,"level":4,"score":"465"},{"author":"mrpriveledge","body":"Guy wears sweatpants or track suit every time. Haha \n\nYou guys get Conan also?","isChecked":false,"level":5,"score":"35"},{"author":"poto-cabengo","body":"Yeah. I used to work in a movie theater in Santa Monica, Ca and we had celebrities come in on a practically daily basis. The one celeb who stood out for me, in terms of niceness, was Adam Sandler. He was always friendly to the staff when he came in and never failed to give a generous tip to the concession workers.","isChecked":false,"level":2,"score":"836"},{"author":"unnaturalorder","body":"The funny thing is I can picture this happening perfectly in one of his movies. Sounds like he's an awesome guy in real life. Loved him in Uncut Gems.","isChecked":false,"level":2,"score":"601"},{"author":"EthanWaaaaack","body":"Sounds just like him honestly","isChecked":false,"level":2,"score":"144"},{"author":"Janisneptunus","body":"My husband and I were wandering around Philly a few years ago and Don Cheadle was walking toward us. We both stopped and turned as we watched him go by. After he passed us he turned around with a big smile and waved/winked. \n\nI just thought that was pretty cool.","isChecked":false,"level":1,"score":"8720"},{"author":"joecheese69","body":"Don cheeto\nedit: why does this have 1.5k upvotes","isChecked":false,"level":2,"score":"1656"},{"author":"skip_leg_day","body":"Boom, you lookin for this?","isChecked":false,"level":2,"score":"69"},{"author":"Undecided_User_Name","body":"That's not Don Cheadle. That guy just pretends to be him, along with pretending to be Donovan Mcnabb.\n\nEdit.\n\nTiger Woods too","isChecked":false,"level":2,"score":"35"},{"author":"_Glibnik_","body":"I met Paul Rudd on a flight from NY, sat next too him on the plane. My buddy leaned over and told me that he wanted to compliment him on this band shirt he wore when making Clueless, but he \"didn't want it to be weird\". So his solution was to write him a note and slip it to him, lol. So he does this, and Paul just gets this nervous look on his face, opens the note and reads it. Starts cracking up laughing, leaned over to us and said \"best note ever\". He then told us the whole story of the shirt, how he fought with the costume dept about it because it was the shirt he wore to set that day. We talked the whole flight, dude was super cool.\n\nEdit: Band is Trip Shakespeare.","isChecked":true,"level":1,"score":"17074"},{"author":"musicalsandmuscles","body":"Oh, this makes me so happy! I saw his name and almost didn’t read on because I’d be so upset if he wasn’t nice.","isChecked":false,"level":2,"score":"2959"},{"author":"_Glibnik_","body":"He was incredibly nice.","isChecked":false,"level":3,"score":"162"},{"author":"GruGruxQueen","body":"Me too!! Almost skipped over it because I love Paul Rudd way too much to read anything negative about him! 🤣","isChecked":false,"level":3,"score":"56"},{"author":"doghaircut","body":"There's no way Paul Rudd isn't nice. He has the same anti-aging gene Keanu Reaves has. It must also cause niceness.","isChecked":false,"level":3,"score":"49"},{"author":"TheTatteredOne","body":"Honestly, maybe some other guys I’d have that apprehension but, idk, something about the guy seems so genuine. \n\nI actually wasn’t worried at all","isChecked":false,"level":3,"score":"37"},{"author":"Malakoji","body":"So I have a fun Paul Rudd story.\n\nI worked at CVS at the time, and my manager had just eliminated smoke breaks- so I'm on edge and going nuts.  Paul Rudd walks in, and sees me.\n\nFor reference- I am generally disheveled in appearance.  I had a wizard beard braided down almost to my nuts, and I had worked overnight unloading the truck before popping on register.\n\nHe looks at me and just goes- \"rough night?\"  I laughed, nodded.  I slurped at my coffee, which was more or less empty at this point.  My boss comes out of the office to yell at me about something, and Paul drops what he's doing, runs to my counter, and rings the little bell to interrupt the boss.  I run over and he has a single butterfinger on the counter.\n\nI ring him out, and he laughs.  He says- \"how long you been here?\"  Truthfully, I told him- 10 hours.  I sputter something about loving him in \"Fundamentals of Caring.\"  He looks at my boss and says the best thing ever.\n\n\"I need [my name] to help me to my car with my purchase.  My back hurts.  Mind taking over for him?\"\n\nSo i go outside, he bums a cigarette off me, and bought me coffee- then wouldn't let me inside until i finished a whole cigarette and half my coffee.  Boss came out to bitch, he laughs and says \"I still need his help loading my car.\"  Honestly, its actually probably the single best customer-moment I've ever had in my time in retail.\n\nDude's goddamn awesome.","isChecked":true,"level":2,"score":"9729"},{"author":"cheesyblasta","body":"Holy shit that's literally the best story I've ever heard about any celebrity. Just a moment of real humanity. Always been one of my favorite actors, and it's so nice to hear that I would be proud to call him a friend in real life. You too, of course, my dude! Thanks for sharing.","isChecked":false,"level":3,"score":"1040"},{"author":"douko","body":"Paul Rudd is the new Bill Murray, ya heard it here first.","isChecked":false,"level":3,"score":"83"},{"author":"beerlyqualified","body":"That is so fucking cool. What an awesome story you get to have for yourself, I’m jealous!","isChecked":false,"level":3,"score":"71"},{"author":"mothmanr6","body":"Omg lucky! I would love to meet Paul Rudd! He just seems so friendly and easygoing!","isChecked":false,"level":2,"score":"1606"},{"author":"_Glibnik_","body":"He was really chill, very laid back and nice. His family was really nice too. People came up asking for autographs and he just smiled and said sure. This one girl had him sign a book she had and he just laughed and signed it for her, he wasn't the author.","isChecked":false,"level":3,"score":"1067"},{"author":"Incredulous_Toad","body":"I love that he just signed a random book, I'd laugh too!","isChecked":false,"level":4,"score":"49"},{"author":"CostcoDogMom","body":"Love this. Paul Rudd always seemed like a cool guy so it’s nice to know he lives up to this.","isChecked":false,"level":2,"score":"59"},{"author":"_Glibnik_","body":"Genuinely nice dude.","isChecked":false,"level":3,"score":"32"},{"author":"ScubaSteve_","body":"Have never heard a bad word about Rudd. Rich Eisen (sports radio/sports caster) once said Paul Rudd is just a regular dude who happens to be a gigantic movie star. I thought that’s awesome","isChecked":false,"level":2,"score":"52"},{"author":"spiderbabyinapram","body":"This is the easiest of all of these encounters for me to see and hear in my head.","isChecked":false,"level":2,"score":"40"},{"author":"MyBlindStories","body":"I had a chance to work with Witney Houston for eight days on a film set. I was working as an extra. She was nice, kind and personable. Her beauty was more striking in person. \n\nShe was very professional she did not miss a mark or a cue. Everybody on the set cried when she sang. Whitney Houston was very nice to me and complimentary she spoke sweetly and in a motherly tone when she greeted people. I can still rememer her friendly greetings when she arrived on set every day.\n\nThat was one of best experiences of my life and best experiences working on a film set. I learned a lot from her about professionalisim on a film set. I also saw how hard she worked. She was there twelve hours a day and on point every minute. I watched how she interacted with the director other actors and crew. She was even encouraging to other actors and performers in the film even the extras.\n\nIt was heartbreaking when she passed. I still have the dress that I wore in that film she admired and complimented me about the dress. An actor/ musician I know was booked to perform at the event Whitney Houston was to be at the day she passed he was also staying at the same hotel. He called me and told me she was gone then he started to cry.","isChecked":false,"level":1,"score":"2425"},{"author":"-Acta-Non-Verba-","body":"Every time I see one of her videos I think what a shame it is that she's gone.  What a superstar!","isChecked":false,"level":2,"score":"65"},{"author":"Coachkfan1","body":"She was such a talent and had a great career. Her and Amy Winehouse’s deaths were hard on many people.","isChecked":false,"level":2,"score":"31"},{"author":"Beej1030","body":"When my dad was about 9 (1964ish) he was on a plane from LA to Heathrow in coach with his mom. The stewardess came back and excitedly asked him if he wanted to ‘meet a beatle??’\n\nMy dad said sure but didn’t really know the Beatles at that age, and only said yes because that’s kinda what you do at that age. He sat on the couch next to George (different time, airlines treated you like people), George folds up his newspaper and says, “soo, do ya like my music?”\n\nMy dad says (like a confused 10 year old) “um, no”. Apparently George smiled and went back to reading his newspaper. My dad sat there like a doofus for like 5-10 minutes until the stewardess came and got him.\n\nSo George Harrison was cool to children, and my dad’s the most Stone cold 10 year old ever","isChecked":false,"level":1,"score":"428"},{"author":"TheJadedSF","body":"My mom spotted Robin Williams once and she went up to him and asked if she could get a quick photo. She didn't realize he was there in the middle or about to do something with the Make A Wish Foundation so she waited until they were done around 20-30 min later and then a bunch of the kids and people wanted photos with him - he made it a point to stick around and told his staff \"I think that woman wanted a photo\" and made sure she got it. Mom was thrilled. He was such a humble nice dude.","isChecked":false,"level":1,"score":"19697"},{"author":"noradam22","body":"I was working in a little boutique store in Seattle with my girlfriend and it was a particularly slow day when all of a sudden Robin Williams walks through the door. He was the only one in the store and my girlfriend didn’t know who he was. We left him alone and when he came up to purchase his things he started barking at my Boston terrier in a cute way. It scared the crap out of my Boston terrier and he started barking back at Robin. He was so genuine and nice and I really do remember how hairy his arms were. For some reason that really stuck out. He walked out the door and instantly was surrounded by a bunch of tourists trying to take pictures of him. He put his bags in the back of his mini Cooper and drove off. He bought a little piece of artwork and three Goorin Bros hats.","isChecked":false,"level":2,"score":"2686"},{"author":"mattdangerously","body":"How the hell did your girlfriend not know who Robin Williams was?","isChecked":false,"level":3,"score":"150"},{"author":"willis1988","body":"Seems like a lovely man. He is missed!","isChecked":false,"level":2,"score":"4570"},{"author":"Fletch_Royall","body":"from what I can tell, the guy was as pure as the driven snow. really a tragedy","isChecked":false,"level":3,"score":"1451"},{"author":"unnaturalorder","body":"The fact that he remembered her after doing the event and then singled her out when others were mobbing him speaks volumes. Must be hard keeping track of so many things going on like that","isChecked":false,"level":2,"score":"911"},{"author":"MudiusP","body":"While filming Patch Adams at UC Berkeley (I was an extra during the classroom scene), Robin Williams got hold of a students bike and rode around Telegraph Ave. whizzing by unsuspecting and surprised day tourists and just had a great time entertaining people on a whim on a bicycle!","isChecked":false,"level":2,"score":"715"},{"author":"Withoutdefinedlimits","body":"He used to eat at the restaurant I worked at in Santa Monica, a lovely person all around. One time there was another customer who was a regular of ours that was sitting alone, he had Down syndrome and would get dropped off by his care taker and eat alone usually. Robin sat with him for hours one day. They talked and ate, drank milkshakes and Robin paid for his meal. This guy had no idea he was a famous actor. He was just grateful to have someone treat him like an equal. It was heartwarming.","isChecked":false,"level":2,"score":"63"},{"author":"MiestaWieck","body":"I saw him on the Graham Norton show once and someone did an incredible Mrs doubtfire impression.\nHis response? \"well done Danny you made me harder than chinese algebra\"\nI almost pissed myself","isChecked":false,"level":2,"score":"37"},{"author":"KhaosElement","body":"Used to do delivery runs for a catering company, and we would get a lot of celebrities at the airport that ordered from us. Johnny Depp was the only one I ever saw face to face. Dude pulled a wadded up bill from his pocket and tossed it at me. I thought it was cool I got a tip directly from him at all, but once I had it all unwadded it was $100 bill.","isChecked":true,"level":1,"score":"7687"},{"author":"_youthgonewild_","body":"He's really a total sweetheart! I saw him at a few shows (he plays guitar with Alice Cooper) and after the set ended he leaned down from the stage to give me a hug. Smiling the whole time. I greeted him with \"Captain Jack!\" and he laughed, even though I was just a kid. Nicest dude!","isChecked":false,"level":2,"score":"3046"},{"author":"Wascally-Wabbeeto","body":"I’m more impressed you were in the front row of an Alice Cooper show when you were a kid.","isChecked":false,"level":3,"score":"835"},{"author":"livious1","body":"His username checks out.","isChecked":false,"level":4,"score":"84"},{"author":"choose-usernamee","body":"https://youtu.be/TyX0twnnyHA putting smiles on those kids faces is priceless.  And he stays in character except when he talks to Miranda at the 5 minute mark.  You’ll see why he breaks character for those few seconds","isChecked":false,"level":2,"score":"402"},{"author":"UntiltheEndoftheline","body":"I have seen this so many times and can't help but smile the entire time. He is such as great guy.","isChecked":false,"level":3,"score":"71"},{"author":"zT1TzbaT","body":"That's awesome! Yeah, this isn't the first time I've heard about him being a [generous tipper](http://chicagotheaterbeat.com/2009/06/24/johnny-depp-gives-4000-tip-to-gibsons-steakhouse-waiter/).","isChecked":false,"level":2,"score":"35"},{"author":"AllthatJazz_89","body":"Met Peter Cullen (voice of Optimus Prime and Eeyore) at Botcon in 2012. They had a raffle system set up for autographs/meet and greets. He saw a bunch of us standing off to the side, including a man next to me who was sobbing because Peter meant so much to him. Peter full on RAN from the line he was supposed to be autographing and bear hugged this guy for at least a solid minute, patting his back and saying “It’s all right. Everything is okay. I’m here now,” while the guy sobbed on him. Then Peter autographed all our memorabilia and was whisked away by some very angry con staff.\n\nWonderful, wonderful man. Class act and genuinely kind.","isChecked":false,"level":1,"score":"4035"},{"author":"mdf34","body":"Oh my god this is just great, that guy really needed it","isChecked":false,"level":2,"score":"654"},{"author":"gotthelowdown","body":"> Met Peter Cullen (voice of Optimus Prime and Eeyore) at Botcon in 2012. \n\nA video that fans of him might enjoy :)\n\n[Peter Cullen explains how he created the voice for Optimus Prime](https://www.youtube.com/watch?v=zryfjSaxXLo)","isChecked":false,"level":2,"score":"78"},{"author":"watchman28","body":"I don't think I could cope with hearing that in Optimus Prime's voice.","isChecked":false,"level":2,"score":"99"},{"author":"veggietoot","body":"met Matthew Lillard, his wife, and newborn daughter like literally after the release of the 1st Scooby Doo Movie. My family always host 4th of July parties in our beach house, and he party crashed. I was like 7 or 8 at the time and my cousins were freaking out saying \"Shaggy is here!\". Of course I immediately sprinted over and he was eating a hot dog (super cliche I know since it's the 4th of July lol). He was so cool. The whole time he was in character and offering me to have him go get a hot dog for me. I remember my little cousins asking where Scooby was at and he replied, \"Oh Scoobs ate sooo many hot dogs that he's like, having a food coma\". Seriously, one of most highlighted memory dating back to my youth","isChecked":false,"level":1,"score":"9147"},{"author":"randy_stanhooe","body":"That’s phenomenal. By all accounts he’s a good dude.","isChecked":false,"level":2,"score":"2063"},{"author":"dismayhurta","body":"I unironically love Matthew Lillard. He gets shit all over, but I think he's a blast.","isChecked":false,"level":3,"score":"572"},{"author":"BertyLohan","body":"Matthew Lillard gets shit? Who would give Matthew Lillard shit? The guy seems radical. Even if you're pretentious and think you're better than Scream or Scooby Doo or Without a Paddle, it doesn't make Lillard less cool.","isChecked":false,"level":4,"score":"325"},{"author":"LDKRZ","body":"He’s been getting tonnes of love on Twitter it kinda makes me sad when he responds to it all by saying he don’t feel like he deserves the love he gets","isChecked":false,"level":4,"score":"37"},{"author":"texassadist","body":"Matt is a stand up dude, he’s one of 2 nicest celebs I’ve ever met. Was great with the kids which is funny considering it was a horror con. Made sure everyone liked their photos or he would retake them. It’s a super chill con at a hotel and a lot of the celebs would hang at the bar in the evening and he was there telling stories and being really involved with the fans.","isChecked":false,"level":2,"score":"753"},{"author":"jmb052","body":"He was probably stoned off his tits, having a good time talking like shaggy and having kids bring him hotdogs.  Can't say I blame him.","isChecked":false,"level":2,"score":"1119"},{"author":"WinRaRz","body":"> offering me to have him go get a hot dog for me\n\nI couldn't figure out if this meant he was getting a dog for shaggy or the other way around.","isChecked":false,"level":3,"score":"51"},{"author":"MoogieCowser","body":"I met the St. Bernard dog from Beethoven at Planet Hollywood when I was a kid.  Seemed like a pretty nice dog in person.","isChecked":false,"level":1,"score":"12901"},{"author":"mathmaticallycorrect","body":"I hope you got to give him pets.","isChecked":false,"level":2,"score":"1441"},{"author":"willis1988","body":"Best answer here. You win.","isChecked":false,"level":2,"score":"2244"},{"author":"drslapnuts","body":"I met Buzz Aldrin and have a good story. I met him in 2009 and 2013. At the 2013 meeting, I said \"I met you before in 2009\" and he said \"what took you so long to come back?\"","isChecked":false,"level":1,"score":"9415"},{"author":"willis1988","body":"Nice couple of people to have met, particularly Buzz Aldrin. Always going to be a special person in history so you're a lucky person!","isChecked":false,"level":2,"score":"2075"},{"author":"bitterbloodorange","body":"Nice to know Bill Clinton is into role reversals on occasion.","isChecked":false,"level":2,"score":"975"},{"author":"DAFUQisaLOMMY","body":"Nearly 20 years ago, I literally bumped into Mick Foley at Six Flags in NJ, I was walking backwards down the exit ramp from a ride, while talking to some friends, and he was being escorted up the exit ramp with his kids, to skip the line.\n\nMy dumbass never saw em coming, and I backed right up into him, dude was super cool about, he just caught me, gave me a pat on the back when I apologized and said \"no problem dude, have a nice day.\", and then I realized who it was as he was walking away.... my jaw dropped and one of my buddies just looked at me and said, \"Did Mankind just tell you to have a nice day?\"","isChecked":false,"level":1,"score":"4838"},{"author":"Shytgeist","body":"Where is u/shittymorph when you need him.","isChecked":false,"level":2,"score":"967"},{"author":"gunboslice1121","body":"He traveled back to nineteen ninety eight to throw mankind off the hell in the cell","isChecked":false,"level":3,"score":"585"},{"author":"FreddieGregg","body":"This is amazing. Mick Foley has always seemed like he'd be a pretty nice dude.","isChecked":false,"level":2,"score":"151"},{"author":"PM_urfavoritethings","body":"Was a server for Tom Cruise. Pretty cool dude, tbh. Was a bit out of touch, but that's to be expected. The funny part was he didn't know what he could order off of our menu, so he had to call his nutritionist to find out what to get. Ended up getting fried chicken","isChecked":false,"level":1,"score":"9301"},{"author":"willis1988","body":"That's hilarious.","isChecked":false,"level":2,"score":"3310"},{"author":"insertstalem3me","body":"tbf, tom cruises nutritionist must hate tom when he goes for a midnight snack and calls him","isChecked":false,"level":3,"score":"2397"},{"author":"punksmostlydead","body":"I'd bet that the fee he charges is embarrassingly large, and that he doesn't mind a bit.","isChecked":false,"level":4,"score":"1422"},{"author":"freedubs","body":"Fr I'm not complaining If you wake me up if your paying me big time","isChecked":false,"level":5,"score":"50"},{"author":"Herogamer555","body":"His nutritionist: https://media.giphy.com/media/94EQmVHkveNck/giphy.gif","isChecked":false,"level":4,"score":"719"},{"author":"jn2010","body":"Fried chicken seems like an odd choice after consulting a nutritionist.","isChecked":false,"level":2,"score":"764"},{"author":"PM_urfavoritethings","body":"This was not exactly high end dining. I believe the words were: fuck it, get the chicken and do some extra cardio tonight.","isChecked":false,"level":3,"score":"675"},{"author":"Shazam1269","body":"I say that after every meal. Unfortunately I also say fuck the cardio too 😞","isChecked":false,"level":4,"score":"80"},{"author":"NervousEngineer3","body":"I met him when I was with my father's cousin that painted several rooms in his house.  He was so nice about the job my father's cousin did.  He even called over Adam Samberg who was in the restaurant over to recommend him as a painter since he knew Adam had just bought a house.  That was nice.","isChecked":false,"level":2,"score":"215"},{"author":"nola_mike","body":"Man, I tell my wife all the time that Tom Cruise would be one of my favorite actors if it weren't for the Scientology bullshit. Good to hear that he is genuinely a nice dude though.","isChecked":false,"level":2,"score":"878"},{"author":"TheRealslirnshady","body":"Quite a few cultists are nice.","isChecked":false,"level":3,"score":"306"},{"author":"Panukka","body":"The way he's been described by his fans and co-workers, and others who've known him, is so overwhelmingly positive though, that I'm willing to say that all in all he's a good dude. A misguided, good dude. \n\nScientology is bad, but in that, we should put our attention on David Miscavage, the real bad guy. He gets away from attention too easily most of the time by just hiding behind Cruise.","isChecked":false,"level":4,"score":"71"},{"author":"unnaturalorder","body":"\"Fuck, I don't know what I want. Better let the nutritionist decide.\"","isChecked":false,"level":2,"score":"473"},{"author":"ArnoldoSea","body":"Better yet, the nutritionist tells him, \"Go for the fried chicken. It tastes the best.\"","isChecked":false,"level":3,"score":"34"},{"author":"cedreamge","body":"I know some people that work with dubbing big movies and tv shows. They were once telling stories of some folks who dub famous people - they lost the voice actor for Harry Potter due to gun violence and what not. Then someone mentions Tom Cruise and they say he is a pain in the ass. Apparently he believed his voice actor sounded too old (he had been dubbing Tom Cruise for almost as long as Tom Cruise had been doing movies). He and his agent demanded that he get a new voice actor.","isChecked":false,"level":2,"score":"213"},{"author":"RubberbandShooter","body":"You're Brazilian right? The Brazilian VA for Harry Potter was a policeman and died","isChecked":false,"level":3,"score":"133"},{"author":"simonviper3","body":"I met Kiefer Sutherland after one of his gigs and he was the most humble celeb I've ever met so genuine and nice he took pictures with everyone and signed everything there was about 15 people he even had a chat with is all and thanked us for waiting for him while he was doing a radio interview!","isChecked":false,"level":1,"score":"335"},{"author":"Turicus","body":"Bumped into Gordon Ramsay in the lift in a hotel in Hong Kong. He was very friendly. We didn't talk to him or ask for a picture. I just blurted out \"You're Gordon Ramsay!\" and he aknowledged and smiled. He insisted on us going first because we had our suitcases with us, wished us a nice day, said bye several times when we saw him in the lobby again. Very friendly!","isChecked":false,"level":1,"score":"1553"},{"author":"kaeliz","body":"Got the chance to meet him a few years back and he really is a pretty nice guy. Just has a low tolerance for bullshit","isChecked":false,"level":2,"score":"263"},{"author":"L_T_C_","body":"He is a really kind heat. He just doesn't take bullshit and idiocracy like everyone.","isChecked":false,"level":2,"score":"54"},{"author":"psh_1","body":"Bill Nye. Horrible. I took a group of high school students to an engineering fair at University of Illinois in 2001. Bill was a special guest. This was a big deal for one of my students as he was the inspiration to pursue science. My student made a t-shirt that she wanted to get signed by him if she got the chance. We drove four hours to get there, walked around and viewed the projects that were on display, and watched some battle bot competitions. On our last walk through, here comes Bill down the hallway. I nudged my student to go ask for an autograph. She told him that he was a huge inspiration and asked if he would sign her shirt. He said that he did not appreciate that she was interrupting his walk. She showed him the shirt. He rolled his eyes, scribbled on the shirt, and tossed it to her. She looked like she was going to cry. Instead she walked over to a garbage can and threw it away. He said, \"Whatever\" and went back to looking at the projects.","isChecked":true,"level":1,"score":"1965"},{"author":"trashbuckets","body":"I believe it. My biology teacher in high school met him and he kept reminding the class how much of a douche he was lmao","isChecked":true,"level":2,"score":"1007"},{"author":"ourlaptopisbroken","body":"My bio teacher also met Bill Nye and said he was a douche. I don't know the story since I wasn't there when she told it, heard it from another student.","isChecked":false,"level":3,"score":"86"},{"author":"Frogish","body":"What is it with bio teachers running into Nye? Mine would pause the videos every few minutes and say “look at that look in his eyes.”","isChecked":false,"level":4,"score":"59"},{"author":"9311chi","body":"He spoke at my undergrad my friend was one of the students who encountered him as she was on the event staff. Similar comments from her.","isChecked":false,"level":2,"score":"333"},{"author":"supercalloused","body":"I’ve met his nephew. Even he said the guy’s a dick.","isChecked":false,"level":2,"score":"502"},{"author":"jessflyc","body":"Everyone someone posts this questions I hear another story about what a dick he is.","isChecked":false,"level":2,"score":"159"},{"author":"walker11053","body":"What the actual fuck. :(","isChecked":false,"level":2,"score":"326"},{"author":"DicoVeritas","body":"Yup. He and Neil Degrasse Tyson are both well known aholes. They are good at their jobs, but are crappy human beings.","isChecked":false,"level":3,"score":"123"},{"author":"rapscallionrodent","body":"I've heard nothing good about him over the years.  It was a huge disappointment to hear the general consensus that he's an asshole.","isChecked":false,"level":2,"score":"77"},{"author":"boston_blonde","body":"I worked with Bill Nye. Many students worked really hard to get the event together and he just kept complaining about having to take pictures at the end, which was part of the contracted time with him. He was very sarcastic, but not particularly mean to me (I was also a student). I had told him I had a few questions I’ll be asking him at the end of the show and I was nervous. He offered to let me go into his room and practice with him, so I’d feel better. He was on time and professional, which was all I really could’ve asked for, but I can definitely see him doing that to a fan.","isChecked":false,"level":2,"score":"60"},{"author":"mr_potato_arms","body":"This makes me feel a lot better about hating his newer show, “Bill Nye saves the world” or whatever that piece of shit was called. Fuck that guy.","isChecked":false,"level":2,"score":"95"},{"author":"2Salmon4U","body":"When I heard the title of that show it really made me cringe. Kinda helps to know his personality is worse than I thought. \n\nI wonder if he is just supremely jaded? Doesn't excuse how he treats fans though!","isChecked":false,"level":3,"score":"34"},{"author":"AK47_10","body":"Imagine someone looking up to you and admiring everything you do, and you treat them like shit. I literally hate Bill Nye from now on.","isChecked":false,"level":2,"score":"171"},{"author":"zerbey","body":"Terry Pratchett was as quirky and fun in real life as his books were.  His passing was a huge loss to me as we'd met several times in person and had multiple conversations online.  Felt like I'd lost a friend.\n\nWe met Robin Williams at Universal Studios when my wife's Grandmother was still alive.  She said hello to him and hoped his family was having a good time.  He tipped his hat to her and said \"Thank you kindly, Ma'am\".  She talked about that encounter the rest of her days.  In real life he was super short as well.\n\nAnd, finally, Tim Hunkin who you've probably never heard of but he did a popular TV show in the 90s called The Secret Life of Machines.  I sent him an e-mail thanking him for helping me become interested in electronics and I got a very kind reply back.","isChecked":false,"level":1,"score":"1685"},{"author":"OneGizmo","body":"My mom would have KILLED to have Pratchett's number or whatever, she's a massive fan, and was heartbroken when he died","isChecked":false,"level":2,"score":"44"},{"author":"zerbey","body":"He was a frequent poster to his Usenet group alt.fan.pratchett and published his personal e-mail address.  This was at a time when very few celebrities had an online presence.  Being able to write to him and get a response was a huge deal.","isChecked":false,"level":3,"score":"37"},{"author":"DNSGeek","body":"I met Sir Terry in DC. He was doing a book signing and I was one of the few (the only?) person there who knew that he liked bags of frozen peas to be brought so he could rest his wrist on them in between signings to soothe his muscles.\n\nHe was so genuinely happy I brought him some that he talked to me for a few minutes then did a custom dedication for me in my copy of Making Money,","isChecked":false,"level":2,"score":"39"},{"author":"yeahhhnoooo","body":"Tom Hiddleston told me my dog was awsome. So that was the highlight of my life lol.","isChecked":false,"level":1,"score":"5187"},{"author":"MakoShark216","body":"I am eternally jealous of this exact interaction","isChecked":false,"level":2,"score":"972"},{"author":"orange_picture","body":"I saw Tom Hiddleston at LAX and I just froze like a deer in the headlights. He’s arguable the most regal human I’ve ever seen, he’s also way taller than I expected.","isChecked":false,"level":3,"score":"694"},{"author":"agd504","body":"My fiancé saw him on the London Tube once and has said the same exact thing! Every time I’m in London, I hope for the same experience","isChecked":false,"level":4,"score":"46"},{"author":"beardedstoner","body":"That’s Loki right? Damn. He’s about to get a show too and I have a feeling it’ll be fantastic...","isChecked":false,"level":2,"score":"296"},{"author":"yeahhhnoooo","body":"That's how I \"met\" him. I was working on a movie filming on the same lot as the show and i just kind of ran into him. The interaction was very brief lol","isChecked":false,"level":3,"score":"211"},{"author":"itchyslit","body":"Dog tax","isChecked":false,"level":2,"score":"32"},{"author":"Cnutty_04","body":"My Grandma sat next to Rob Van Winkle (Vanilla Ice) on a plane before he was famous for ice ice baby. She knew who he was but didnt want him to know. They had a lovely 4 hour conversation and she said he was really intelligent and nice.","isChecked":false,"level":1,"score":"2717"},{"author":"Sirjoshd109","body":"Grandma got to talk to ice ice baby.","isChecked":false,"level":2,"score":"860"},{"author":"dcbluestar","body":"How did your grandmother know who Vanilla Ice was pre-Ice Ice Baby?","isChecked":false,"level":2,"score":"332"},{"author":"Cnutty_04","body":"I have no idea. He said his name was Rob Van Winkle and I guess it was familiar for some reason. She would've been about 35. Younger grandma. She was a high school teacher so maybe he was popular then. I wasnt alive then so I don't know.","isChecked":false,"level":3,"score":"241"},{"author":"dcbluestar","body":"I didn't think anyone knew who he was before that song came out and I was alive back then. Either way, that's pretty cool. I'd like to meet the guy.","isChecked":false,"level":4,"score":"44"},{"author":"Eclipsethenextone","body":"The entire cast of What we do in the shadows tv show. \n\nI work in film as a carpenter, so I was invited to the wrap party. They were all really nice and everyone got absolutely plastered it was a really good night.","isChecked":false,"level":1,"score":"4193"},{"author":"DylanDog86","body":"I didn’t expect to like that show as much as I did and am eagerly anticipating season 2. Horny for love...","isChecked":false,"level":2,"score":"862"},{"author":"Eclipsethenextone","body":"It was a blast to work on. Some of the sets for season 2 are insane. I hope you enjoy season 2 as the first!. It comes out on the 15th of April :). It’s one of the only shows That I worked on that I also watched!.  Can’t wait to see how everything looks on the screen :).","isChecked":false,"level":3,"score":"599"},{"author":"TheClownLordPM","body":"That's less than a week. Dude, you just made my day! What are some cool things you've built for any shows? My family loves carpentry!","isChecked":false,"level":4,"score":"45"},{"author":"Eclipsethenextone","body":"I can’t say exactly what I’ve done in season 2 until it airs or else I break my contract and I can lose my job. How ever what I can tell you is that the mansion that was used for exterior shots and some interior shots couldn’t be used because of air quality and hazardous conditions. So we had to recreate the mansion in the studio parking lot lol.","isChecked":false,"level":5,"score":"51"},{"author":"confusedvegetarian","body":"I met the wiggles at a country pub in Australia and they are very cool blokes","isChecked":false,"level":1,"score":"1130"},{"author":"veracassidy","body":"This is great. My kids loved the wiggles when they were young","isChecked":false,"level":2,"score":"63"},{"author":"GhostOrchid22","body":"We have taken our kids to 3 Wiggles concerts (current Wiggles), and have accidentally run into them 2 out of 3 times before/after the concert, and both times they all couldn't be nicer.   \n\n1st time, it was after the concert, and our 3 year old was dressed as Emma we were walking down the street.  We ran into Simon & Anthony, and they both stopped to talk with her, and Simon even walked her stroller down the street.\n\n2nd time, we were lined up in front of the theater early pre-concert, and ran into Anthony, Emma & Lachy (each separately).  All of them posed for pictures with our kids and talked with them, and Emma even posted one on her instagram- my now 5 year old was in shock and crying tears of happiness when we saw it.    We live in the US, and our friend's kids in Melbourne also saw it and were in awe that their US buddy 'was friends with Emma Wiggle'. \n\nOur youngest is 2 and is obsessed with the Old Wiggles, so we now have those DVDs as well.  She will yell at us \"I need Jeff!  I need Greg!\" when she wants to watch them.","isChecked":false,"level":2,"score":"49"},{"author":"seemore__glass","body":"After college, I was living the intern life in New York, so I had to hunt around for a job that would be fine with me working just evenings. The first call I got was Kmart, so for about a month, I worked at Kmart Penn Station. \n\nOne night, this guy with his hat pulled down low and this really cheerful girl came into the electronics department where I worked. It was a wild, wild store with tons of sketchy characters, so right away I was wary of him. Anyhow, they looked at the game selection for a minute, then the girl asked me if they could get Madden 2013. I obliged, took it from the case and began cashing them out. It was over the $50 minimum where I had to ask for ID with a credit card purchase, so I asked the sketchy fella for his ID. He told me, in this hushed little voice that he didn’t have it with him. \n\nMhm. So I called up security to get the okay to finish up the transaction. As I’m talking to them, he tilts the credit card towards me. My first thought is, “huh. I didn’t know JP Morgan made a credit card?!” And then I looked at the name. \n\nDaniel Radcliffe. His girlfriend was beaming at me as the expected recognition washed over my dumb, tired face. He was super super gracious, and my height, which I loved even more (we’re both a firm 5’ 5”). \n\nAnd, I was pleased to be so calm and collected about the whole thing that they both got out of there without anyone else knowing who he was.","isChecked":false,"level":1,"score":"876"},{"author":"lovelikefire","body":"The Kmart in Penn Station is also sketchy but it was so big! I’m from a medium sized city in Texas so it was crazy to see all the stuff they had plus the Walgreens also located there...man, it was something else.","isChecked":false,"level":2,"score":"50"},{"author":"Daxter2212","body":"That store is the most bizarre place ever. I wonder in sometimes before work and genuinely forget where I am, it always feels so surreal!","isChecked":false,"level":2,"score":"31"},{"author":"Neat_Petite","body":"Stephen Fry was absolutely delightful. Charming, chatty, got my name wrong once at the beginning of the evening and kept apologising for it over the course of the night. \n\nKatie Price was an absolute bollocking cunt. Seemed to believe she ranked just under The Queen in social standing. In actuality she ranks just under the drummer in the third best Queen cover band in Slough.","isChecked":false,"level":1,"score":"3677"},{"author":"willis1988","body":">Seemed to believe she ranked just under The Queen in social standing. In actuality she ranks just under the drummer in the third best Queen cover band in Slough.\n\nHaha fantastic\n\nStephen Fry is a genuine national treasure.","isChecked":false,"level":2,"score":"1081"},{"author":"Hopesick_2231","body":"Never heard of Katie Price before. I had to look up her Wikipedia page and I'm still not quite sure what she actually does.","isChecked":false,"level":2,"score":"378"},{"author":"Neat_Petite","body":"Count yourself lucky that you’ve managed to avoid the vapid talent vacuum until now.  If you’re lucky you’ll have forgotten her by morning. \n\nShe “got famous” by getting her norks out for lads magazines, and then just generally being gobby and controversial. \n\nFuck me, she’s annoying.","isChecked":false,"level":3,"score":"349"},{"author":"rapemybones","body":"Yeah I think her fame was very much a UK thing (not saying she was completely unknown everywhere else but it must've been like 95% UK). \n\nI'm only saying because growing up in the US I never once heard her name. I love a lot of British tv shows though and she gets mentioned a lot. Had to look her up after some point because me and my friends had no clue who she was. Seems she's like a \"Paris Hilton\" type, although unfortunately Hilton's fame spread to other countries too.","isChecked":false,"level":4,"score":"53"},{"author":"ceruleanavocado","body":"I'm just laughing because I've never heard someone refer to boobs as \"norks\"","isChecked":false,"level":4,"score":"39"},{"author":"SaveMePls22","body":"Ewan McGregor accidentally ran over my bf's foot a couple of years ago when he was filming his Long Way Round series. He was absolutely lovely though, my bf loves bikes so he was over the moon bless him. Apparently they talked about his GS for a couple of minutes together, apparently it's one of his favourite memories. He had to restrain himself a little from roasting the GS as they are notorious for their unreliability","isChecked":false,"level":1,"score":"2078"},{"author":"GamePlayXtreme","body":"One question... did anyone say hello there?","isChecked":false,"level":2,"score":"628"},{"author":"FallsFunnyMan","body":"General Kenobi!","isChecked":false,"level":3,"score":"325"},{"author":"Jp2585","body":"Loved that series, and the sequel long way down. Apparently they finished long way up in December, with electric harleys.","isChecked":false,"level":2,"score":"38"},{"author":"sixwax","body":"Snoop Dogg - Totally, unflappably chill, 100% of the time. It's like a super power.\n\nJon Bon Jovi - Smoked a cigarette with him, couldn't have been more down to earth. I believe he's making BBQ sandwiches for homeless people as we speak.\n\notoh:\n\nJeremy Piven - I like to give people the benefit of the doubt: Must've been method acting for the Ari Gold role.","isChecked":false,"level":1,"score":"1085"},{"author":"willis1988","body":">Snoop Dogg - Totally, unflappably chill, 100% of the time. It's like a super power.\n\n\nUh...There may be a reason for that!","isChecked":false,"level":2,"score":"523"},{"author":"PP8900","body":"Had an Uber driver in New Orleans. We asked who the most famous person he ever drove was.. he replies “funny story...”\n\nApparently Snoop was trying to go visit his grandma or aunt in Mississippi. There was some sort of storm and his flight went to New Orleans. Guy gets the Uber request, but snoop used his real name, so it didn’t click. He pulls up and is like... oh shit.\n\nSnoop asks him to drive 3+ hours to which he obliged. Drops Snoop off, Snoop invites him inside for some food... the rest is history. Said he was a fantastic person","isChecked":false,"level":2,"score":"46"},{"author":"SocialismIsALie","body":"Met -- hung out with for an hour or so -- Kiefer Sutherland.\n\nIt was an amazing coincidence running into him as we had plans to go see him at his concert the coming Saturday night. (Tickets were free, but you had to stand in line to get 'em.)\n\nMy son was bartending -- I came in to see my son -- and he said, \"hey Dad, I got someone I want you to meet...\"\n\nSo when I met him, the first thing out of my mouth was \"oh my goodness, we loved you in Lost Boys, in 24, in so much -- and believe it or not my wife and I are coming to see your band on Saturday!\"\n\nHe LOST IT!!! He was like, \"most people don't have a clue about my music... I can't believe you guys are coming! That's so awesome...\"\n\nYeah, he was thrilled....\n\nSo I called my wife? Then she swung by the bar too to meet Kiefer.\n\nLong story short, he left really great seats for us at the will call.  Then during the concert he called out for my wife and me to stand up...then he dedicated a love song to us.\n\nHe's a good dude!!!","isChecked":false,"level":1,"score":"5443"},{"author":"Dahlias_and_roses","body":"Omg... I love him I would die","isChecked":false,"level":2,"score":"640"},{"author":"Emilyjanelucy","body":"I love this. So much.","isChecked":false,"level":2,"score":"389"},{"author":"Tyrantt_47","body":"My wife and I happen to walk by Norman Reedus at a comic con event. He was walking to his booth and his guards were shooing people people away, but luckily we were on the other side of the shooing. There was 2 other people near us walking towards him, so we decided to follow. As we approached him, he told the other two that he was sorry he couldn't take a picture with them because he was running late, but then he caught a glimpse of my wife's pouty face and said \"oh okay, I'll take a picture with you because you look so sad.\" We laughed and she explained that she didn't even realize that she was pouting. \n\nWe had no hopes of meeting any of TWD cast, so it was a pleasant surprise to be in the right place at the right time. \n\nHe was a cool dude. And a lot shorter than you would imagine.","isChecked":false,"level":1,"score":"270"},{"author":"LeastCleverNameEver","body":"For a couple years I went to a private school in Connecticut. My last year there, Bill Murray's sons transferred in. Neither was in my grade, but one of them was in the play with me. I was super nervous, but I was an SNL fan my whole life and had the 20th anniversary book that talked about all the cast members and behind the scenes stuff. After the show I (really shyly) said hi and told him I was a fan and asked him to sign it. He said \"whoa! I haven't even seen this yet! Cool!\" and then told the biggest lie ever told and said I was good in the show (I was awful, I forgot all my lines). \n\nWeirdly, this wasn't the first time I saw him. When I was about 6 we were at a restaurant in new jersey and he and his wife were at another table. Ghostbusters had just come out and I wanted to say hi but my parents stopped me.\n\nNice dude.\n\nEdit: I've also met Big Freedia a couple times. Always super cool.","isChecked":false,"level":1,"score":"1662"},{"author":"InfamousAccount0","body":"Taught at a private school in NY that Murray's son played in basketball. Had no idea when I walked into the gym after school to watch a few of my students play, and there was Bill Murray, just watching the game. I was a bit in awe, but I didn't want to bother him, as everybody seemed to be giving him some peace and allowing him to just take in the game. He actually struck up a conversation with me, asking me questions about my school's team. He was just a genuinely nice, interesting guy.","isChecked":false,"level":2,"score":"56"},{"author":"Lanxmc","body":"My sister got married last October and the wedding party all stayed at the Loews Hotel in Atlanta. I was maid of honor so I was always running around doing a million things and I passed Bill Murray in the hallway outside of her suite twice. The first time I was totally caught off guard and a little star struck - I’ve been a fan of him mainly through his Wes Anderson films and just wasn’t expecting to see him. He was in town for a golf tournament apparently.\n\nThe second time I saw him, he was with a couple of young guys and all of the bridesmaids were getting ready for the wedding and had hair/makeup done so I said “hey Bill, I ALMOST hate to ask but today is my sisters wedding day - she’s in this room, would you mind peeking your head in and saying hi? I think it would make her day.”\n\nHe was like yeah let’s go and stepped into the suite but of course all the girls freaked out and started screaming... I think he was less than thrilled about that, but he took some photos with us and was really a good sport about it. Really nice guy.","isChecked":false,"level":2,"score":"41"},{"author":"Gundamsafety","body":"went with my parents to a function for some charity group and we shared a table with Ice-T. Super nice guy, down to earth and not high on himself. He has a mouth on him but when he found out my Dad is a retired preacher never heard a bad word again the rest of the night. I ended up talking music and how he goes from Rap to Metal. Man is cool and knows his sh\\*t about the metal and Punk scene.","isChecked":false,"level":1,"score":"972"},{"author":"happybuffalowing","body":"That first Body Count album is awesome","isChecked":false,"level":2,"score":"48"},{"author":"JMoneyLundgren","body":"I met Tony Hawk at a local skate park. Just randomly he showed up. Of course people were freaking out, but he was such a laid back guy. Shook my hand and made small talk with me, a real nice guy.\n\nA couple years ago, I ran into Skrillex in a public rest stop in Maine. He was doing a show later that night in the area, but for obvious reasons, I thought the restroom was a bad place to try to say hello. By the time I got outside, he was already on his tour bus. I’ll always regret that lol","isChecked":false,"level":1,"score":"263"},{"author":"Luke_7","body":"Dave Grohl came into the record store I used to work at on my day off, so I missed it (ughhh) but got the play-by-play. One of my coworkers didn't recognize him at first, but then did, which lead to the following conversation: \n\nCoworker: Hey man, is there anything I can help you fi- HOLY SHIT, you're Dave Ghrol!\n\nDave Grohl: haha yeah.\n\nCoworker: Oh man, I totally did not play that cool. Umm... uh... Oh, is there anything I can help you find? \n\nDave Grohl: I'm good, but thanks! \n\nThey left him alone, but at the end when he was checking out, he offered to sign some stuff or take pictures, which everyone took him up on. Super chill, super nice guy apparently.\n\nEdit: Grohl","isChecked":false,"level":1,"score":"1551"},{"author":"Howard-Roark-","body":"Grohl","isChecked":false,"level":2,"score":"45"},{"author":"someboooooodeh","body":"I met Jim Carrey when I was like 11 at a party my parents attended. I couldn't stop staring at him. He was behaving so normal and then when he noticed me staring he did a mask facial expression and started staring at me. \n\nHe's a genuinely funny guy and probably has the purest of heart.","isChecked":false,"level":1,"score":"6630"},{"author":"PwnasaurusRawr","body":"ITT: “Here’s why your assessment of this person was wrong”","isChecked":false,"level":2,"score":"51"},{"author":"---IV---","body":"Stan Lee, that guy was just as awesome in person. Rest in peace Stan","isChecked":false,"level":1,"score":"2500"},{"author":"jediprime","body":"I met him at a con shortly before he passed.  I was ecstatic, its stan fucking lee!  But he barely moved, he could have been a robot. Didnt talk during autographs, didn't move a muscle in photos. I was a little disappointed but can understand not having the energy at his age to be animated all day long.  He did have a ton of energy at his panel and was like a completely different person, like he was saving up his energy all day for that panel.","isChecked":false,"level":2,"score":"734"},{"author":"drst0ner","body":"Stan Lee shouldn’t have been attending comic conventions in 2017-2018. After his wife passed away, he was never the same. His sense of energy and spirit were gone and his health was clearly in decline. \n\nI met him about a dozen times between 2012-2016 and he was a delight to speak with every time! He had that same fun and friendly “larger than life” personality in person that I saw on TV and in the movies.","isChecked":false,"level":3,"score":"175"},{"author":"just_gimme_anwsers","body":"Ringo Starr likes this restaurant by my house. I have run into him a few times while I’m up there, if he’s with someone else then he’s bearable. \n\nThere is thus one time though, I was with a friend and he exited he restaurant with his wife. My friend saw who he was and looked shocked. He just looked in our direction and said, “yes it is I” and drove off. \n\nWe were then informed by the valet guy a few feet away that we got the lucky end because some older folks were nearby. In short Ringo is a salty man.","isChecked":true,"level":1,"score":"2057"},{"author":"CrusherOfChaos","body":">“yes it is I”\n\nThat's actually a pretty epic way to greet people","isChecked":false,"level":2,"score":"1328"},{"author":"crumpledlinensuit","body":"*'\"Yes, it is I\", said Thomas'* would be even better.","isChecked":false,"level":3,"score":"437"},{"author":"deliriousgoomba","body":"To be fair most of his life he's been hounded by mobs of people. It would make anyone salty after a few decades.","isChecked":false,"level":2,"score":"624"},{"author":"Kundrew1","body":"Ringo has been one of the most famous people in the world for over 50 years. That has to be exhausting.","isChecked":false,"level":3,"score":"516"},{"author":"opus_4_vp","body":"And he has been told that he doesn't deserve it.\n\nI'd be pissed.","isChecked":false,"level":4,"score":"375"},{"author":"bluesyasian","body":"People that don't think Ringo deserves his fame have never played in a band. Ringo kept the groove tight and never overplayed which is a lot more fun to play with than someone just bashing on drums like a kid on pots and pans.","isChecked":false,"level":5,"score":"65"},{"author":"FreddieGregg","body":"I once had a cab driver who used to drive for Ringo. He fucking hated that man. Spent our entire hour long ride railing about what a dick he was. It was the most entertaining cab ride I've ever taken.","isChecked":false,"level":2,"score":"44"},{"author":"SharkPuncher","body":"My manager at gamestop back in 2005 told me about the time he was a kid and ran into Jake the Snake Roberts at some diner or something while on a family trip.\n\nJake was sitting at a booth eating by himself. My boss was a big fan of wrestling and wanted to go over and say hello. My boss asked Jake \"where's Damien?\" and the wrestler responded, \"Right here, kid.\" as he adjusted his junk. \n\nSeemed pretty on-brand.","isChecked":false,"level":1,"score":"231"},{"author":"Whole_Swimming","body":"Drake Bell came to my college last year and sang/played guitar. He was big when most of us were grade schoolers, but he does next to nothing now. His musical skills weren’t bad, but he did a terrible “show” because he said nothing between songs. Despite the fact that he’s now touring small, rural colleges, he was a royal jerk to all of us.","isChecked":false,"level":1,"score":"1276"},{"author":"1Dhorsegirl97","body":"He came to my school too! He came out twice for some reason and was so pissed about it. He sang the drake and josh song like 3 times. It was weird","isChecked":false,"level":2,"score":"650"},{"author":"TroutOfOrder","body":"Oh Josh Peck came to my college and it was exactly opposite; he just talked to us for an hour about his acting career and Drake and Josh","isChecked":false,"level":2,"score":"184"},{"author":"NCPDRUM","body":"He preformed in my high schools parking lot once for this weird promotion called LiveNation and you could tell he did NOT wanna be there","isChecked":false,"level":2,"score":"307"},{"author":"fatgothbitch","body":"He came to my school for that and was SUPER rude the entire time. No one cared about his set until he played the Drake and Josh theme it was hilarious.","isChecked":false,"level":3,"score":"214"},{"author":"xxhouseofwolvesxx","body":"I use to work for that company, let me tell you, I have seen drake bell and Aaron carter more times than I care to admit","isChecked":false,"level":3,"score":"141"},{"author":"NCPDRUM","body":"Really?? That’s crazy! If you don’t mind me asking, what was the POINT of coming to the schools? I just remembered a bunch of takis being there","isChecked":false,"level":4,"score":"44"},{"author":"yattamomo","body":"i met him and he was pretty nice!! he has these yearly charity parties, and 2 years ago was for a charity my boyfriend works for occasionally so we were invited. to get in you have to pay, or bring a present since it was for children. after he sang and played he took pictures with lots of people. then he lost his wallet so was understandably stressed but he was never rude at least that i saw :0","isChecked":false,"level":2,"score":"40"},{"author":"WeaverFan420","body":"Teemu Selanne - I met him at the local hockey rink, got a photo, chatted for a bit, and he was great about it!","isChecked":false,"level":1,"score":"849"},{"author":"rolltododge","body":"Hockey players are, by and large, down to earth, humble people... Finnish hockey players probably more so.\n\nMost hockey players are from small little farming/rural communities - especially the Canadian guys. There's a handful that are dicks, obviously but for the most part they're good kids\n\nQuoting myself for reiteration;\n\n>\"There's a handful that are dicks, obviously\"\n\nI get it, some hockey players are dicks. I know. Every single segment of any population, no matter the criteria, has its subset of dicks.","isChecked":false,"level":2,"score":"242"},{"author":"Zenkikid","body":"Ive read numerous times on Askreddit that Gretzky is a super nice guy and a generous tipper. He also allegedly called out MJ for being a cheap ass when they were out golfing together","isChecked":false,"level":3,"score":"56"},{"author":"RhysPrime","body":"I used to work right by the shark tank and would run into players pretty frequently.  They have all been absolute sweethearts, always very polite, none of that drama with like nfl players. And when I was a kid I was into tennis and there were 2 professional tennis tournaments in the local area that my tennis club would send teams of ball kids to. I've met a lot of the famous tennis players of the 90s 00s. I was once assigned as basically a valet for Anna Kournikova,  as she was playing, ended up jogging behind her and her guy (Sergei Federov) carrying their water bottles and towels.\n\nAndre agassi was a jackass, called me an asshole on court (at 12) when I was slow getting him his Towel, so I spit on his towel, he wiped it all over his face. I was 12, it was a dick move, I've grown.","isChecked":false,"level":4,"score":"58"},{"author":"xxtraspicyy","body":"I once served Flava Flav, he made a huge deal about having to sit somewhere private because he didn’t want any attention. When it came to pay his bill? He handed me a pre paid visa that did not have enough money on it...","isChecked":false,"level":1,"score":"657"},{"author":"RayAnselmo","body":"Sounds pretty on-brand.","isChecked":false,"level":2,"score":"295"},{"author":"Biggest_Midget","body":"My mom met Bob Marley outside of a concert out of pure luck. Her friends had already left without her and he got a security guard to drive her home. \n\nYears later her best friend gave my mom a signed poster that said he hoped she was doing good and had better friends.\n\nEdit: Holy shit that’s a lot of likes. Thanks","isChecked":false,"level":1,"score":"1943"},{"author":"chewymilk02","body":"Your mom definitely had sex with bob marley","isChecked":false,"level":2,"score":"342"},{"author":"KLWK","body":"Adam Savage and Jamie Hyneman from Mythbusters are amazingly nice to fans. My son, seven years old at the time, asked them questions that had me cringing and thinking, \"You had a chance to ask them something and you asked them this??\" But Adam and Jamie treated his questions as seriously as they would have treated a question from Barack Obama. They acted like we were the most important people in the world at that moment, and like they had no better place to be.","isChecked":false,"level":1,"score":"632"},{"author":"butter00pecan","body":"This story makes me absurdly happy.","isChecked":false,"level":2,"score":"107"},{"author":"KLWK","body":"It really was fantastic. This was at one of their Mythbusters tour events. After the actual event was over, a bunch of us were waiting in line to get our cars at a garage across the street. Jamie came out the stage door, saw us all there, and came strolling across the street and just stood there chatting with people for a while. It was a freezing cold, rainy December night, and he was just standing there in his white button-down shirt and beret, like it was totally fine out, like he had nowhere better to be. \n\nIt sounds very cliched, but my kid is ruined for life, because if he ever meets another celebrity, he'll be comparing it to these two guys. Such gentlemen.","isChecked":false,"level":3,"score":"92"},{"author":"Dr_Emit_L_Brown","body":"I had a chance to meet Adam privately during a book signing event.  We ended up talking like a couple of friends, just bouncing stories off each other and comparing modeling tips. This was shortly after he finished filming savage builds, so we talked about that for a bit too. He spoiled the last episode, but then I was able to ask him a bunch of questions about how he did it. Easily the most chill conversation I have ever had with someone famous. I was 15","isChecked":false,"level":2,"score":"37"},{"author":"TeeheePlunk","body":"Chris Evans grew up in my area - I know his entire family. Not a bad guy, but his (I believe soon to be ex) step mother is an absolutely raging bitch, and I won’t get into details, but it makes a lot of sense why he can’t or won’t hold down a relationship himself.","isChecked":false,"level":1,"score":"1141"},{"author":"mrnuggles64","body":"I also live in the same area Chris Evans grew up. My husband did work for his family recently. He said they were ridiculous. Never around but made weird demands about parking and when they could work.","isChecked":false,"level":2,"score":"347"},{"author":"IHaveTheMustacheNow","body":"Is this a step-mother who would have raised him? Chris always seems like a cool, laid back guy it would be fun to have a game night with. Heard he has massive anxiety, though.","isChecked":false,"level":2,"score":"58"},{"author":"pelon104","body":"I noticed Ron Perlman while I was stocking veggies at Whole Foods. I met his eye and he asked me where the bell peppers were. I showed him and afterwards I asked, “are you an actor sir?” He paused and looked at me with a friendly smirk and said “Sometimes “. I smiled and nodded. I decided to roll with it and dropped the subject. He seemed to appreciate it and approached me again with another produce question a couple of weeks later. Seemed like a good dude with a pleasant vibe.","isChecked":true,"level":1,"score":"613"},{"author":"Armor_of_Inferno","body":"Ron seems like a nice guy.   I ran into him outside the Hilton Bayfront the last day after San Diego Comic Con.   He must have been waiting for his ride in front of the hotel.   This was at the peak of *Sons of Anarchy*'s popularity.\n\nI was sitting on a bench, bone tired as one can be after a convention, and he walked out of the hotel.  Here was a star, in the middle of nerd central, and I think I saw just a tinge of panic in his eyes when he realized that his ride wasn't waiting for him.  I gave him a casual \"sit over here\" nod, since I think he wanted to avoid any crowds.\n\nAnd he and I sat peaceably on a bench in the middle of nerd exodus for about 20 minutes.  I think I asked him how the show went for him, and he said maybe 5 words total.  We exchanged nods when his car showed up and he was off.\n\nEven though we didn't talk but a few words, I think sitting in comfortable silence with Ron Perlman was my favorite celebrity experience.","isChecked":false,"level":2,"score":"76"},{"author":"spwf","body":"Adam Sandler - Super nice and cool\n\nTom Hanks - Class Act\n\nSeal - Kind of a dick\n\nGeena Davis - Total Sweetheart\n\nJamie Lee Curtis - All I’ll say is “surprisingly reasonable”. She had an objectively bad experience and was reasonably upset by it. \n\nColin Farrell - Totally Cool\n\nMatt Damon - Quiet but polite\n\nWill Smith - Awesome and always “on” \n\nJaden Smith - just like his dad\n\nJason Mamoa - Sweetheart\n\nRay Liotta - Definitely a character but super cool\n\nMichael J Fox - Sweetheart\n\nJames Corden - dick\n\nBritney Spears - I think we caught her in a rough time\n\nKardashians - exactly what you’d imagine\n\nFinn Wolfhard - Kiiiiind of a dick but I’m sure it’s more of him just being young. \n\nTobey McGuire - Quiet but cool","isChecked":false,"level":1,"score":"925"},{"author":"tcatron565","body":"> Britney Spears - I think we caught her in a rough time\n\nProbably. Seems like 99% of her life is rough between the fame and father issues.","isChecked":false,"level":2,"score":"285"},{"author":"BigChickenBrock","body":"Yeah Finn Wolfhard is only 17, I’m sure his ego is through the roof but he’ll get better with age\n\nSurprised about James Corden!!","isChecked":false,"level":2,"score":"251"},{"author":"joe5009","body":"I’ve read a ton of stories about how Corden is a dick","isChecked":false,"level":3,"score":"227"},{"author":"lacxeht","body":"Why am I not surprised everyone that’s ever met James cordon thinks he’s a dick.","isChecked":false,"level":2,"score":"64"},{"author":"Eliasalt123","body":"Damn how have you met so many celebrities?","isChecked":false,"level":2,"score":"45"},{"author":"spwf","body":"Lived either in or near LA my entire life. \n\nWorked in hospitality and food service my entire life.","isChecked":false,"level":3,"score":"114"},{"author":"olive_green_spatula","body":"I was a flight attendant many years and the Kardashians were always insanely polite and kind to us. Because their mom was a flight attendant once upon a time. So it’s interesting to read your take on them ! \n\n(My experiences were with Kim, Kourtney, Kris and Khloe. The other people might be dicks)","isChecked":false,"level":2,"score":"43"},{"author":"margotssummerday","body":"Man this really makes me want more info on Jamie Lee Curtis","isChecked":false,"level":2,"score":"32"},{"author":"spwf","body":"Long story short, she interacted with a *really* new employee who just told her a bunch of incorrect details about policies and services and it made her, understandably, pretty mad so I ended up talking with her and resolving the issue.","isChecked":false,"level":3,"score":"113"},{"author":"RidgetopDarlin","body":"I worked on a project with Michael Franti, who is the kindest, most patient, most humble and most friendly celebrity ever.  He truly treats the janitor job folks with as much respect and attention as the execs.\n\nLovely human being.","isChecked":false,"level":1,"score":"177"},{"author":"BenWallace04","body":"Dax Shepard/Kristen Bell - very good, genuine people.\n\nHere is one of many examples:\n\nhttps://www.inman.com/2020/03/25/amid-pandemic-kristen-bell-and-dax-shepard-waive-rent-for-la-tenants/","isChecked":false,"level":1,"score":"172"},{"author":"WastaSpace","body":"Nikki Sixx went to high school with my parents and was one of my moms best friends at that time.\n\nI got to hang out in his dressing room when they had their first reunion tour. He's a really nice, humble dude. I wouldn't go as far as to say he's immature, but he was very boyish and teenager like. But I guess that's kind of what happens when you become a famous rock star at the age of 19. You never have to grow up.","isChecked":false,"level":1,"score":"802"},{"author":"Known-Leg","body":"Is it true that Kickstart My Heart is about a real life incident, in which he had to be jolted back to life, after a drug overdose?","isChecked":false,"level":2,"score":"37"},{"author":"PeetoomGijs","body":"it is! if you’re interested in motley, you should watch the movie The Dirt, or read the same titled book by Tommy Lee, or The Heroin Diaries by Nikki himself!","isChecked":false,"level":3,"score":"42"},{"author":"TheRealslirnshady","body":"I was thinking of a different Nikki Sixx.","isChecked":false,"level":2,"score":"120"},{"author":"always_an_adventure7","body":"How many other Nikki Sixxs are there?","isChecked":false,"level":3,"score":"41"},{"author":"MatchstickMcGee","body":"Five, I'd assume.","isChecked":false,"level":4,"score":"159"},{"author":"sundrybitch","body":"Katy Perry’s dad is a dick who never shuts up about how he’s Katy Perry’s dad","isChecked":true,"level":1,"score":"175"},{"author":"uglypudding101","body":"Not me but my uncle used to be a professional body guard. He said by far, Tom Hanks was the kindest and the worst was Azelia Banks.","isChecked":true,"level":1,"score":"161"},{"author":"Harrysixx","body":"Yeah she’s a notorious cunt","isChecked":false,"level":2,"score":"29"},{"author":"None","body":"[deleted]","isChecked":false,"level":1,"score":"735"},{"author":"MaineSoxGuy93","body":"It makes me so happy that she called you a boob.","isChecked":false,"level":2,"score":"369"},{"author":"enumthunder","body":"She's literally 5' 6\"\nAnd you said you're a pretty tall guy... 5'7\"?","isChecked":false,"level":2,"score":"39"},{"author":"__littlespoon__","body":"Back in 2004 my mom took me on a trip to LA to do some shopping for my 13th birthday. We went to Rodeo Drive just to look around at all the fancy stores and when we popped into Louis Vuitton I saw Nicky Hilton along with her body guard. Now being a teenage girl in the early 2000’s I absolutely loved the Hilton sisters and Nicole Richie. I went up to her and asked if I could get a picture with her and she said yes! My mom got out the camera to take a picture when the sales staff came running over telling us we couldn’t take pictures inside the store. I was pretty bummed. Nicky then asked me if I’d like to go outside and take a picture with her. I was so excited she dropped everything just to go outside and take a picture with me! We take the picture and talk with her for a few minutes before going our separate ways. She was so kind and very soft spoken. Nothing like you’d read about her and Paris in the tabloids. It made my birthday for sure!","isChecked":false,"level":1,"score":"157"},{"author":"Veleya","body":"So I met Brock Lesnar in Milwaukee WI at I believe a smackdown show. I believe it was John Cena vs Brock Lesnar as the main event and Brock was put through the announcers table at the end. I came up with my sign that said MilBrockee and got to shake his hand I was pry like 10or11 at the time so his hand engulfed mine. Brock was a big heel at the time he patted me on the shoulder and thanked me for being a fan I was upset I didnt get an autograph I had the red and black markers still. 4-5 years later I was at a Vikings Bears Monday Night Football game. Brock was there again I was trying to get players autographs when Brock came up pointed to me and said “MilBrockee?” Absolutely made my already great night even better. And I got him to sign my vikings program this time. Blows my mind he could recognize me.","isChecked":false,"level":1,"score":"159"},{"author":"Lurkymclurkering","body":"Davy Boy Smith - wrestler back in the day - I was at a wave pool in Edmonton. I was around 12 years old, deep end of the pool for the waves. He stole my tube I was floating on and when I grabbed onto it so I didn’t just about drown, he told me to fuck off and shoved me off it.","isChecked":false,"level":1,"score":"584"},{"author":"jenskiguide","body":"Yeah he's famously a prick, I believe. Dynamite Kid was worse. But both were famously disliked","isChecked":false,"level":2,"score":"218"},{"author":"Zuzublue","body":"I’ve run into Stephen King a few times in Bangor, Maine. He’s a chill dude, always willing to smile and chat a bit.","isChecked":false,"level":1,"score":"940"},{"author":"ifnotnowwhen2020","body":"Zac Efron was a douche when I met him but it was during his High School Musical days and he was just a kid then, so who knows what he's really like now.\n\nJustin Timberlake is exactly the same guy you see on TV. That's a real southern boy right there.\n\nAlex Trebek is just an all around cool dude.\n\nMark Harmon is AWKWARD. But his wife is adorable.\n\nMaria Bello is super rude and snotty. Hope to never see her again.\n\nAlan Tudyk is the shit. He was super busy and trying to leave. Since I'm a fan, on his way out the door I called out after him that I'd always love Firefly. Instead of continuing on his way, Alan took the time to come back, ask my name, shake my hand, and thank me for my support. Love that guy.\n\nPierce Brosnan - you know what you did. Fuck you, asshole.","isChecked":false,"level":1,"score":"2184"},{"author":"worthwords","body":"Did Pierce try to swoop in on your estranged wife while you were disguised as an old British nanny in an attempt to maintain a relationship with your children?","isChecked":false,"level":2,"score":"1166"},{"author":"pinkkittenfur","body":"And then was he hit with some fruit in a run-by fruiting?","isChecked":false,"level":3,"score":"174"},{"author":"ifnotnowwhen2020","body":"He tried, but I took him out with a run-by fruiting.","isChecked":false,"level":3,"score":"71"},{"author":"Wonderstruck91","body":"Alex Trebeck always seems like a genuine guy you can tell it when you watch Jeopardy I’m so glad you met him I’m jealous.","isChecked":false,"level":3,"score":"68"},{"author":"nicolascusa","body":"We need to know what Pierce Brosnan did.","isChecked":false,"level":2,"score":"421"},{"author":"ifnotnowwhen2020","body":"Can't.\n\nTo explain the situation, I'd have to give too many details of my old job. Since everyone on here is Columbo Jr, that would definitely get me in trouble.\n\nBut that doesn't mean I can't let everyone know that he's a fucking twat.","isChecked":false,"level":3,"score":"827"},{"author":"nicolascusa","body":"You may never get another chance to tell this story. If not now, when?","isChecked":false,"level":4,"score":"287"},{"author":"Fool_Fighter","body":"In two days when this question gets posted again.","isChecked":false,"level":5,"score":"576"},{"author":"Klutzy-Client","body":"Pierce is a dick. He has a house on Kauai where I used to live and bartend at a local restaurant. He came in 1 minute before we closed and demanded to sit down. There was not one other table in the whole place. My manager came out and told him we were closing and the kitchen was already shut down. He proceeded to whine about it and as he was leaving he span around very dramatically and tripped over my bar floor mats I had stacked by the back door. So as he left, the wait staff and I all laughed at him as he descended the stairs. Pierce is an arse.","isChecked":false,"level":2,"score":"162"},{"author":"EuvageniaDoubtfire","body":"Zac is super nice. Worked with him on Baywatch. Talked to everyone- personally gave a wrap gift to everyone. Great guy. The Rock wasn't as cool as Zac, so he definitely has changed since being 16","isChecked":false,"level":2,"score":"69"},{"author":"maxisthebest09","body":"I work for roadside assistance for a certain brand of car. Sometimes people get locked out of them and we can unlock them remotely. Zac Efron gets locked out like once every few months and has to call in. He's absolutely hilarious and struggles to remember any of his account information.\nOne time he called in and offered to sing any song from High school Musical to prove it was him.","isChecked":false,"level":2,"score":"66"},{"author":"bgazm","body":"I worked as a waiter at a popular restaurant near San Francisco for a few years. It used to be a super popular spot back in the 60's/70's as it offered the celebrities of that time a place to dine just outside of the city without the crowds of fans. A lot of them would still visit on occassion during my employment there (2009-12). \n\nMy favorite individual encounters are waiting on Robert Plant and Alison Krauss, and serving apps to Robin Williams and his wife. They were all really nice given the setting. I didn't really exchange any conversation besides telling Robert Plant that I was a fan when dropping the check, and him thanking me. I can't remember exactly what they ordered to eat, but I know he had a virgin Bloody Mary to drink. \n\nEvery time someone famous came in was exciting to me but my more tenured co workers were pretty used to the sightings. I remember noticing the height difference between Williams and his wife, as well as her looking very beautiful. Of course, seeing his legendary smile irl that I had grown up watching my entire life will be a permanent memory of mine.\n\nCarlos Santana came in once and was seated in my section, but I gave the table to another server higher up on the food chain who had waited on Carlos more than once in the past. He was wearing white pants, a white jacket, and a nice looking fancy white hat. He had a bowl of Bouillabaisse (iirc) and was also one of the first customers to walk in that day. Most first comers during the summer snag tables on the patio that look out across the bay, but he wanted to sit inside next to a window. After his meal, he went through the kitchen and took a few group pictures with all of the cooks and bussers. Seemed really friendly.\n\nBonus bogus \"celebrity\" experience having to wait on a C list actor that was in the 2010 \"Alice in Wonderland\" film. He made SURE I knew that he was in an upcoming Disney remake featuring Johnny Depp. This was before I had seen any sort of advertising for the movie, and I still haven't actually watched it so I'm not sure if he even made the cut. He got wasted drunk and was an arrogant ass. Think he told me that he was the hot air balloon pilot? Or something? Guy sucked. First time I ever served St. Germain.\n\nAlso, I waited in line for Space Mountain at Disneyland with Sean Penn and his also famous wife at the time and their kids. I noticed it was him while he and his son were standing in a semi roped off area just outside of the actual line where the rest of their family stood. An employee eventually came over and reminded him that they couldn't wait there and they hopped back in line one or two parties ahead of me. When the line turned into a switch back style and he was facing me I flashed the measliest peace sign a pimply faced star struck teenager could, and he nodded in turn. The fact that he and his family were actually waiting in a 40 min line for a ride, and the way he responded when asked to get back in line, made him seem more human to me.","isChecked":false,"level":1,"score":"435"},{"author":"Feel_Suicidal_Inc","body":"Phil Vischer and Mike Nawrocki, the voices of Bob and Larry from Veggietales, were nice.","isChecked":false,"level":1,"score":"556"},{"author":"Stopman","body":"Ugh, those guys must be so sick of getting recognized everywhere they go","isChecked":false,"level":2,"score":"442"},{"author":"ninjazombiemaster","body":"It's hard to be incognito when you're a giant sentient vegetable.","isChecked":false,"level":3,"score":"317"},{"author":"RedBeardBigHeart","body":"Sylvester McCoy came through my line at Target once. I recognized his voice and just kept telling myself it wasn’t him. I couldn’t shake the feeling so I asked\n\n“I know this sounds stupid but you sound like The Seventh Doctor.”\n\nHe answered coyly “The truth is ( he puffs up his chest) I am him.”\n\nI totally geeked out and Davros (Terry Malloy) was with him. I never got a photo but hot damn we’re they just amazing people.","isChecked":false,"level":1,"score":"145"},{"author":"unnaturalorder","body":"My mom was hiking in the mountains in Georgia and saw a couple people wearing headsets walking around with some local law enforcement. She thought she'd stumbled upon some crime scene, but it turned out they were a film crew being looked over by the sheriff's department while \"A Walk in the Woods\" was being filmed. She got to meet Robert Redford and Nick Nolte. Both of them were apparently very nice.","isChecked":false,"level":1,"score":"295"},{"author":"ap1indoorsoncomputer","body":"Emilia Clarke is a really nice person and hasn't let fame go to her head at all.","isChecked":false,"level":1,"score":"1094"},{"author":"IrascibleOcelot","body":"The stories she tells about Jason Momoa are pretty hilarious as well. Apparently, they’re really good friends.","isChecked":false,"level":2,"score":"342"},{"author":"ap1indoorsoncomputer","body":"She gets on well with the whole cast :)","isChecked":false,"level":3,"score":"75"},{"author":"RedWestern","body":"I love watching her in interviews. I don’t care if it’s all an act, or if she really is just always unintentionally cute in everything she says or does, but it really warms the heart.","isChecked":false,"level":2,"score":"82"},{"author":"360Saturn","body":"Finding out she had brain surgery while filming Game of Thrones and that's why she looked like she was having a hard time expressing emotions sometimes really changed my opinion of her. She seems like a sweet person & is surprisingly funny too.","isChecked":false,"level":2,"score":"48"},{"author":"coleeford","body":"Y’all should listen to her on Dax Shepherds podcast Armchair Expert. Her laugh is so genuine and infectious. She’s the celebrity I’d most want to hang out with","isChecked":false,"level":2,"score":"38"},{"author":"AryaStark20","body":"She's a puppy in human form, i love watching her interviews.","isChecked":false,"level":2,"score":"30"},{"author":"FreddieGregg","body":"I ran into Bill Nighy in Leicester Square a few years back. It was nighttime and I very literally ran into him. I was holding some playbills because I had just seen a show, and when I hit him, I dropped everything I was holding. He bent to pick them up, and as he handed them to me I realized who he was (I love both Harry Potter and Love Actually, so I for sure adore him). He realized I knew who he was, so he put his fingers to his lips to shush me, and then scampered away. I've met a billion celebrities, but his was my favourite because it was just so weird.","isChecked":false,"level":1,"score":"865"},{"author":"njgreenwood","body":"It somehow seems very on brand for him.","isChecked":false,"level":2,"score":"243"},{"author":"dbizzle_hm","body":"I met Bill whilst he was filming ‘Dads Army’ in a building next door to my work. Both buildings shared a car park so, when I went for a cigarette at lunch time, I asked Bill’s driver if he could get me an autograph as I’m a huge fan.\n\n10 minutes later I’m back at my desk and see Bill walk to get in the car, and his driver says a few words and points at the office. He immediately walks up and knocks on the door, strides in and exclaims “I think I need to have a few pictures with you!” and spends 20minutes taking pictures and chatting. He then come to me the next day with a signed picture, remembered my name. Best dude ever!\n\nMichael Gambon, Catherine Zeta Jones, and Toby Jones were also there too. Fuck Gambon!","isChecked":false,"level":2,"score":"49"},{"author":"slackbabbith","body":"Met Colin Mochrie at some obscure convention in my city. He actually talked to us for a few minutes and I basically just fan-girled about Whose Line and Royal Canadian Airfarce. Really great guy, he has my absolute respect.","isChecked":false,"level":1,"score":"144"},{"author":"FeralGinger","body":"Super nice: R. Lee Ermey, Billy Joel, Garth Brooks, the Irish Tenors\n\nPolite but not interested in engaging with a stranger: Keith Urban \n\nKind of a dick: Kenny Chesney","isChecked":false,"level":1,"score":"643"},{"author":"Stunning_risotto","body":"Once I was working in a venue where Keith Urban was playing a show later that night. He was standing blocking this door like a dumb shit. I'm trying to get through while carrying a 21' length of 2\" steel pipe, and the guy didnt even try to open the door for me.\n\nThe same day though,  I saw him walk across the parking lot to play some songs to a 5 or 6 year old fan and his mom, so I guess it evened out.","isChecked":false,"level":2,"score":"70"},{"author":"mermaidmalia","body":"Garth and Trisha used to live a mile or so away from me, I would see them at grocery store, Walmart, gas station, just random places in town. They were both very nice and genuine.","isChecked":false,"level":2,"score":"50"},{"author":"everythinglatte","body":"I got a hug from Hozier after one of his concerts. There wasn't a meet-and-greet, a friend and I were hanging out by the stage door with some fans and we managed to get to the front row.  He came out and everyone was losing their minds, screaming and crying. I just asked if I could hug him and he smiled, said \"Of course!\" and gave me such a warm and tight hug. He was a kind soul and I hope everyone listens to his music at some point. \n\nI also met Tyler Perry in an elevator once. He was staying a few floors above my family in a hotel. Super nice guy and really great personality.","isChecked":false,"level":1,"score":"517"},{"author":"SamantherPantha","body":"Omg I adore Hozier, I am quite envious right now. I love that you just asked for a hug, I would never have the guts to do that!","isChecked":false,"level":2,"score":"44"},{"author":"nerdgerm","body":"Tom Hanks, absolutely nice. I met him when I worked at in n out burger a few years back. I took an order to his table & was startled when I saw his & I asked “Are you Tom Hanks.” & he looks up from his meal, gives the biggest friendliest smile & says “you betcha.”\n\nWhen I’m clocking out & leaving he’s heading out exactly as I am so I hold the door open for him, & he greets me with a Thank you. & as he & his son are walking away I say “Mr. Hanks if it’s not any trouble could I possibly take a picture with you?” He turns around with another big grin & says “walk with me kid.” So we talked for about 10 minutes, he asked me about my life, told him all of my favorite movies he is in. He gave me some life advice & his son (very nice but just quiet) took some pictures of us. He gave me a handshake followed by a hug saying it was nice to meet me. I said “I’m glad the most famous person I got to meet was you.” Then they left.\n\nNeedless to say my co-workers stared through the windows the entire time & then hounded me for a week about it.","isChecked":true,"level":1,"score":"280"},{"author":"sn0m0ns","body":"Danny Devito is one of the nicest people on earth.","isChecked":true,"level":1,"score":"712"},{"author":"Punkybrewster725","body":"Doesn't surprise me. During the filming of Matilda, he took Mara Wilson in while her mom was dying of cancer.","isChecked":false,"level":2,"score":"90"},{"author":"piddlesthethug","body":"I got hired to work a gig setting up a big LED wall for an afternoon for a musical act on a late night talk show.  We worked our asses off getting the LED wall ready, and had a while between the performance and tear down. We were told we could go to the green room to grab some water/sodas/whatever, but not to stay in there if there was anyone else and don’t bother any celebrities. We grab some sodas and walk out of the green room. One giant wall of the green room was all glass, so we went on the other side of the glass wall and hung out, hoping to catch a glimpse of any celebrities. \n\nEventually Danny Devito walks into the green room, on the other side of the glass wall from us. Unbeknownst to any of us he was the celebrity guest that day. He waves at us from the other side of the wall, and then starts gesturing to all of us making the international hand gesture implying to smoke a joint. We’re all laughing and confused. He walks through the glass door into the same room with us and asks if any of us smoke pot. \n\nI was ready right then and there to get fired for smoking a joint with Danny Devito, but unfortunately no one had anything. We shot the shit with him for a little while and told him he was awesome, etc. \n\nMan I wish I could have gotten fired that day. He was an awesome guy to meet.","isChecked":false,"level":2,"score":"37"},{"author":"theoriginalhigh","body":"I feel like I just answered this recently, lol.\n\nAdam Lambert is a absolute gem, and I say this without bias. He's extremely kind, remembers me when I see him, and makes an effort to honestly connect with you. Even told me that it was nice to see ME again when I last saw him, haha. I've had some definite moments of feeling special while being around him, and that's a great feeling when you admire someone. <3","isChecked":false,"level":1,"score":"906"},{"author":"smashasaurusrex","body":"I waited on him in NYC once. I charged his phone for him. He didn’t know about the airplane mode trick for iPhones. I did it for him and he was very grateful. His friends picked up the check (around $240). They left $20. He came back and gave me $60.","isChecked":false,"level":2,"score":"425"},{"author":"naturalistwork","body":"This is off-topic but airplane mode trick? I just got an iPhone for the first time ha ha","isChecked":false,"level":3,"score":"36"},{"author":"smashasaurusrex","body":"If your phone is running low on battery and you want to charge it quicker, put it on airplane mode.","isChecked":false,"level":4,"score":"67"},{"author":"Ghost2Eleven","body":"I work in Hollywood. So I've encountered a lot of celebrities. \n\nNicest: Tom Hanks\n\nCoolest: Dwayne Johnson\n\nFunniest: Danny DeVito\n\nMost Genuine: Adam Sandler\n\nSweetest: Diane Keaton\n\nMost Outgoing: Adam Levine\n\nWildest: Steve-O\n\nMost Down-to-Earth: Jon Bernthal\n\nMost difficult: Jennifer Lopez","isChecked":false,"level":1,"score":"259"},{"author":"Djinnwrath","body":"Worked on a Music video with both Pee Wee Herman, and Karen Gillan.\n\nPee Wee was super dickish and demanding and made the producers lives hell the whole time, and I only saw him when he was needed on set, had to be driven to and from his AC dressing room 30 minutes to film site. Complained the whole time. Had his own catering. Showed up late.\n\nKaren was super chill. Ate with the crew, answered questions about Doctor Who and Marvel, did costume changes in a pass van, and was generally down to earth and charming. \n\nAlso very tall. Wasn't expecting that. I have a hard time with super attractive women already,  and her towering over people really added to that.","isChecked":false,"level":1,"score":"466"},{"author":"Ladybird1412","body":"I'm so glad that Karen was nice because she just seems like a gem in everything I've seen her in. (Interviews, Instagram etc)","isChecked":false,"level":2,"score":"123"},{"author":"smv18","body":"I am a fan of Karen’s and to know that she’s a sweetheart makes me soo happy. She’s always come off that way to me","isChecked":false,"level":2,"score":"58"},{"author":"la-noche-viene","body":"A few years ago Helen Mirren came to my job. I worked as a weekend hostess at a Ukrainian diner in NYC's the East Village, and very famous for its pierogis. I didn't know who Helen Mirren was at the time, and as it was a busy Saturday brunch, I asked for her name, put it on the wait list and let her know it would be 20 minutes. She just stood off to the side and talked with her two other companions. Never bothered me. Never demanded to be seated sooner. Never brought up her celebrity status. Customers kept coming up and asked if that was THE Helen Mirren. My boss eventually made me seat her before everyone else. Helen looked at her watch and remarked it hadn't been 20 minutes! All in all, Hellen Mirren 10/10 lovely person.","isChecked":false,"level":1,"score":"250"},{"author":"diadochokinesisSLP","body":"I’m from Nashville so most of mine are country music related. \n\nDolly Parton is just one of the sweetest and most genuine people you will ever meet. \n\nThe Judds: the whole family is batshit crazy. Naomi (the mama) started smacking a male dancer with her purse in an Italian restaurant that the parents hired to celebrate their kid’s sixteenth birthday. Wynonna is crazy and has had a bunch of alcohol issues. Ashley is the nicest and most normal and probably due to the fact that she was treated like crap growing up. \n\nTim McGraw and Faith Hill: I worked at Old Navy while I was in high school and waited on them. Really sweet people. She hung up things back where they belonged if she decided she didn’t want them and never once told anybody who she was. She went in without any hair or makeup so a lot of people didn’t immediately recognize her. He has really good hair plugs but also just a really nice guy. \n\nKenny Rogers: friend of mine’s dad was in his band. Also a good guy. Very funny and very generous. \n\nTanya Tucker: Crazy. Like, bag full of a crazy cats on catnip level of crazy. Probably due to the drugs at the time.","isChecked":false,"level":1,"score":"553"},{"author":"SC487","body":"Dolly Parton is a national treasure","isChecked":false,"level":2,"score":"165"},{"author":"wutdafuqizdis","body":"Also from Nashville and have met a lot of celebrities through working in the biz. I won’t go on about all of them but just a couple to note. \n\nJohn Rich is every bit of the asshole he is rumored to be. \n\nBrad Paisley is awesome. I went to his house and met his family and they were all very genuine people. \n\nTanya is definitely batshit crazy.  Drugs are mmmkay?\n\nDierks Bentley is just a good ol boy and super chill and very polite. \n\nJohn Popper is cool as a cucumber.  Seemed like a humble guy and also very polite. \n\nDarius Rucker was kind of a dick.","isChecked":false,"level":2,"score":"35"},{"author":"Moist_666","body":"Lived in Nashville from 2017-2019. Got the absolute pleasure of meeting John Prine at a guitar shop. He had a few guys around just ferrying him guitars. I was one of the rooms looking at this real old guitar trying to be cool and a voice behind me goes “Quite a contraption there” and walked away. Most John Prine thing he  could have said. I loved it. RIP John. \n\nAlso met joe bonamassa at guitar center. He was buying a 6,000$ guitar and we chatted it up for a few minutes about the guitar. He then went home and posted a photo of it on Facebook. \nGotta love Nashville.","isChecked":false,"level":2,"score":"30"},{"author":"soaked_cigarette","body":"Not a story of mine, so can’t really confirm but nevertheless made me laugh my ass off.\n\nSo a friend of mine had the chance to meet Patrick Roach (Guy who plays Randy in Trailer Park Boys) in a party. Being a huge fan of the show, my friend walks up to him and tells him how he’s been a fan of the show since childhood and how he respects his acting. Apparently the guy just looked at him, said “Oh that’s cool man! Watch this!” And proceeded to pound fat line of coke through his nose right in front of him...","isChecked":false,"level":1,"score":"458"},{"author":"bgazm","body":"I'm believing it. BO BANDY!","isChecked":false,"level":2,"score":"73"},{"author":"slackbabbith","body":"I used to rap and did shows in my city, the dude who booked our shows also did comedy shows too. He's done several events with people from TPB, I've met Randy, T, and J to the R to the O to the C. Very chill people. Watched Randy getting extra greee-hee-hee-heeeasy in a hamburger eating contest. I believe your story 100%.","isChecked":false,"level":2,"score":"44"},{"author":"antikythera3301","body":"I spent some time on TPB set as an extra and I can assure you this story sounds very plausible.","isChecked":false,"level":2,"score":"34"},{"author":"ilikeyourswatch","body":"Nice:  \n\nEd Sheeran. In 2013, my husband was working at a stadium and got free tickets for my 13-year-old niece to see Taylor Swift, but she was mostly excited for Ed. He was relatively unknown at the time and was the opener. This was the 2nd night of the show, so my husband knew that if we were back stage at his office at a certain time (after he sang a song with Taylor), he would pass by. So, we went back and waited and, sure enough, he came upon us with his band. We were the only people around and my niece was *barely* holding it together, she loved him so much . He talked to us for several minutes, signed everything she asked, took photos (photo of them together https://imgur.com/a/grDH5hH) and have her his guitar pick. Could not have been nicer. She lost it and started bawling her eyes out as soon as he left. It was incredible. I felt like the coolest aunt in the world. \n\nGwyneth Paltrow, back in 2003 or 4, just before she announced she was pregnant the first time. She was staying in the hotel that I worked in as a shoe shine girl. We just made small talk, but she was very sweet and I felt like an equal with her.\n\n\nI worked as a hostess in LA and these stood out as bad:\n\nMartha Plimpton was very condescending \n\nI got a \"do you know who I am\" from Jeffrey Tambour when I didn't recognize him right away\n\nSteve Madden said, \"do you know who I am? I'm Steve Madden. I have a store right down there on the promenade\" when he came in with 12 people and I didn't immediately have a table for him.","isChecked":false,"level":1,"score":"121"},{"author":"bonjovigirlpa","body":"met Jake Gyllenhaal at stage door after his play off-broadway last february. i was super nervous bc he’s my favorite actor and had heard stories of him not being nice. we said hi and as he was signing my playbill a lady shoved in front of me and demanded he sign her playbills for her daughters and that she “just has to get a photo!” he looked so uncomfortable and kept looking back at me, but he signed them anyway. im only 5’3 and was 17 so i just let it happen because i hate confrontation and was a lil starstruck by Jake. \nWell he told her off and said “you’re going to have to wait because i’m going to spend some time talking to her *points to me* because you cut her off.” he then turned so he was fully looking at me and HE apologized to me for her behavior. i just about died. we had a short conversation about his work, i thanked him profusely, and we took a photo. i have so much respect for him for handling the situation so well and all of my nervousness completely evaporated","isChecked":false,"level":1,"score":"123"},{"author":"Cripnite","body":"Ran into Stone Cold Steve Austin outside the Toronto Skydome after WrestleMania 18. I told him he had a good match that night and he shook my hand and said “nice to meet you sir”. Seriously the only person I’ve ever been ok with calling me “sir”. I was like a 21 year old nobody at the time.","isChecked":false,"level":1,"score":"721"},{"author":"willis1988","body":"Would have preferred him to flip you off to maintain the aura but that's nice too I guess :)","isChecked":false,"level":2,"score":"217"},{"author":"vadermaybelater","body":"I worked at the premier hotel in my town so I've met quite a few:\n\nBill Cosby- was nice and made conversation\n\nPrince: pissed off because we said he couldn't smoke in the room. He then tried to bribe us.\n\nPatrick Warburton: nice but really tired looking. \n\nRingo: still wants to be popular and will do his best to remind you of it.\n\nMayweather: was really nice, TV seems to make him more mouth than what he is. He does have like 30 people that ride with him though.\n\nSeal: Quiet doesn't say much and just wanted to go to sleep.\n\nDonald Trump: very business and his body guards dont play. Had to send two employees home at the order of secret service.\n\nUsher: Went to his room and saw to girls sleeping at the door. He turned around and told us he would ne sleeping in his bus.\n\nLarry Holmes: a has been that wants free rooms and can't accept that the world has left him.\n\nMalcome of malcome in the middle: really nice and didn't look like he had aged any.\n\nKesha: I delivered the message table and she answered in a towel. She was really sweet but doesn't tip.\n\nWayne Gretzky: a insufferable asshole that his wife had to keep apologizing for his bad attitude.\n\nRichard Karn of home Improvement: Really nice and way down to earth.\n\nLarry the cable guy: He actually told his security to back down so he could see his fans.\n\nWwe: these guys are very well behaved and very professional.\n\nDana Carvey: was very chill checking in and even did a Garth impression from Wayne's World without us asking.\n\nMinor soap stars can be the worst: several females with minor roles will constantly say \"I'm an actress\" when ever asking for specific stuff.\n\nJesse Jackson: Always has to be in the presidential, request massage therapist at odd hours and remains very professional at checking in.\n\nI'll add or answer questions as I go.","isChecked":false,"level":1,"score":"1241"},{"author":"happybuffalowing","body":"“Wwe: these guys are very well behaved and very professional.”\n\nBack in the day, it was a different story. Pro wrestling was like the Wild West, at one point lol","isChecked":false,"level":2,"score":"400"},{"author":"vadermaybelater","body":"Oh yea I heard that about them. Today they just come in het their room keys and that's it. Some will hang around in the lobby and drink but they are so well behaved. Also they are very nice to other guest. I do imagine some aren't.","isChecked":false,"level":3,"score":"69"},{"author":"happybuffalowing","body":"Yeah in a Post-Benoit world, Vince McMahon is very strict about his wrestlers not attracting any kind of negative attention","isChecked":false,"level":4,"score":"75"},{"author":"Flahdagal","body":"Randy Savage (yeah, wwf, not wwe) was one of the most polite, gracious guys you could meet, per my mother-in-law.","isChecked":false,"level":3,"score":"39"},{"author":"Zenkikid","body":"the WWE guys:  \n\n\nIm not surprised because WWE is so strict nowadays. Any slight bit of misconduct that goes viral they could either be sent home and not be paid for a forseen amount of time or fired.","isChecked":false,"level":2,"score":"62"},{"author":"comeththearcher","body":"Kesha strikes me as the type of person that doesn’t KNOW she’s supposed to tip.","isChecked":false,"level":2,"score":"248"},{"author":"vadermaybelater","body":"It's very possible but she was polite.","isChecked":false,"level":3,"score":"101"},{"author":"rationalparsimony","body":"I'm sure they didn't give a reason, but any idea why the Secret Service told the hotel to dismiss two employees?  I guess that was while Trump was there, not a permanent dismissal?","isChecked":false,"level":2,"score":"52"},{"author":"vadermaybelater","body":"Most likely it was social media. They arrive 2 weeks before the president and basically take over the hotel. Each employee is fully investigated including social media. Any type of major fowl talk can get you dismissed. They were allowed to come back after he fully left.","isChecked":false,"level":3,"score":"85"},{"author":"1bentpushrod","body":"The Secret Service doesn’t fuck around. Also, the President generally gets overruled by the Secret Service when the President wants to be lax, they take zero chances.","isChecked":false,"level":4,"score":"72"},{"author":"DigitalPriest","body":"Yuuup.  Hilary Clinton spoke at my brother's High School while Bill was still in office, so she had Secret Service protection at the time (hell, she might still do, I don't know.)  Obviously this was before 9/11, but it was *after* Oklahoma City.  This was before Columbine as well, so while school violence existed, it wasn't a bogeyman like it became afterwards.\n\nOne kid apparently thought it would be a great idea to bring a squirt gun painted black to the assembly, not thinking that *of course* the Secret Service would be vetting who came into the gym, and no one was allowed in with bags.  Because he can't enter the gym with the bag, and desperate to pull his stunt, the kid pulls it out and Secret Service descend on him (according to my brothers, and later, my teachers) like angry monkeys finding the last piece of fruit.  Five guys, each one holding a limb, carried the kid right the fuck out of there, and he never attended that school ever again.  Hilary wasn't even in the building yet, and wouldn't be for about 20 minutes.  Secret Service wanted everyone in the room and settled before she even entered the building.","isChecked":false,"level":5,"score":"66"},{"author":"Elbowedrope419","body":"Did they terminate the child wtf","isChecked":false,"level":6,"score":"63"},{"author":"Frankandthatsit","body":"I have a friend who works at a hotel. Yes, when heads of state or other folks come to a hotel, they make anyone with certain felonies etc. go home for the day. It's all done by secret service and is just for the duration of the stay.","isChecked":false,"level":3,"score":"38"},{"author":"JJsGirl83","body":"I've met quite a few guys/girls from wrestling over the years and the nicest ones have been:\n\nTommy Dreamer - absolute sweetheart and happy to have a chat individually with everyone there\n\nMick Foley - just so sweet and one time, he waited and did a meet n greet for everyone in the venue, not just those with VIP tickets.\n\nWilliam Regal - he could see I was a bit nervous to meet him but he was charming and very much a gentleman.\n\nRowdy Roddy Piper - so down to earth and I made laugh when I mentioned I'd found his song (not his theme music) on YouTube.","isChecked":false,"level":2,"score":"35"},{"author":"jacko865","body":"Hope you didn’t take cosbys drink","isChecked":false,"level":2,"score":"35"},{"author":"NotClayMerritt","body":"I've heard a lot of stories about Prince. If things weren't to his perfect satisfaction, he'd be an absolute nightmare to deal with or be around. But similarly, if everything was going well, he'd be one of the nicest and most fun people you could ever know. Bit of an enigma, I'd say.","isChecked":false,"level":2,"score":"30"},{"author":"Bethlizardbreath","body":"Jimmy Carr was awesome, kind patient and funny, even though were probably being quite annoying. He even signed my Sylvia Plath book.","isChecked":false,"level":1,"score":"118"},{"author":"beardown505","body":"I’ve met Keanu Reeves, and I just wanna say he’s just as lovely in person as Reddit says he is! Met him at a subway and he’s one of the few celebrities that actually bothered to converse with me and thank me when I told him what a big fan I was, very lovely guy indeed! My only regret is that I didn’t carry my copy of 47 Ronin that I usually carry around with me, but that doesn’t change that he was still very great!\n\nMakes a lot of sense as to why /r/KeanuBeingAwesome exists, because he really is that awesome.","isChecked":true,"level":1,"score":"2449"},{"author":"hwlgrmmr","body":"...I don't wanna be a dick but are we just gonna gloss over your apparent habit of carrying around a copy of 47 Ronin?","isChecked":false,"level":2,"score":"1041"},{"author":"KingKnux","body":"You mean you don’t?!?!?","isChecked":false,"level":3,"score":"243"},{"author":"missnotsoperfect","body":"Courtney Cox, she was the sweetest woman I've ever met","isChecked":false,"level":1,"score":"421"},{"author":"Foo-Fighters-Fan","body":"I had Nick Hogan, Hulk Hogan's son, for a client at my business about 10 years ago. The kid gets a bad rap. For being so young, he was very professional, understood the business we were doing, and was impeccably polite.\n\nAfter working with Nick for about two years, he stopped by my office one day and the Hulkster walked in with him. I did a happy dance on the inside, but played it cool on the outside. Hulk just kind of hung around our lobby while Nick and I had a brief 10 minute meeting.\n\nWhen I walked Nick out of my office, he introduced me to his dad, Hulk Hogan. I shook hands with Hulk and said it was nice to meet him. Like Nick, he was super nice.\n\nNick kind of looked at me, smiles, and says, \"You want a picture with my dad?\" Remembering which of them was my actual client, I said, \"Really, I'd like a picture with both of you if it's okay!\"\n\nAnd that's how I got a picture of me with Nick Hogan on my right and Hulk Hogan on my left.","isChecked":false,"level":1,"score":"109"},{"author":"KLGAviation","body":"Drew Barrymore is great. In 2009, I was in college and flying home from MIA to JFK for Thanksgiving. I saw her at the top of the escalator to my gate being swarmed by people asking for photos. For whatever reason, my dopey closeted 19-yr-old self decided that yelling “Drew! I love you so much!” was the appropriate thing to do. I swear to you, she locked eyes with me and used it as an excuse to get away from the crowd. We rode the escalator down together and she said something along the lines of “you’re so sweet, thanks for getting me out of that!” and we talked about our Thanksgiving plans. She ended up being on my flight back to NY. All in all our interaction lasted 30 seconds, but she was so kind and down to earth, I’ll never forget it. I work in the film industry now, and hope our paths cross one day so I can tell her how she completely made my day back then, aha.","isChecked":false,"level":1,"score":"114"},{"author":"borgia30","body":"Woody Harrelson came to my college and ended up hanging out drinking and smoking with us. Nice guy!  The highlight was when he sang The Kelly Song (from Cheers -  yeah I'm old) to my friend Kelly.","isChecked":false,"level":1,"score":"216"},{"author":"natasjanssen4","body":"Patti smith, Eleftheria Arvanitaki and Linda van Dijk. Absolutely nice and sweet people but on the job.","isChecked":false,"level":1,"score":"381"},{"author":"willis1988","body":"Had to look up the last 2, for those similarly ignorant:\n\nPatti Smith - US punk singer\n\nEleftheria Arvanitaki - Greek singer\n\nLinda van Dijk - Dutch actress","isChecked":false,"level":2,"score":"268"},{"author":"striped_frog","body":"Thanks I thought the second one was a spell from Harry Potter","isChecked":false,"level":3,"score":"575"},{"author":"FlusteredPigeon","body":"Emma Stone is nice, but very into herself.\n\nI met her in a very quiet and rural petrol station where I worked at the time, and genuinely had no idea who she was. She made small talk with me while buying some goods, and I just thought she was an overly-friendly person.\n\nThen as I was ringing up her items she looked at my with a smirk and said \"don't you know who I am?\" and looked a bit deflated when I said \"no, sorry?\"\n\nDidn't realise until my coworker pointed out who she was after she had already left.","isChecked":true,"level":1,"score":"193"},{"author":"youbemyfriend","body":"It’s crazy and kinda sad that people actually ask that question.","isChecked":false,"level":2,"score":"83"},{"author":"chaosrunner87","body":"I met Andre Benjamin (Andre 3000) in 2005 when I worked a movie theater on the outskirts of Atlanta.\n\n This was right after Hey Ya was played everywhere, so my nerdy white boy self knew *of* him, but didn't really know anything about him. He came up to my register for a coffee and I admitted I knew he was famous but had forgotten his name. He laughed and told me, and said he was there to see Sin City. I told him I'd keep quiet about him being there so he wouldn't get hassled, and then he immediately got hassled by like five teenage girls when he was halfway across the lobby. Super nice guy, I told the woman that he was there with that I felt bad he was getting bugged by everyone. It's my one celebrity encounter, so I'm glad I got to meet such a genuinely nice guy. I could easily see some other celebrities blowing up if someone said they forgot their name.","isChecked":false,"level":1,"score":"98"},{"author":"neuroscience_nerd","body":"Hugh Jackman - super nice","isChecked":false,"level":1,"score":"96"},{"author":"lyribit","body":"My dad tells us the story of a coffee date he went on in college, and the girl he was with noticed Tim Curry was there ordering a coffee. She keeps trying to make eye contact but eventually realised that Tim was checking out my dad! \n\nI'll be honest my dad's not a very serious man, but he swears this one is true. Either way take it with a grain of salt","isChecked":false,"level":1,"score":"275"},{"author":"Stimperonovitch","body":"Kathy Kinney (Mimi on Drew Carey) - she was a really nice person.  I met her in a Kohl's checkout line and she shook my hand with a big smile.  She's lovely in real life as well","isChecked":false,"level":1,"score":"271"},{"author":"hmmmmmmmnmn","body":"not me but my mother is friends with a lot of celebrity photographers and apparently Ariana Grande is a diva that whines a lot and is just a straight bitch.","isChecked":false,"level":1,"score":"904"},{"author":"hwlgrmmr","body":"I don't often judge people for one stupid mistake they've made, but I have a hard time believing she's a decent person after her donut licking debacle.","isChecked":false,"level":2,"score":"515"},{"author":"WELL_FUCK_________","body":"the thing about that is it's not just like a mistake or a bad moment - to do something like that you have to be both incredibly immature and think you're the shit.","isChecked":false,"level":3,"score":"130"},{"author":"IamAWorldChampionAMA","body":"Back when Michael Phelps was doing his run in the Olympics I had a lot of friends where where either current or past athletes. I called one of my friends and he says \"Hold on I want you to talk to someone\"  \n\n\n\"Hi <my name> this is Michael Phelps.\"  \n\n\n\"Oh hi Michael. Are you an Olympian like my friend?\"  \n\n\nThen there was silence, my friend gets back on the phone and chews me out. I was amused.","isChecked":false,"level":1,"score":"884"},{"author":"AppletonSF","body":"It has always been my dream to shut down a celebrity I don’t care about like that, however not an Olympic athlete that works really hard, more like an actor that spends way to much time bitching on Twitter","isChecked":false,"level":2,"score":"259"},{"author":"wallaballabingbong","body":"Hands down Amy Adams. Spotted her and she was so sweet. I didn’t make a big deal or say her name loudly. I calmly walked up to her and whispered “I love your work”. She was wearing a hat and was with her family so I could tell she wasn’t trying to attract attention. Once she realized I wasn’t asking for an autograph or a picture she really opened up. I’m a cinephile and named just about her entire filmography. She was impressed I knew who directed those films as well. After a few minutes, it was a situation where we were waiting and killing time so she didn’t have anywhere to be, she introduced me to her husband and daughter. I’ve met a ton of celebs in my life and their guard goes down if you acknowledge their work, don’t make a scene and don’t ask for anything. \n\nHonorable mentions are Dave Chappell and Matthew McConaughey. Just super genuine and down to earth.","isChecked":false,"level":1,"score":"94"},{"author":"onioning","body":"Tyler Florence tipped me 50% on an expensive caviar purchase. I did save him a giant pile of cash by convincing him to buy a better but cheaper product than that imported Caspian shit. Dude doesn't exactly have the sort of image that I admire, but the whole exchange was pretty pleasant, and he came across as reasonable, knowledgeable, and considerate.\n\nMartin O'Malley (former Mayor of Baltimore, perhaps best known for being \"the other guy\" running for pres besides Bernie and Hillary) visited the restaurant where I worked, and spent a bunch of time greeting people. Then he left. Shortly after he returned, came to the kitchen, and apologized for leaving without greeting us. I know that didn't exactly require a ton of effort, but I appreciated the gesture.\n\nJohn Waters will just talk your god damned ear off. I'm from Baltimore, and ran into him a few times. Dude will just talk. It gets to the point where you gotta be all \"great talking to you and all, but I really got things I need to do and places I need to be.\" I think this is far less the case now since he's so old and getting a bit feeble, but that dude just loves people. \n\nViggo Mortenson did a photo shoot at my place of work, along with Terry Gilliam, who I was a huge fan of at the time. Terry was in and out, and I literally didn't hear one word come from him, but Viggo stayed afterwards to hang out with us service staff. He even gave me a pie, which I had for dinner. Invited us to go drinking with him, but I had a hot date that night, and hot date > drinking with Viggo. Though in hindsight, the \"hot date\" was pretty trash, and I should have taken him up on it.","isChecked":false,"level":1,"score":"334"},{"author":"JeannValjean","body":"I met Bill Clinton at a book signing in DC right after he published Back to Work around 2009.\n\nHe took about a minute with each person, which seemed very generous considering how many people were there.\n\nWhat really struck me was how mentally sharp he was.\n\nHe was speaking with the woman before me, who was an astrophysicist, about string theory. I don't mean that he was passively listening to her describe her field- he was *engaging* in brief conversation about it at more than an introductory level. In less than 60 seconds.\n\nWhen I walked up I explained I was getting the book signed as a gift for my friend, who was getting a PhD in Political Science and studying (at the time) whether and how genetics affects political bias. President Clinton *immediately* switched to talking about some really interesting studies of twins and other minutiae in that field of which I was vaguely aware from having conversations with my friend.\n\nHe seemed like a nice, genuine guy who knows a little about everything and can easily get along with anyone. I guess that's why he was a good politician (strictly speaking, regardless of your own views of him).","isChecked":false,"level":1,"score":"1065"},{"author":"CassiopeiaStillLife","body":"He also has an absurdly good memory (ironically enough). A friend of mine met him at a meet and greet once, then ran into him five years later. Bill immediately remembered this random dude’s name from five years ago.","isChecked":false,"level":2,"score":"263"},{"author":"Princesspoisonivey","body":"I never got to meet Bill but I met Hillary twice. Once when I was 14 and once at 18. When I was 14 she was doing a book signing at Sam's and I gave her a bracelet. At 18 she was running for pres against Obama and she said she remembered me and still had my bracelet. Also Mike Ross was there and I didnt recognize him so I asked him his name and he looked at me like I was crazy. My mom told me later who he was","isChecked":false,"level":3,"score":"70"},{"author":"RealisticDelusions77","body":"I think it was 5 or so years ago that someone asked Hillary what Bill was doing with his free time and she said he kept rearranging his bookshelves, trying to get them organized perfectly.","isChecked":false,"level":2,"score":"57"},{"author":"blargablargh","body":"I genuinely think he's one of the best speakers of our time, regardless of how you feel about his politics or personal history. He could do a Masterclass on speech alone without ever touching on a single political topic.","isChecked":false,"level":2,"score":"55"},{"author":"Flahdagal","body":"On brand -- he read all the time and absorbed what he read.  Regardless of your politics or his philandering, man was smart as a whip.","isChecked":false,"level":2,"score":"38"},{"author":"Kickenkitchenkitten","body":"Yup. The man is a Rhodes Scholar. They just don't hand those things out. *Places face in hand, sobs uncontrollably*","isChecked":false,"level":2,"score":"38"},{"author":"DavesLastThrowaway","body":"I met Jeremy Clarkson literally just walking down the street in London. I told him I was a huge fan and asked if I could please take my picture with him. He just said \"actually I've got to go catch a cab\" and walked away.\n\nSo naturally here's my picture of Jeremy Clarkson walking away from me: [https://imgur.com/S6301tx](https://imgur.com/S6301tx)","isChecked":false,"level":1,"score":"178"},{"author":"Here_2_Comment","body":"At least there actually was a cab there","isChecked":false,"level":2,"score":"74"},{"author":"mooghead","body":"I was staying at the Grand Wailea in Maui when the movie \\`Just Go For It' was being filmed there.  Adam Sandler was playing basketball and allowed us to play some pickup games with us.  He was a really nice guy and I think he appreciated we didn't go all fan boi on him.  Nicole Kidman was really nice to everyone.  We could watch as they filmed the wedding reception scene with the volcano and fire dancers and in between takes she would \\`make the rounds' and say hi to everyone and make small talk.  She was as elegant and nice as you would imagine.  Unfortunately, Jennifer Anniston would walk through the hotel with security surrounding her, slapping cameras out of peoples hands and would not acknowledge anyone.  Between takes when filming she would go in the privacy area and not come out until it was time to shoot.  When we clapped after takes everyone but Jennifer would wave back and smile.","isChecked":false,"level":1,"score":"87"},{"author":"Swimming_Pool","body":"Met Steve O in NY. Really funny and polite dude. Let just lets anyone run up and take a photo with him.","isChecked":false,"level":1,"score":"84"},{"author":"ea_walking","body":"Met Neil DeGrasse Tyson at an astronomy lecture at the natural history museum. There was a guest lecturer and he introduced the lecturer and then stayed after to answer questions. It was a small group of about 5 people and me and he stayed as long as we had questions. He was also very willing to pose with me for a selfie and did his signature pose with me. Very nice man, but I know other people have had bad encounters with him.","isChecked":false,"level":1,"score":"87"},{"author":"nokarma4ulolz","body":"Samuel L. Jackson at the Calgary stampede in Canada. He was super nice. My family went up for it because my uncle is part of the committee that organizes the stampede every year and he got us VIP seating. I was a kid at the time and I was like does your wallet really say OBAMF? He laughed and said he left that one at home. Of course when I told the story at school I told everyone his wallet did in fact say that.","isChecked":true,"level":1,"score":"87"},{"author":"Surrealism94","body":"I met Jimmy Carter. He was great. He was giving out autographs/photos. His security told us we couldn't get an autograph unless we had one of his books, he told them to back off and let us in anyway.","isChecked":false,"level":1,"score":"237"},{"author":"cynner69","body":"Jimmy Carter is a national treasure","isChecked":false,"level":2,"score":"80"},{"author":"DeadSheepLane","body":"John Prine was the same man you saw on stage. Caring funny. Deep. I was fortunate to have a job where I met him during a tour eons ago. Same with Neil Young who’s a great man to talk ideas with. Philosophy. Super decent. \n\nMadonna was awful.","isChecked":false,"level":1,"score":"84"},{"author":"TyFighter559","body":"Ran into Steve Carell in an Orange County bathroom a couple years ago. I made a bad Office joke. He laughed. Nice guy.","isChecked":true,"level":1,"score":"82"},{"author":"lalaisacupcake","body":"Jeffree Star. Accidentally walk too close to him/his bag at a concert & he nearly broke his neck to say “watch where you’re fucking going bitch”.","isChecked":false,"level":1,"score":"83"},{"author":"hanginonwith2fingers","body":"Wife met Brandon Routh and Kal Penn when they were still filming Superman Returns. \n\nRouth was a dick and used \"don't you know who I am?\" Kal Penn was cool.\n\nI met Tom Morello once. My friends were in awe of him but I had a \"no big deal\" attitude(i was a college dumbass punk). He was nice to all of us including me. He won't remember me but I still wish I wasn't a prick.","isChecked":false,"level":1,"score":"155"},{"author":"striped_frog","body":"That's ironic because I do not, in fact, know who Brandon Routh is.","isChecked":false,"level":2,"score":"127"},{"author":"hanginonwith2fingers","body":"No one did. He was important for a few months when Superman Returns came out. It got bad reviews and he did another failed movie and didn't get much after. A few years back he landed be a role on Legends of Tomorrow since CW likes to recycle people who have been in DC parts.","isChecked":false,"level":3,"score":"36"},{"author":"QuackedUp99","body":"Met Superman, Christopher Reeve, (before his accident) at a small town charity function. No entourage, no fancy demands, just a genuine nice guy being the auctioneer at a tiny event In Texas. A swell fellow.","isChecked":false,"level":1,"score":"155"},{"author":"Baritonal","body":"I met SZA a little bit before she really blew up and got really famous. \n\nShe was performing at Bumbershoot in Seattle and came down after her set to say hi to people.  I thought her sweater was cool and asked her where she got it and she told me she didn't know.. she was very nice and held my phone for our selfie cause my hand was kinda shaky!","isChecked":false,"level":1,"score":"76"},{"author":"ReliableYams","body":"My mom sold furniture to Frankie Muniz and his wife a few times. She restores furniture, makes paintings, makes jewlery, and all that jazz. He was a cool dude. Let me get a photo with him. I even helped him load the furniture into his uhaul. He didn't speak much. But his wife and my mom get along really well. But I believe him and his wife were got divorced a few years later.","isChecked":false,"level":1,"score":"77"},{"author":"122922","body":"Wife and I met Penn and Teller after one of their shows. Teller was really nice and took my phone and took a selfie of the three of us. Penn was grumpy and seemed very annoyed he had to deal with these people.","isChecked":false,"level":1,"score":"77"},{"author":"Ethandrul","body":"Kevin Eastman creater of the ninja turtles. Super nice guy.\n\nKieth Geffin creator of Rocket Raccoon and Lobo....dickhead.","isChecked":false,"level":1,"score":"278"},{"author":"MagnummShlong","body":">Rocket Raccoon and Lobo\n\nExplains a lot.","isChecked":false,"level":2,"score":"122"},{"author":"throwedondabeat","body":"Met Selena Gomez at target here in grand prairie texas (i believe parents or grandparents live in texas) in 2010 when i was a cashier and didn't realize it until my coworkers said \"you know that was Selena Gomez you just checked out\" ..she was very nice \n\nAlso met Dez Bryant (former Dallas Cowboys receiver) at a music studio (music friend was a good friend of his) nice and humble guy..even bought a 70in tv and Xbox one for the studio","isChecked":false,"level":1,"score":"216"},{"author":"mychoicesgopoorly","body":"I met Buzz Aldrin when I was working on the line service crew at a little regional airport and he was the guest of honor for our Memorial Day airshow. The manager assigned me to drive him around in a golf cart and take care of anything he needed throughout the day because I was the only veteran on the staff. He was really nice. He would stay and chat with anyone who wanted to talk to him for as long as he could.\n\nI also got to meet Tony Bennett working the same job. He flew in to attend the opening of a performing arts center he donated a bunch of money to. He was genuinely surprised that I knew who he was. He was super cool and gave us the catering from his plane (a platter of the best pastrami sandwiches I've ever had and a platter of fruit). His assistant was lecturing him about having called the caterer behind her back and adding 3 dozen wings to the order and then eating all of said wings and nothing else on the flight.","isChecked":false,"level":1,"score":"142"},{"author":"Greenfairy79","body":"I met Beyoncé when she was in Australia a few years ago. She comes across as this super sweet person who loves her fans. She’s not.","isChecked":false,"level":1,"score":"75"},{"author":"chaoticmessiah","body":"Yeah, the music insiders leak stuff about what an abolute cunt both Beyonce and Jay-Z are, though it's mostly her.","isChecked":false,"level":2,"score":"37"},{"author":"Kyle102997","body":"I don't have any experience myself but the fact that most of these are positive makes me happy","isChecked":false,"level":1,"score":"130"},{"author":"joey22anne","body":"Nice - Vince Vaughn on a plane, he was super nice. Also very doting you his wife and kids. Super tall.\n\nRude - Kevin James, he was so condescending and rude to his assistant. Didn’t even acknowledge the fans that wanted to meet him.","isChecked":false,"level":1,"score":"68"},{"author":"millionhari","body":"Ran into Gordon Ramsay with his daughter at the Tom's Coffee on Abbot Kinney in Venice Beach (yes, Tom's the shoe brand has a dope coffee shop). Didn't want to interrupt his day out with his daughter by asking him for a photo, so I just gave him a \"hey, chef\" to which he responded, \"hey how you going?\". Super nice dude when he's not expected to cuss people out and call them idiot sandwiches on tv!","isChecked":false,"level":1,"score":"69"},{"author":"Whatsuplionlilly","body":"I love how OP asked for celebrities who are either assholes or nice... and most stories are about awesome celebs. \n\nI’m genuinely surprised.","isChecked":false,"level":1,"score":"132"},{"author":"tazconcarne","body":"I used to work the front desk at a luxury hotel in NYC. Met a bunch of celebs but the most memorable encounter I had was with Ben Schwartz who played Jean-Ralphio on Parks & Rec. I love that show, and his character, so much that when I adopted my first dog I named him Jean-Ralphio (we just called him Ralph). Anyway, Ben wasn’t staying at the hotel. He came to the front desk and asked very politely “hey sorry to bug you, but would you mind letting me up to room such-and-such?” I looked up, saw that it was one of my favorite tv characters in the flesh, and began to internally freak out. I said “absolutely, just allow me to confirm with the guest” (he was asking to go up to Don Cheadle’s room, they were working on House of Lies at the time). Don Cheadle answers and tells me to let him up. This is a swanky 5 star hotel and we’re not “allowed” to engage with celebs. As I walked him to the elevator, I said screw it because I wouldn’t get this chance again. “Mr. Schwartz, before you head up, I just need to let you know that I’m a big fan and I actually named my dog Jean-Ralphio.” His face lit up and he said “NO FUCKING WAY” with the biggest smile. He stepped out of the elevator and asked to see a picture of Ralph. We talked about my dog and Parks & Rec for a bit. Before he went up he said “I can’t wait to rub this in Cheadle’s face!” Great guy, incredibly down to earth, and nothing at all like his tv persona.  \n\nMost celebrities are friendly, polite, and down to earth. Some standouts: \n\n1) Dr. Dre - This was around the time Straight Outta Compton came out. I bumped into him in our gym. I’m a big fan so this was the only other time I broke protocol and engaged with a high profile guest. I said “I’m sorry to bother you sir, but I’m a huge fan and I just watched SOC, and wanted to let you know how great it was.” I felt so stupid because why the hell would Dre care about  what I thought? But he shook my hand and seemed genuinely grateful to receive the compliment. He asked me what kind of music I was into. Told him I grew up listening to artists he brought up like Eminem and 50 Cent and we ended up chatting about hip hop for a few minutes. \n\n2) Kim Kardashian - Yeah, I’m surprised by this too, but she was a sweetheart to me. Always smiled, waved, and said he whenever she’d walk by the front desk and just seemed incredibly polite\n\n3) Audrina Patridge - yup, that girl from The Hills. Without question, the sweetest guest I have ever interacted with. There was some sort of screw-up with her reservation and it wasn’t paid for in advance so she had to put down her card. Models, influencers, and other folks who generally have their rooms paid for often throw a fit when their reservation hasn’t been paid for, but she was so damn cool about it. She came off as if she didn’t have a single entitled bone in her body. Ended up chatting about my life, her life, NYC, etc. before she went on her way. \n\n4) Chris Parnell - Just as friendly and down to earth as you’d imagine him to be. \n\n5) Randall Park - see above\n\n6) Brian Cranston - pretty reserved but whenever he came to the front desk for something, he couldn’t have been nicer. He always thought he was being a nuisance when he asked for something to be brought to the room lol sweet guy \n\n7) Ken Jeong - strange twitchy little fella, but very friendly and polite. He threw a fit one time when his dry cleaning was late but I just chalked it up to him having a bad day. He came down later and apologized for yelling at me over the phone haha\n\nThe Not-So-Nice Ones\n\n1) Sofia Vergara and Joe Manganiello - they’re both pretty stuck-up and you get the sense that they look down on most folks\n\n2) Kevin Hart - this was heartbreaking because I genuinely liked the dude. Was never a big fan of his stand up but I enjoy seeing him in films. He’s one of those guests who thinks that a hotel will shut itself down for him and his friends. He’d come to the front desk every now and then and demand a discounted suite for some random people he just met at the bar. This happened multiple times. The first time I just thought he was drunk and he went away after I told him we were sold out for the night, but he asked a few more times during the course of his stay, and became increasingly hostile and condescending with each ask. Haven’t been able to enjoy any of his work since.\n\n4) Demi Lovato - probably the least pleasant of the celebs I’ve met. I know she has personal issues but she’s a still an asshole. Rude, condescending, you name it. \n\n5) Chris Cornell’s second wife Vicky - easily the worst person I’ve ever met. Chris was incredibly quiet and would almost never leave his room, but Vicky was a monster. I worked at that hotel for 3 years and she (and Chris by association) were the only guests to be banned from staying at the hotel. \n\n6) Priyanka Chopra. I think she may just be more aloof than rude, but man, what an entitled and careless human being. She had a little Yorkie that would run around in our lounge and leave surprises for our public area attendants to clean up. One time she was sitting in one of the small lounges directly across from the front desk with a group of her friends when her dog shat on one of the white fabric sofas. She and her friends were laughing hysterically and didn’t care about the poor Indonesian guy who had to pick up HER dog’s turd","isChecked":false,"level":1,"score":"181"},{"author":"olivia_finn","body":"Only people who watch RuPaul's Drag Race will understand this but whatever. Acid Betty is a bit of a bitch on the show, we all know it. I met her at the Dragcon and she was 100% the nicest queen. \n\nHer booth was not just for her merch and cosmetics but she also shared it with disability advocates in the drag community. I ended up being really close with a few people that work that her station since I am chronically ill and was in a wheelchair at the time. It was also one of the only booths that were wheelchair accessible. \n\nOnce I actually saw her we had a 45-minute conversation about disability advocacy, my condition, and how she could try to make dragcon more accessible for us. She was seriously one of the nicest queens there. She actually took the time to talk to me and cared. Unlike most of the queens, she didn't just say hi, take a pic and say next. She also didn't belittle me because I'm a young (14 at the time), female drag queen. She was super supportive and amazing.","isChecked":false,"level":1,"score":"794"},{"author":"screamofwheat","body":"When Cynthia Lee Fontaine was diagnosed with cancer, Acid Betty cleared her schedule and went to take care of her.","isChecked":false,"level":2,"score":"154"},{"author":"olivia_finn","body":"i completely forgot about that. It really speaks volumes about how caring she really is, despite what the show may portray.","isChecked":false,"level":3,"score":"32"},{"author":"iamthetrophy","body":"It’s funny, she may have not come across in the best light on the show (honestly I think she just looked worse because S8 didn’t really have anyone to fill the ‘villain’ role) but every story I’ve heard of her off the show indicates she’s genuinely one of the nicest queens to meet. Goes to show you can’t judge someone just off what you see on tv.","isChecked":false,"level":2,"score":"189"},{"author":"Letsnotdocorn101","body":"Andy Dick sexually assaulted a male friend in Vegas when they were both drunk.","isChecked":false,"level":1,"score":"276"},{"author":"SkinnyElbow_Fuckface","body":"Is there anyone Andy Dick hasn't sexually harrassed?","isChecked":false,"level":2,"score":"227"},{"author":"willis1988","body":"Dick by name...","isChecked":false,"level":2,"score":"47"},{"author":"PM_ME_KITTEN_TOESIES","body":"Andy Dick threw a tamale in the face of a friend of a friend the first time they met. Fuck that guy.","isChecked":false,"level":2,"score":"46"},{"author":"LargeTuna123","body":"Once met Colin Hanks at SXSW! My wife noticed him first, but didn’t think it was actually him. We were arguing about it and he came over.  He was super nice, even suggested a band that we should go see. Saw him at said show and he waved at us.","isChecked":false,"level":1,"score":"60"},{"author":"RutCry","body":"Story time.  Staying at a large, mall attached hotel in Birmingham, Alabama in 1996, I was awakened around 3:00am by a drunk, long haired, tattooed guy banging on the door across the hall from me.  Cops showed up and everything, but I stayed out of it.  \n\nThe next day, a see the same guy in the breezeway headed into the mall. I harshly confronted him, and asked him to please make sure he had his room key when he left that night.  He had no idea what I was talking about, and remembered none of it, including the cops showing up.  He was laughing and extremely apologetic. We shook hands and I went back to my seat at the connected hotel bar thinking that was the end of it.  \n\nA few minutes later he came to my table still laughing with another long haired guy, sat down and said, “this is [guy’s name].  He’s the lead guitar player for Bad Company. Tell him that story you told me about last night.”\n\nThere’s a lot more to the story, but turns out the guy across the hall was Leon Wilkeson, bass player for Lynyrd Skynyrd, and they were in town for a show with Bad Co opening for them. They closed the bar for what turned into a private party and Leon and I hung out all night drinking and shooting the shit. The guy had some awesome stories to tell about surviving the crash, and back story stuff about the band and a lot of the songs.  \n\nA guy named Floyd Cramer, and some of the Swampers showed up, and Floyd played the grand piano in the bar while we stood around it singing songs.  You probably know a bajillion monster hits from both bands, but all the songs we sang that night were Gospel songs. \n\nThe next morning I was pretty bleary-eyed and in rough shape for the company meeting I was in town for, and of course no one believed my story from the night before. \n\nLate that afternoon I was sitting in the same bar with my boss talking business when Leon walked in, sat down and said, “Hey, r/RutCry !  That was a lot of fun last night!”  And the party picked right back up where it had left off the night before. Introducing Leon to my previously skeptical boss was a very satisfying moment.  \n\nHere’s the part of the story I am embarrassed to tell:  After awhile, word was passed that it was time to get on the bus for the show. Leon turned to me and said, “Hey, man, come on and go with us!  It will be a lot of fun!”  The thing was, though, that I had a new born baby at home and I was eager to get home to my wife and baby girl.  I pulled her pic out of my wallet and said I couldn’t go, while these freaking rock stars passed my baby’s picture around. \n\nI know I did the right thing, but not getting on that bus is one of my biggest regrets in life. \n\nRIP Leon.  You were a fun guy to hang with for a couple of nights.","isChecked":false,"level":1,"score":"65"},{"author":"brunettevibe","body":"Worked at a Barnes & Noble where Ann Coulter was doing a book signing. She was awful to the entire staff, ordering us around, getting her coffee, etc. During the signing she starts forcefully throwing pens everywhere and yelling \"THESE PENS DON'T WORK\". She hit a few staff members with them. She then left her own signing 2 hours early and we had to explain to fans that she had already gone. Regardless of your politics, don't be a cunt.","isChecked":false,"level":1,"score":"748"},{"author":"RayAnselmo","body":"This is probably the least surprising post in this thread.","isChecked":false,"level":2,"score":"391"},{"author":"PM_ME_KITTEN_TOESIES","body":"As if I needed another reason to hate Ann Coulter.","isChecked":false,"level":2,"score":"351"},{"author":"Neilimereyob","body":"When I was 5 years old I was running down a hotel lobby in Miami until I crashed into JayZ’s legs.\n\nFrom my fathers perspective he said JayZ laughed it off and continued his walk down the lobby.","isChecked":false,"level":1,"score":"121"},{"author":"confusedvegetarian","body":"I made out with coolio and he was really cool","isChecked":false,"level":1,"score":"304"},{"author":"willis1988","body":"Phew! He can keep his name then.","isChecked":false,"level":2,"score":"140"},{"author":"CheriB59","body":"I was in line for Big Thunder Mountain at Disneyland and Jay Hayden from Station 19 was in line in front of me with his wife and kids. He was super nice and took a picture with us. Made my day:-).\nMy daughter saw Brent Spiner at Comic-Con in San Diego and when his assistant said that there was a woman who would like to get a picture with him he said “Why would I want to do that?”  She’s super shy and it took everything she had to ask. His response crushed her. He’s an ass.","isChecked":false,"level":1,"score":"56"},{"author":"a_vdy","body":"Not my story, but my mom worked in Gucci in a LV casino. Said she met Jennifer Lopez about 5 years ago and she was the most entitled and stuck up celebrity that she's ever met.","isChecked":false,"level":1,"score":"59"},{"author":"Hardcore_EHS","body":"Best:\n\n- Vinnie Paul, drummer for Pantera\n\n- Michael Starr, singer for Steel Panther\n\n- Sean McNabb, actor on Sons of Anarchy and bassist for Dokken\n\nWorst:\n\n- Sebastian Bach, singer for Skid Row who pops up on every rock-based TV show ever for some goddamn reason\n\n- Bret Michaels, singer for Poison and also seems to show up on TV a lot\n\n- George Lynch, guitarist for Dokken","isChecked":true,"level":1,"score":"62"},{"author":"nayhem_jr","body":"My only experience with Guy Fieri thus far was cordial. Did a guest presentation for us and took plenty of photos.\n\nBut every time there's a wildfire or other depressing thing going on around here, he has his \"second responder\" crew ready to feed and care for all the first responders.","isChecked":false,"level":1,"score":"58"},{"author":"ballsackyjo","body":"Zach Efron is the nicest guy in the world! I met him at a New Years house party in LA. I asked him about his workout regime for \"neighbors\" and he. was so happy to talk to me. I honestly felt so comfortable talking to him i could have asked him to get me a drink at the bar and I think he would have done it. In the end i told him he was the nicest celebrity i have ever met. He looked at me and said \"hey man, real recognizes real\".","isChecked":false,"level":1,"score":"56"},{"author":"ac1dre1gn77","body":"I used to work at a hotel in Louisville before the virus struck. We would get a lot of celebrities as they travelled. When American Idol was in town filming we had the luxury of having the hosts of the show staying there. Katy Perry was great. Always smiling and just all around great. I never interacted with the other two. \n\nMy favorite is hard to decide who is at the top of the list. Its a tie between Cindi Lauper and Alice Cooper. Both memorable in my book. I had a crush on Cindi since I was a kid. I was lucky enough to take care of her needs, which was hardly anything. Before she left she wanted me to take her around and show her the art galleries. Even though she is an old lady now, it was cool having her arm in mine as i walked with her. With Alice Cooper I kinda ran into him by mistake. I didnt know he was staying there. I noticed him ordering food at the restaurant and as I passed by I said he looked a lot like Alice Cooper. He smiled big and said he was then asked for me to please sit with him for breakfast. It was an awesome conversation. Such a terrific down to earth dude. \n\nI also had a short conversation with this really cool woman in the hallway and down the elevator. Not much more than small talk. When the elevator got to the lobby floor the doors opened and this huge crew of people were waiting on this woman, who was Lady Gaga.\n\nSnoop Dog was kind of a dick\n\nPink had more demands than any celebrity combined. Let her kid run wild in the restaurant. \n\nNicolas Cage....one of the worst. He had to have a different room every other day. Not so bad but he had his personal gym with him so moving that shit was a huge pain in the ass.\n\nEdit: reading comments and I cant believe I didnt mention my cruise. A couple years ago there was a 90s Ship hop cruise. Vanilla Ice, Salt N Pepa, Naughty By Nature, Blackstreet, Rob Base, Coolio, Kid N` Play, All 4 One, Biz Markie, SISQÓ, Color Me Badd, Tone Loc, Young MC, DJ Kool and C+C Music Factory feat. Freedom Williams all performed. It was a wild non stop party from Miami to Key West to Cozumel. When they werent performing, they were hanging with us on the ship. Not one of them had a shitty attitude. Got to smoke a blunt with Coolio and Treach out on the deck and hang with Vanilla Ice and his crew in our room. We ended up meeting a couple that knew him very well. One of the most awesome experiences of a lifetime. The ship smelled like weed and alcohol, non stop concerts, shows like cooking with coolio, win a date with Pep, Kid n Play did stand up. Everyone on the ship had a great time with the artists and each other. \n\nBefore i was a teenager I lived in an apartment complex with a WWF wrestler. I cant for the life of me remember his name. Bret Hart or Bret Sawyer...something along those lines. Anyway he had a son that was a punk. We got into fights all the time and he would lose. Still ran his mouth. Our busses ran around the same time so fights usually happened at the bus stop. Only thing is we didnt really know who his father was. We learned soon enough. One day we get off the bus and this kid has an army of huge men with him. I wasnt into wrestling but I knew from TV who was standing with him. Hulk Hogan, Andre the Giant, Jake the Snake, the dude with the parrot, and I think Sting was with him as well as his dad. It seems the kid told his dad that he was bullied by us. That wasnt the case at all. Other kids called him out in our defense. We ended up going to his place to talk. These apartments werent that big. Just imagine all these huge guys in one little apartment with a bunch of kids. We ended up squashing our problems and became friends. Every now and then there would be a famous wrestler over but not like it was that day. Even though I thought i might die that afternoon, it turned out that i met some really badass dudes. I forgot all about this time in my life until i read other comments about wrestling.","isChecked":false,"level":1,"score":"206"},{"author":"AnonymousAstro","body":"My wife and I spotted a petite girl with a long ponytail at a steakhouse in Bev. Hills early in 2019. She was with a large group of maybe 10 and 1 bigger guy who (maybe) was security. After ten min of debating with my wife on whether it was Ariana Grande or not, our waiter confirmed it was. She was a regular there and the staff intentionally seats her facing towards a wall. I walked up to her alone, nervous and said \"Excuse me, don't mean to interrupt but my daughter is a huge fan, could I get a picture?\" She had a bite of food in her mouth but was super excited, nice and took my phone to take a few selfies with me. For being one of the most popular people on Earth, she was supremely nice.\n\nI don't have any kids.","isChecked":false,"level":1,"score":"102"},{"author":"CalifaDaze","body":"Everyone says she's a stuck up bitch so I'm glad you met her on a good day","isChecked":false,"level":2,"score":"50"},{"author":"BeautifulRelief","body":"I don’t know if you can count it but Danica Patrick. She was in a race my team was also in. She is the biggest stuck up bitch I have ever met in my entire life.","isChecked":false,"level":1,"score":"303"},{"author":"ashcymru84","body":"Keira Knightly, although a brief meeting seemed a pleasant person. \n\n\nJim Davidson was a complete dickhead. Acting like an A-Lister when he’s essentially a drunk racist man that just makes “jokes”","isChecked":false,"level":1,"score":"267"},{"author":"SexBadgersaurus","body":"I ran into Marc Evan Jackson (Kevin from Brooklyn 99, Shawn from The Good Place) at the Vancouver airport. He was standing there trying to figure out his flight probably and I felt compelled to approach him. \n\nSo I walked up to him slowly and asked, \"Excuse me, hi I'm sorry, are you Marc Evan Jackson?\" \nHe had a knowing look in his eyes before I even began speaking, he knew where this was going. \"Yes I am,\" he said.\nSo I was like, \"Man, you're awesome. I just wanted to say that I'm a big fan and you are the most entertaining character in The Good Place.\"\nI'll never forget his very in-character response, \"That is quite far from the truth but thank you,\" he said smiling. \n\nI asked him if I could take a selfie with him which he obliged and I even posted the selfie to reddit. I thanked him and we went our separate ways. Very kind gentlemen.","isChecked":false,"level":1,"score":"53"},{"author":"1AntleOzzman1","body":"James Corden. I was a porter at a hotel a very long time ago, he'd had a couple of very minor TV roles. I had no idea who he was but others did. He came down in the morning yelling at the receptionist that someone had taken vhs tapes from his room. He demanded to know who had access to his room, me being the only person on duty that night with a master key was pointed out and he proceeded to accuse me of sneaking into his room while he slept and stealing tapes. After ten minutes of verbal abuse and threats one of his \"people\" came in and told him they found his tapes in the car and he stormed out with so much as a goodbye. Throughly horrible human being.","isChecked":false,"level":1,"score":"54"},{"author":"gaypurple","body":"Danny Devito came to Asbury Park in NJ about 2 years ago to do a Q&A and live interview, and he is such a kind guy. he’s hilarious, as expected! he answered a bunch of questions from the audience (i was lucky enough to get in the line early and ask him a question!) and was overall a genuine guy. When it was over, he stayed on stage for a bit and everyone went up to get autographs and pictures. he kept going even after the crew was telling people that the event is over and to exit the auditorium. he seemed truly happy to be there and was happy to keep getting pictures and giving autographs. he’s genuinely a great man with an awesome sense of humor and i hope i can meet him again one day!","isChecked":true,"level":1,"score":"140"},{"author":"phasers_to_stun","body":"Briefly met Bill Pullman in passing in 2008 and he was very nice.","isChecked":false,"level":1,"score":"97"},{"author":"journy1","body":"Ran into Clint Eastwood at his bar in Carmel, the Hogs Breath Inn.  He is as cool and as friendly as you would expect.","isChecked":false,"level":1,"score":"96"},{"author":"omiaguirre","body":"When I moved to New York 10 years ago we went to a bar in the east village and after a couple drinks I went outside to have a smoke with a friend .  We didn’t bring the lighter and I saw two people smoking so I approached them and when I said “ excuse me “ to ask for a lighter , the girl turns around and didn’t even let me finish and said “ no please go away “ .\n\nIt was Scarlett Johansson , the other person was Macaulay Culkin . I didn’t say anything but I was like “ rude “ . I’m sure she though I was gonna ask for a picture . But still rude .","isChecked":false,"level":1,"score":"96"},{"author":"Jake-giaco","body":"My cousins Robbie from the victorious aka Matt Bennett (my names Jake Giacopelli for all you fact checkers) The actor that plays Jade Elizabeth Gillies is one of the nicest people I’ve ever hung out with. The whole cast is amazing but I loved her.","isChecked":false,"level":1,"score":"173"},{"author":"Cool_Or_Not-Cool","body":"Have you also met Ariana Grande? I heard they are great friends","isChecked":false,"level":2,"score":"31"},{"author":"nessac93","body":"Not sure if some of this counts hey ho\n\nSo I’ve done the WWE VIP in London\n\nCurtis Axel - really nice guy. Underrated imo\n\nCharlotte Flair - so kind and smiley. Can’t fault her\n\nSeth Rollins - was a bit disappointed as I felt like he didn’t really want to be there. Curtis and Charlotte put their arms around us and Seth was like he didn’t want to be touched\n\nAlso after his match Roman Reigns went round to everyone who was right by the barrier and hi 5/shook hands/selfie with them to the point his music had to be played over again because he took his time. Man respects his audience massively\n\nAlso I’ve met Chloe Madeley and Vicky Pattison while filming for a show. Both are really lovely women. Vicky does like to have a laugh and Chloe loved to chat and was so supportive. Even gave me her number and we got to chat for a bit and gave me some real good advice.\n\nComic Cons in London\n\nMisha Collins - was a bit disappointed as he didn’t really speak and felt like I was on a bit of a conveyor belt of autographs\n\nMatthew Lillard - he’s sweet. He thought my name was a song and tried to sing a song about me haha\n\nWWE Victoria - oh so so lovely. Happy to chat to fans and gave some great advice. Treated you as equal\n\nWWE Gail Kim - she’s lovely too. Told me she liked my dress. Happy to talk and answer questions\n\nWWE Christian - cool dude. Happy to chat too\n\nGina Torres - fabulous woman, so kind\n\nWWE Vickie Guerrero - fantastic woman. So lovely. \n\nMark Sheppard - said hello was happy to sign autograph. Kinda got all nervous meeting him as I love supernatural \n\n\nSo yeah that’s mine.","isChecked":false,"level":1,"score":"48"},{"author":"spanishginquisition","body":"I'm a freelance writer and a few years back, Neil Gaiman was doing an event in my city. I pitched a story about it to a local publication and they said they were only interested if I could get an interview with him. I figured it was a long shot, but knowing that he often replies to messages on his Tumblr, I sent him a query--and lo and behold, he agreed to a brief phone interview. I was stunned. Unfortunately, he was so swamped with writing deadlines that he ended up having to cancel, but he very kindly arranged for me to get tickets to the event that included a meet and greet dinner beforehand. He was very reserved, but so friendly and kind. I'm almost glad that I didn't get to do the story.","isChecked":false,"level":1,"score":"50"},{"author":"ashessnow","body":"Ben Stiller.\n\nFuck that guy.\n\nIf you work in the industry, you likely have a story about him.\n\nEdit:\n\nSo I posted this story before but I can't find it so I'll just abbreviate it here.\n\nBasically I used to work in research doing movie screenings. We were testing one of his movies in front of an audience. My job is to watch the movie and make some notes. In the theater the last 3 rows of chairs are roped off for the screening staff and friends/family of the crew of the movie to sit. So that's where I go. Halfway through the movie (keep in mind its dark) a short grey-haired man comes up to me and demands to know what I am doing back here. I'm dressed professionally so I just say, I'm supposed to be here. He says no your not, you need to leave.\n\nNow, the theater is like quiet and this dude is whisper yelling at me. But my job is literally to watch the movie so I tell him my name, that - I'm with the screening staff, I'm not an audience member, my job is to sit here and watch the movie so that's what I am going to do.\n\nHe leaves.\n\nNow, as far as I know, that's the end. The movie continues and eventually ends, the screening staff leave and I go home.\n\nThe next day I go to work and immediately everyone is asking me what happened, if I'm okay, and if I know what is going to happen. I'm confused. I have no idea what they are talking about. Eventually I figure it out:\n\nThe short grey-haired dude that yelled at me was Ben Stiller, the director of the movie.\n\nBen saw that I (a young black guy) was sitting in the staff section and assumed I wasn't supposed to be there. When I told him my name, he went to the screening staff and started yelling at them about me and if I am who I say I am and all this other stuff.\n\nI'll just say that I did that job for like 5 years and no one ever questioned me like that.\n\nAlso, after clearing it up with other screening staff people, they told me that they ALL had had bad experiences with him. They all had a story.","isChecked":true,"level":1,"score":"47"},{"author":"anchorsteamer","body":"Conan is one of the nicest, most genuine people of all time.","isChecked":true,"level":1,"score":"45"},{"author":"shealewis1100","body":"Jeff Goldblum is one of the nicest men in the world and was my best friend for 20 minutes.\n\nWhen I was 14, I was in the children's chorus of a professional opera company and his at the time gf (now wife!) was in a production as a featured Cirque du Soleil acrobat. He was backstage before one of the shows, but no one was approaching him (idk if they were shy or just trying see seem cool and chill while a celebrity was around). Awkward ass 14 year old me finally gathers up some courage and goes up to him and says \"Excuse me, Mr. Goldblum? I just really wanted to say I loved you in The Big Chill\" (which I'm sure is not the film he expected to come out of a 14 y/o's mouth). He took a picture with me and then we just talked for a solid 20 minutes. He asked me all about being a kid working at an opera theater and what I wanted to do when I grew up. And he was so engaged and you could tell genuinely cared and was interested in what this awkward looking little 14 y/o has to say. So that's the story of when I hung out with my 20-minute bff Jeff Goldblum backstage.","isChecked":true,"level":1,"score":"86"},{"author":"JimLaheysGhost","body":"Bill Russell and his wife are two of the kindest people I’ve had the pleasure of knowing.","isChecked":false,"level":1,"score":"41"},{"author":"IsNotBrian","body":"I met Ted William's (the homeless man with the golden voice from that one viral video) at a home depot years ago. He was very outgoing and optimistic about life. It made me feel good about life.","isChecked":false,"level":1,"score":"44"},{"author":"MudKraft","body":"Santana and Dylan, two of my favorite musicians and at the opposite ends of the spectrum. I was around both of them in the same context but with entirely different attitudes. I worked at the old Paramount Theater in my local city in the early 90's, just a part time thing here and there but the awesome part was that I got backstage passes as part of the \"local crew\", something like a roadie but only working at one venue.\n\nAnyway let me start with Santana, he was awesome, his band was awesome, amazing show and incredible entertainer, first rate all the way, true professional, overall great experience. His band encouraged us to check out their instruments and even try them, they had like a dozen percussionists and some really wild instruments. After the show Santana shook all our hands and asked us how we liked the show and later sent over a pizza and a case of beer for the crew, awesome guy!\n\nDylan on the other hand... what a douche! I say that with a heavy heart as I did and still do love his writing, the man is truly a genius but I digress. Anyway, I pick up a show to work but because this is a second job for me I have to arrive late after finishing my main job. As a result I missed the briefing before the show. The show itself was pretty terrible, he was slurring to the point of being undecipherable, yes worse then his \"normal\" singing voice. His skin was white and waxy and he could barely stand on stage, almost falling over at several points, but that wasn't the bad part. So, I mentioned I missed the briefing. Well apparently the instructions included a rule Dylan had that no one was allowed outside the stage door he was using, he insisted on no contact at all with the local crew.  When he saw me he flipped out, turned to someone in his entourage and chewed them a new asshole in a profane rant. I couldn't even move, so embarrassed and shocked. Not a nice man... at all!\n\n&#x200B;\n\nStay Safe!","isChecked":false,"level":1,"score":"44"},{"author":"AngryZen_Ingress","body":"Back in the late 90s we went to a Fleetwood Mac show on Halloween Night. We went backstage after and as we walk into the green room this crazy blonde starts tossing plastic spiders at us.   \n\nStevie Nicks herself. She was awesome and after a few minutes talking this massive tree is a man walks in toweling off his thin grey hair. Mic Fleetwood. “I’m so sorry but I had to take a fast shower I was dripping sweat. So sorry to cut into your time.” So humble. So awesome.","isChecked":false,"level":1,"score":"43"},{"author":"BeanIsOnline","body":"I met Sebastian Stan on the streets of Paris while they were filming for the spy movie (305?). All around was super nice. He was just standing off set, and I kinda just walked up and said hi and he was super nice, and kept asking questions as to what I was doing in Paris etc and seemed genuinely involved in our conversation.","isChecked":false,"level":1,"score":"44"},{"author":"AllThingsMatt","body":"I met Lady Gaga on a street corner in lower Manhattan two years ago. I had no idea it was her so we struck up a conversation as two random strangers and she ended up having her friend take a picture of us. I only found out who she was when I was getting into my uber and her friend yelled out, \"Hey you know that was Lady Gaga right!\" She was really friendly and down to Earth","isChecked":false,"level":1,"score":"47"},{"author":"AmishTechno","body":"Bill Clinton was the friendliest guy you could comes across. Met him about 11 years ago.","isChecked":false,"level":1,"score":"79"},{"author":"McFlyJohn","body":"Not loads to pick from but:\n\nMost of the WWE guys are super nice - Kofi Kingston, Chris Jericho, Shawn Michaels, Triple H and William Regal are stand out outs\n\nSir Ian McKellen was an absolute gem (met him after a show at a theatre), lovely man.\n\nBowling For Soup are really cool, super fun guys. \n\nBoxer Joe Calzaghe is awesome and really laid back\n\nSlash called me an asshole (in a fun way) which is like a life highlight. \n\nSir Ben Kingsley is a total dickhead","isChecked":false,"level":1,"score":"82"},{"author":"throwawayact9230","body":"I hang out with Queen Elizabeth every summer for about 30 minutes. She is keen with my father as they both are into horse racing and I get to go up and sit with her for tea at the races! She is one of the nicest ladies I have ever met, picture an old grandma talking to you with a very sweet and caring voice. Also had a conversation with Rod Stewart at the races and did not even know who he was! He came up to me on a balcony and we were both looking down and some girls were pointing up (obviously looking at him) and he said, \"Wow kid all these girls must be really into you!\" I kept talking to him for about 30 mins and he ended up having to leave and my dad came up to me and was like \"Do you know who you've been talking to!\" I responded I had no idea and he was trying to explain to me but I was 13 and had no prior knowledge of rock music and now he turns out to be one of my favorite artists.","isChecked":true,"level":1,"score":"82"},{"author":"Anorexic_Fox","body":"I met both Geena Davis and Frank Langella when I was helping run a venue for a local film fest in high school. The venue was our school theater and the events were run by the students.\n\nGeena was the rudest most insufferable person I’ve ever met. Frank was an angel and took the time to greet each of us one by one after the event, thanked us all for our help, and entertained us with the Skeletor voice many times throughout the day.\n\nEdit: I also met Matthew Underwood (Logan from Zoey 101) at the peak of the show’s popularity. He spent the day with my middle school’s TV Production class teaching us about what it’s like living as a TV actor. He was an awesome guy and just felt like another kid joining us to hang out, despite being a huge star for our age group at the time.","isChecked":false,"level":1,"score":"75"},{"author":"der_held","body":"I waited on Ben or Jerry, one of the ice cream guys. It was a little south of their factories in VT. He tipped with a Ben+Jerry's Ice cream coupon. I didn't really talk to him much and didn't realize who he was until after. He wasn't rude, but tipping with a coupon isn't the classiest of acts....\n\nI also snuck backstage once at an Alkaline Trio concert and met Matt Skiba and Dan Andriano. Matt was cool and took a picture with us, Dan seemed like he wasn't in the mood","isChecked":false,"level":1,"score":"73"},{"author":"SatoshiUSA","body":"Taylor Swift. She was about 16 at the time and just started getting popular. I was at a store with my mom and in my supreme 6 year old intellect told her that she was fatter irl than on album covers. Impressively enough she explained it without missing a beat and took it like a champ. I know you're not reading this but sorry Taylor Swift.","isChecked":true,"level":1,"score":"76"},{"author":"Inomsbacon","body":"I met Chelsea Handler when I lived in telluride, and to be honest, I'm not even sure I can call it meeting her, because she was so rude about the incident. I was taking the gondola home after having a few drinks with my friends, headphones in, minding my own business. The gondola stops half way at a restaurant and she and a friend were waiting to get on. She spots me, and very loudly announces to her friend that she isn't going to ride with someone they didn't know. Her friend rolls his eyes and tells her that I probably don't care who she is and to just get on the gondola. Keep in mind, I hadn't even taken a second glance, I didn't care. She reluctantly gets on, but the entire time she kept glaring at me and huffing under her breath. She gave off huge \"I'm more important than you\" vibes.\n\nAlso while I worked up there I had to tell Coolio he couldn't smoke a joint on the porch of the place I worked at. He was cool about it.","isChecked":false,"level":1,"score":"35"},{"author":"weaselmunch","body":"A week before basic training at the Air Force Academy, my family and I were staying in Denver (so i could try and acclimate to the altitude). My Dad and I wanted to kill some time, so we went to a Main Event right by the hotel. As we were about to walk in, Don Cheadle walked out. It was a definite double take moment and my Dad laughed and asked him if he was Don Cheadle (my Dad really liked Hotel Rwanda, and of course Iron Man, so he was excited). He straight faced said \"My lawyer tells me I have to say no\", then started laughing as well. We talked for a bit and found out he was there for his kid's birthday party. Afterwards, he wished us well and went on is way. It was an awesome experience, he was super nice to stop and chat. \n\nI then proceeded to have my ass handed to me for 6 weeks, but at least I had a cool story.","isChecked":false,"level":1,"score":"34"},{"author":"raidrapt0r","body":"I used to be a professional wrestler on the independent circuit. Most of them are nice, decent people who are just there to earn a paycheck and don’t let the fame get to them, but some are really mean spirited to the underneath talent.\n\n- The Ultimate Warrior was an absolute tool. Gay slurs, shouting at other talent, and overall a complete raving lunatic.\n\n- AJ Styles is actually a very nice person. Extremely religious, but overall a treat to work with and learn from.\n\n- Daniel Bryan (or Brian Danielson as he was in the indies) is a very quiet but pleasant person who prefers to be left alone before a match, but during the prematch setup he’s usually willing to answer a few questions.\n\n- Chavo and Vicky Guerrero are great. Professional, talented as all get out, Vicky bought me bus fare.\n\n- Matt Hardy is so much fun to talk to. I met him when he was just putting the finishing touches on his ‘Broken Matt Hardy’ gimmick and the crowd went absolutely apeshit for it.\n\n- The Iron Shiek is a scream. He’s a complete nutcase, and how he acts on camera and on Twitter doesn’t do the man justice. It’s like listening to Chaucer, only with more of a focus on jabronis.\n\nAdditionally, I met Brock Lesnar in a hunting store in Saskatchewan. Very quiet, but we had a pleasant little debate about bow hunting versus rifles.","isChecked":false,"level":1,"score":"38"},{"author":"tweak0","body":"I met miss Dolly Parton when I was just a wee kid in Illinois.  I've described it as being like meeting the sun.  She was just so happy and warm and wonderful, and she was the first person I'd met in real life with a southern accent.","isChecked":false,"level":1,"score":"36"},{"author":"topoftheworldIAM","body":"I ran into Harold from Harold and Kumar on January 1st at Big5 and he bought a yoga mat and took a picture with me. Pretty cool guy.","isChecked":false,"level":1,"score":"72"},{"author":"sendgoodmemes","body":"I was at 6 flags in Orlando FL and one of the big roller coaster that is very wide, but only three rows long was shut down the majority of the day and me and my brother in law wanted to ride it so we got some drinks and waited outside the ride and apparently one of the workers opened the ride before it was ready because we ran up the lime once it opened and we’re told they shouldn’t have opened the ride yet, but if we want we can just wait so we did and when we got on people were already on it, bit odd but whatever. Well we get hooked up and start looking around and holy shit it’s T pain with an entourage and his family. That’s the story of how I rode a roller coaster with t pain.","isChecked":false,"level":1,"score":"72"},{"author":"BlackIsTheSoul","body":"Taylor Swift- total sweet heart.  Tall.  Smells amazing.  \n\n\nRyan Reynolds- Arrogant, in considerate asshole.\n\nWorked as PA for a music television station.","isChecked":false,"level":1,"score":"253"},{"author":"TheWayDenzelSaysIt","body":"I met Tom Cruise once walking down Rodeo Drive. I went up to him and shook his hand. He pulled me in close and whispered Hail Hydra in my ear.","isChecked":false,"level":1,"score":"261"},{"author":"theEyerisEmbracesYou","body":"I almost believe that","isChecked":false,"level":2,"score":"105"},{"author":"ThirdSpectator","body":"back in '94 or '95 I ran into Suge Knight and Dr. Dre in a club in Honolulu, both were stuck up but I was easily impressed and that's how I found out Suge has a tiny d\\*ck","isChecked":false,"level":1,"score":"183"},{"author":"Tokugawa","body":"That's the kind of thing you can only say about Suge when he's locked up and can't dangle you off a balcony.","isChecked":false,"level":2,"score":"136"},{"author":"secondlogin","body":"I worked for a private delivery company in Los Angeles for about two years in the early 80s. \n\nNumber one Asshole: Ron Glass. Delivered to his home, he was short tempered and acted like I was completely inconveniencing him. \n\nNumber one nicest: Gilda Radner \n\nIt was the week before Christmas and I had a stack of plane tickets that I was delivering from A travel agency. \n\nThis is in the days before cell phones. We were usually given a bunch of deliveries with addresses and the route we should take for Best efficiency. After we ran out of those, we were to call the office From the phone of the last delivery. I was delivering to Gene Wilder’s house. \n\nA lot of times when at famous person’s house you never saw them, you only dealt with staff. This time was no different. Asked to use the phone, and was directed to a study off of the kitchen. As usual I was on hold with the dispatcher while he decided where I was going next. \n\nI couldn’t see directly into the kitchen but someone was repeatedly throwing a ball and a small dog would run out and grab the ball go back in the kitchen. I could hear the person talking in the background (on the phone or something). \n\nI got my assignment; left the house, was getting my car, When the staff member Stopped me, and said “Gilda would like to wish you a Merry Christmas”\n\nShe came out and was just the absolute nicest person! Thanked me profusely for delivering the tickets that late (it was dark, I remember that). Asked if I had kids (no); Wished me a sincere very Merry Christmas and gave me a hug. She didn’t have to do any of that!\n\nIn the course of my Travels I met Rod Stewart, Lorraine Newman, (also super nice and funny). \nAnd while running around corner in a Hallway of an office building,  slammed directly into Michael Landon’s chest. I looked wide eyed and, red faced from embarrassment, held out the envelope and said “this is for you”. He laughed and had me follow him to his office and have the secretary sign for it.","isChecked":false,"level":1,"score":"35"},{"author":"awhq","body":"Willie Nelson - really nice\n\n\nKinky Friedman - nice\n\n\nAlex Harvey (wrote Delta Dawn)  - nice\n\n\nRip Torn - okay\n\n\nAlexander Godunov - very full of himself\n\n\nCindy Cashdollar - wonderful\n\n\nTownes Van Zandt - very nice, very hurt person\n\n\nJoe Ely - moderately full of himself\n\n\nNanci Griffith - not very nice\n\n\nJerry Jeff Walker - amazing\n\n\nJimmie Dale Gilmore - very, very nice","isChecked":false,"level":1,"score":"34"},{"author":"thereadingsloth","body":"When I was 11, I was visiting NYC and standing outside our hotel people-watching with my dad and aunt. We noticed a big crowd at a deli across the street and being nosy, went to see what was going on. It was Jordan Knight (NKOTB, really big at that time) and he was walking out as we made it across the street. He got in a limo and started to leave, with 11-year-old-me crying because I didn't really even get to see him. So what happens? The limo starts backing up to where I was standing, he got out to take a pic with me and give me an autograph, and got back in the limo and left. I always thought that was pretty awesome of him to do for a random kid.","isChecked":false,"level":1,"score":"31"},{"author":"DMAnonymous","body":"I worked for a post house in Burbank several years ago, and Leah Remini came in to do some voice work. She was an absolute angel! Super nice to everyone, and she even had me tweet from her phone (pretty trusting, I'll admit). Haven't met a mean celeb yet.","isChecked":false,"level":1,"score":"33"},{"author":"orquesta_javi","body":"James Hetfield\n\nI was waiting for a flight to Minneapolis for a Metallica concert when I notice him waiting to board the plane as well. As a big fan I was star struck but tried to contain myself because I didn't want to be seen as another annoying fan. My friend and I calmly walked up to him to tell him we were big fans and if we could take a selfie with him. He declined the selfie but he shook both our hands and thanked us for being fans. \n\nSeemed like a chill dude.","isChecked":false,"level":1,"score":"30"},{"author":"nai-wiley","body":"I went to my first comic con when I was about sixteen. Nichelle Nichols was a guest speaker there. I was with my friend curled up on the floor of the bathroom because my period cramps were so bad I couldn’t move. I had my face down and felt a light touch on my back and heard a woman say “are you okay? Do you need me to do anything?” I said I’d be okay, head still on the floor. And she said “okay well I’ll be right out there if you need me” and as she smiled and walked away I noticed it was her. I looked at my friend after she sashayed away and said “was that Nichelle Nichols?” And he said “that was fuckin Nichelle Nichols!”","isChecked":false,"level":1,"score":"32"},{"author":"KanseiDorifto86","body":"Is it bad that I’m looking for my least favorite celebs to be a douche?","isChecked":false,"level":1,"score":"30"},{"author":"farahad","body":"Jury duty with Dr. Phil a few years ago.  A guy was trying to defend himself against the advice of the judge, and was doing...not well in the pre-trial. The jury included a UCLA Law professor and a few other well-educated people. People the defense would *usually* vet and have removed from the jury...\n\nAnd Dr. Phil. He visibly didn’t want to be there and whenever he was asked a question by the defendant or judge, he would go on about he’d always believe what the police said, how he thought the defendant was a lying POS who’d broken the law, etc.  The kind of comments you hear that a-hole relative say they use to get out of jury duty, but never really thought they went through with it. Dr. Phil did.\n\nHe was trying to get out of jury duty and was a complete dock about it. Thankfully the judge made him show up for the first few days before letting him off.","isChecked":false,"level":1,"score":"29"},{"author":"NotRealStudios","body":"David Bowie was extremely nice - I worked on his production of Lazarus in NYC before he passed and was no older than 20 at the time - considerably younger than most on the crew. He took time out of talking to the director to turn to me and tell me that I was doing a phenomenal job on the production.\n\nMeant the world to me that he would do that for the shy, unsure 20 year old, totally made my life.","isChecked":false,"level":1,"score":"34"},{"author":"BabieBear15","body":"I met Chris Hemsworth at a convention in Australia. Our only interaction was him apologising to me for a mother’s rudeness as she shoved me out of the way because her child meeting Chris was more important","isChecked":false,"level":1,"score":"28"},{"author":"MarcusChapmanHere","body":"Jamie Lee Curtis \n\nI worked with special needs young adults and was with a client at Gamestop. A woman walked in with a teenager and they were shopping around. We were the only customers there and when she asked for help from an associate I loved the way she spoke. \n\nI went to ask her where she was from and stopped before blurting out \"Wow. Has anyone told you that you look exactly like Jamie Lee Curtis?\" to which she smiled and replied \"That's because I am her.\" \n\nI apologized and let her get back to her shopping. Afterward as she was about to leave I asked her if it would be alright if I called my wife and to her where it was I ran into her (I didn't know if she wanted her location blasted) and she said \"Of course. Want to take a picture?\"\n\nAbsolute solid human. Love her.","isChecked":false,"level":1,"score":"33"},{"author":"Btaylor45","body":"I met Justin Bieber at Turks and Caicos, he’s a pretty chill dude. My grandma told him he “wasn’t too bad to look at,” he said she wasn’t either. It was hilarious.","isChecked":true,"level":1,"score":"33"}],"id":"fxw890","submissionData":{"author":"willis1988","body":"","score":"19807","subreddit":"AskReddit","title":"What celebrities have you encountered that were either really nice or really horrible?"},"url":"https://www.reddit.com/r/AskReddit/comments/fxw890/what_celebrities_have_you_encountered_that_were/"}