{"commentsData":[{"author":"Naweezy","body":"The night sky and stars without light pollution. Seeing the milky-way bright and clear in all its glory is an unbelievable experience","isChecked":true,"level":1,"score":"9733"},{"author":"Ebuthead","body":"You can use www.lightpollutionmap.info to find the darkest spots near you","isChecked":false,"level":2,"score":"473"},{"author":"PronounceableMicrobe","body":"Kinda suck when you realize you need to drive up to 48h before you get a dark spot :(","isChecked":false,"level":3,"score":"103"},{"author":"joliesmomma","body":"Yeah. I live in southeast Texas and I'd have to drive to the middle of Texas to find a dark spot.","isChecked":false,"level":4,"score":"9"},{"author":"PronounceableMicrobe","body":"It sucks. I remember a story although idk if its true that one night there was a big black out, like no lights at all and people were freaking out calling the police because people were not used to see the sky like that. Fucking light pollution, imma tell you. I kinda find it funny if it's true haha","isChecked":false,"level":5,"score":"10"},{"author":"shabamon","body":"Canada's pretty dark, eh?","isChecked":false,"level":3,"score":"7"},{"author":"I_Automate","body":"One of the most profound moments of my life was staring up at the stars on about 200 micrograms of LSD and letting the true size of the universe settle into my mind. I don't know if I sat there for 10 minutes or an hour and a half, but.....my goodness. \n\nThat.....puts things into perspective. Made me realize just how absolutely tiny I am, how tiny we all are, and just how totally insignificant my \"problems\" were, in the grand sense. \n\nMade it a hell of a lot easier to just....let go of stuff. And for that I am forever grateful","isChecked":false,"level":2,"score":"2795"},{"author":"Nuf-Said","body":"Nothing like hallucinogens for opening up the mind.","isChecked":false,"level":3,"score":"808"},{"author":"I_Automate","body":"MDMA still did more for me as a person, but LSD is pretty darn wonderful.....","isChecked":false,"level":4,"score":"68"},{"author":"Nuf-Said","body":"They’re both awesome. I love mdma, but for me it’s more recreational. If you ever get the chance to experience ayahuasca, I highly recommend it.","isChecked":false,"level":5,"score":"45"},{"author":"I_Automate","body":"My first MDMA experience flipped the switch on a decade of clinical depression, so.....yea. It gets a special place in my heart. I hardly do it now, because it just isn't worth the side effects usually, but that first time was quite literally a life changing experience. \n\nLSD is about the only one I do with any regularity now, and I'll be honest and say that I'm pretty happy with where I am as a person now. Things like DMT and ayahuasca don't really interest me all that much. Doubly so because purging drugs just turn me off. Can't even enjoy mushrooms because of that","isChecked":false,"level":6,"score":"47"},{"author":"UncleChido","body":"How exactly do these drugs make you feel. Do you get a high or something \n\nEdit: I’m not one for any recreation drugs whatsoever, I’ve never even done weed. I’m just curious","isChecked":false,"level":7,"score":"25"},{"author":"banjosuicide","body":"First time I used hallucinogens I only took a very light dose and then went out to a restaurant. When I got there I realized they had just repainted and replaced their old faded decorations with vibrant new ones. The mood in the restaurant was light, and I had a great time. The truck parked out front was the reddest red I'd ever seen, and was amazingly shiny. Must have been some new kind of paint. When my food came, it had a deep aroma and great mouthfeel.\n\nI began to get suspicious, so asked my friend if they had redecorated the restaurant. He seemed confused and said it was the same. Then I asked him about the truck at the front. He confirmed it was, indeed, a plain 'ol red truck. The food was, he said, the same as it usually was.\n\nMy perception had changed, not the world. But the world was BEAUTIFUL and I was a bit giggly.\n\nStronger doses amplify that change in perception, while stronger doses yet will make patterns start to move. Your thoughts about what you perceive become kind of childlike in that you are seeing everything for the first time and are in awe. You can spend an hour just marvelling at and exploring the wood grain of a table (though you'll probably get distracted by something else amazing before long).\n\nI highly recommend you try hallucinogens at least once in your life. Just take a light dose and see how you feel. Some people have bad experiences with heavy doses, so I always recommend dipping a toe in before taking the plunge.","isChecked":false,"level":8,"score":"53"},{"author":"AnAverageFreak","body":"I've always wanted to try LSD, but my mood can swing from perfectly happy to horribly depressed within a second, so I guess I should wait until I've got my shit together.","isChecked":false,"level":9,"score":"14"},{"author":"This_is_your_mind","body":"Ever consider microdosing? It's not enough to trip, or even notice it unless you're sensitive to the effects and know what you're looking for. It makes everything a bit lighter, and makes you more connected/connective. It isn't an escape from reality, it is a plunge into it... \n\nIt's also a great way to introduce yourself to the substance without much (if any) risk. \n\nThe substance is incredibly powerful- if you learn to navigate your mind (which it helps you do), there is an endless supply of improvements you can make.","isChecked":false,"level":10,"score":"5"},{"author":"banjosuicide","body":"LSD and psilocybin (magic mushrooms) are euphoric psychedelic drugs. A small amount will just make you feel positive/happy for a while. I always have a nice \"glow\" for a few days after taking mushrooms. My favourite is to take half a gram, enjoy a long walk with my dog, and then listen to some music when I get home. That has always been a good experience for me. I only do it every few months though.","isChecked":false,"level":10,"score":"5"},{"author":"Bill-Psilocypher","body":"Explaining how psychedelics feel is almost on par with explaining color to somebody who is colorblind..  Have you ever seen those videos where they put on the the colorblind glasses and just start sobbing because of their realization to how beautiful everything is?? It’s kind of like that except probably more profound.","isChecked":false,"level":8,"score":"36"},{"author":"MyClitBiggerThanUrD","body":"Psychedelics are great drugs if used in a safe setting, since they aren't addictive, and really can be an eye-opening experience. Their main drawback is that if you take more than you can handle you will have a bad and confusing experience.\n\nPersonally even the bad trips are something I grow on, but you have to have the right mentality when going in.","isChecked":false,"level":8,"score":"7"},{"author":"420GreenMachine","body":"I once watched a meteor shower on mushrooms in a place with almost 0 light pollution and it was my most profound stargazing experience to this day","isChecked":false,"level":3,"score":"12"},{"author":"Anithaha","body":"I realized that in physics class","isChecked":false,"level":3,"score":"5"},{"author":"I_Automate","body":"I've been a space and science nerd my entire life. Like....read rocket engine piping diagrams for fun space and science nerd.I intellectually grasped the size of the universe as well as anyone could before that. \n\nThis....was different. It isn't an easy thing to explain to someone who hasn't experienced an altered state similar to that. I accepted it on an emotional level, if that makes any sense. Like the difference between knowing a fact and actually believing it. \n\nAgain. Tough to explain properly.....","isChecked":false,"level":4,"score":"8"},{"author":"DoinkDamnation","body":"Thats the beauty of that drug. Every time you take it you learn something new whether it be good or bad you always take something away from it. \n\n\"Aint no road just like it, anywhere i found. Running south on Lake Shore Drive, heading into town.\"\n\nHowever with everything going on lately, i do not recommend it. Took it during the pandemic and came to the realization of what it really means to lose all my grandparents and maybe even parents and how it can change my entire family for the rest of our lives. My girlfriend even needs to take Chemo meds for an ongoing condition and it can kill her too because if it. However now being sober i will be able to cope with it easier because im coping with it right now before it happens. But that doesnt mean i still had a good time. Sucked, makes me wish i spent more of my moments with those who mean the most to me. And something ill be doing more often. \n\nBut once again, thats the beauty of the drug.","isChecked":false,"level":3,"score":"18"},{"author":"peaceshot","body":"Lay down on the ground flat on your back, and imagine yourself looking down at the sea of stars below you as you are stuck to the ceiling of the universe.","isChecked":true,"level":2,"score":"9"},{"author":"keco185","body":"Saw this during a nighttime rocket launch. They tend to do those things in unpopulated areas for some strange reason. Anyway, I would not also recommend watching a rocket launch from as close as possible at night.","isChecked":false,"level":2,"score":"7"},{"author":"anynamesleft","body":"I get what you're saying, but I had me a chuckle at the thought...\n\n\n\"All that light pollution getting in the way of seeing me some lights.\"","isChecked":false,"level":2,"score":"6"},{"author":"Who__Dat__Boi","body":"I was at Basic Training for the Army and we were doing night vision training, and I remember looking up at the night sky with your NODs on was just the most prettiest and surreal thing ever. You could see so many more stars with that thing on than what you could see with the naked eye.","isChecked":false,"level":2,"score":"8"},{"author":"HeavingEarth","body":"Hell yes. My band was on tour some 15 years ago and were driving down a very long incline in the middle of the Mohave desert at night. Our brakes were getting hot, so we decided to stop for a bit. We all got out of the van and someone said “Holy SHIT. Look up.” I’d never seen anything like it. We laid on top of the van for about an hour, just staring in silence.","isChecked":false,"level":2,"score":"5"},{"author":"AzAgonyamegdolgok","body":"Every one use to see it until we came along","isChecked":false,"level":2,"score":"14"},{"author":"survivalothefittest","body":"Drink an ice-cold drink in hot hot shower or a bath. You're welcome.","isChecked":true,"level":1,"score":"5620"},{"author":"rococoD","body":"shower beer ftw","isChecked":false,"level":2,"score":"2661"},{"author":"ElSatchmo","body":"Shower beer is the most important beer of the day.","isChecked":false,"level":3,"score":"1204"},{"author":"BarryMacochner","body":"Gotta have that healthy breakfast to get ya goin.  \n\nBacon and eggs in shower would be shit.","isChecked":false,"level":4,"score":"132"},{"author":"malorianne","body":"r/showerbeer very much NSFW but if you like the human body and excellent beers, have a gander 🙂","isChecked":false,"level":4,"score":"8"},{"author":"RickxtyMinutes","body":"If it’s the only beer if the day, you have a ya it. If it’s the best beer of the day, you have a problem. And that problem is you are probably out of beer","isChecked":false,"level":4,"score":"11"},{"author":"EmoEnforcer","body":"Yes a good ol' shower beer, but I raise you a shower wine where you bring the whole bottle in the shower and you drink it all before the water gets cold.","isChecked":false,"level":3,"score":"373"},{"author":"jedbodine","body":"A friend of mine is a high school teacher and he says that his shower tequila is the way to go","isChecked":false,"level":4,"score":"185"},{"author":"EmoEnforcer","body":"Tequila fucks me up, and in a shower Im sure it would end in an ER visit lmao\nBut I suppose if I was dealing with HS kids all day, Id prefer  the former.\nEdit: spelling","isChecked":false,"level":5,"score":"143"},{"author":"americkidraconi","body":"Do you also drink the whole bottle with tequila before the water goes cold? Just asking for a friend","isChecked":false,"level":5,"score":"4"},{"author":"CGY-SS","body":"That's... is everything okay? Do you need to talk?","isChecked":false,"level":4,"score":"8"},{"author":"funkgerm","body":"This guy alcoholisms","isChecked":false,"level":4,"score":"3"},{"author":"jert3","body":"I used to smoke in the shower on occasion.\n\nIt wasn’t easy, was entirely ridiculous, but very satisfying!","isChecked":false,"level":4,"score":"4"},{"author":"takeme2infinity","body":"Shower orange","isChecked":false,"level":3,"score":"4"},{"author":"FrenzalStark","body":"Swimmy bevs.\n\nIn other news, due to the lockdown I got drunk and ordered a hot tub. Fucking best thing I've ever done. A beer in there is worth 2 anywhere else.","isChecked":false,"level":3,"score":"5"},{"author":"Karmasuhbitch","body":"It’s actually been proven to lower your blood pressure!","isChecked":false,"level":2,"score":"231"},{"author":"mybpdisvegan","body":"Thanks for saying this. I already have low BP and this could potentially be dangerous","isChecked":false,"level":3,"score":"294"},{"author":"esteflo","body":"Killer combination.","isChecked":false,"level":4,"score":"64"},{"author":"Testudinaes","body":"Instead you need to do something stressful in the shower. like darts, or advanced mathematics.","isChecked":false,"level":4,"score":"8"},{"author":"msirelyt","body":"Can you provide evidence? Genuinely curious.","isChecked":false,"level":3,"score":"7"},{"author":"EatABowlOfSpiderwebs","body":"Currently in a hot bath with an iced coffee - can confirm, this is, indeed, where it’s at.","isChecked":false,"level":2,"score":"126"},{"author":"SuperCool_Saiyan","body":"Orange juice or just an orange in the shower in the morning is a great start to the day","isChecked":false,"level":2,"score":"160"},{"author":"Bhuvi_b","body":"Wait so you brush your teeth after? Because an orange after brushing my teeth sounds not so great","isChecked":false,"level":3,"score":"86"},{"author":"manguish","body":"Rinse your mouth with hot water after brushing but before drinking orange juice.\n\nYou'll thank me later.","isChecked":false,"level":4,"score":"106"},{"author":"cobbl3","body":"No arguing with you, but being curious\n\nYou're not supposed to rinse after brushing because it washes off everything before it can effectively work\n\nAnd then you're drinking something acidic and not brushing after\n\nIs this really a good idea?\n\nMaybe add another water rinse after the OJ to be safe, but I think it would still be better to drink the juice and then brush.","isChecked":false,"level":5,"score":"54"},{"author":"nihilistgarfield","body":"you aren't supposed to brush right after having anything acidic bc it damages your teeth enamel","isChecked":false,"level":6,"score":"12"},{"author":"big-dratini","body":"Damn I’m gonna try this, gotta start with water, then I’m gonna try orange juice, and maybe I’ll do a cool beer after a cycle ride. This sounds awesome.","isChecked":false,"level":2,"score":"84"},{"author":"crazycerseicool","body":"You might enjoy r/showerbeer and r/showerorange.","isChecked":false,"level":3,"score":"9"},{"author":"big-dratini","body":"How curious. I’ll try eating an orange too.","isChecked":false,"level":4,"score":"5"},{"author":"crazycerseicool","body":"Don’t just eat the orange politely. Rip it open and devour it. It’s more fun that way. You may also want to chill it beforehand, too. In my experience, bigger oranges, like navel oranges, are better than smaller ones, such as tangerines.","isChecked":false,"level":5,"score":"5"},{"author":"rustysavage11","body":"It's called a power shower when you put some beers down. You feel amazing when you get out","isChecked":false,"level":2,"score":"3"},{"author":"Spoder_Spidey","body":"Just try to do 30 minutes of creative work a day. It is good for your mental health","isChecked":true,"level":1,"score":"2290"},{"author":"senunall","body":"What counts as creative work?","isChecked":false,"level":2,"score":"388"},{"author":"apple_sandwiches","body":"Writing, cooking, singing, playing an instrument, drawing, knitting, basically anything you can *create*.","isChecked":false,"level":3,"score":"717"},{"author":"Heeeeeeyyyyyy","body":"Make a baby?","isChecked":false,"level":4,"score":"508"},{"author":"BLMdidHarambe","body":"Do it creatively!","isChecked":false,"level":5,"score":"359"},{"author":"yallgrossyall","body":"They don't call me crayola for nothin'!","isChecked":false,"level":6,"score":"144"},{"author":"Camstonisland","body":"But do they call you Crayola for nuttin'?","isChecked":false,"level":7,"score":"119"},{"author":"yallgrossyall","body":"Nuttin but a pencil dick","isChecked":false,"level":8,"score":"11"},{"author":"hucklebutter","body":"But what do I do with the other 28 minutes?","isChecked":false,"level":5,"score":"88"},{"author":"FunkyJokers","body":"Create a budget preparing for said baby.","isChecked":false,"level":6,"score":"42"},{"author":"letzterspielmann","body":"According to a workshop about finding creative solutions I took at my university:\n\nBasically anything that lets you think differently or in detail about something you already know.\n\nThis can range from filling out colouring books, drawing something yourself (sketches are enough, especially at the beginning!), paying attention to how you sing or play an instrument to basic things like really taking time to *feel* everyday-objects or focusing on your senses in general. (basically practicing mindfulness)\n\nBut in general also pretty much everything that creates something.\n\nAnother aspect you should really train that goes well with creative work is how to focus on something...","isChecked":false,"level":3,"score":"77"},{"author":"ps2op","body":"Trying to come up with something. Art, name for a baby, a meme, some kind of punchline or try to find rhyming words to somebody's name. I think you get my point.","isChecked":false,"level":3,"score":"8"},{"author":"TheBiggestNose","body":"See I'd like to do this but my complete lack of artistic talent just makes me annoyed","isChecked":false,"level":2,"score":"6"},{"author":"FlwrPowr","body":"Absofuckinlutely!","isChecked":false,"level":2,"score":"12"},{"author":"survivalothefittest","body":"Realize you cannot compare suffering.","isChecked":false,"level":1,"score":"4661"},{"author":"Pas7alavista","body":"Everyone is missing the point. It's not that you can't compare suffering, the issue is that you need to keep it to yourself. If someone comes to you for help, it doesn't matter how inane their problems are from your perspective. And, it doesn't matter how much better or worse that person may have it than you. Some people don't know how to handle things that we may have experienced. It doesn't mean that you're any better than them, or any more mature than them just because you had worse experiences. \n\nBy ranting about how someone \"doesn't even know\" or invalidating their problems you are only making it worse for them.","isChecked":false,"level":2,"score":"2213"},{"author":"Literally_An_Egg","body":"I also vote for the same thing but reverse. Don't feel bad for having problems when \"that person has it so much worse\". Guilty of doing that to myself a lot, since a lot of my anxiety is somewhat irrational or over minor things (like hearing an airplane pass by overhead, or people yelling over silly things).\n\nIf you convince yourself that your suffering isn't valid just because you can't handle as much as some other people can, you'll only wind up more miserable.","isChecked":false,"level":3,"score":"381"},{"author":"bamafloralina","body":"Thank you so much for saying this. I just had a conversation with my best friend last night about this. She's filing for unemployment. I have a stable job and resources. But I also struggle with severe depression and anxiety, so my brain is a mess these days. I'm on an endless loop of anxiety, gratefulness, guilt, repeat. I appreciate reading your comment more than you know.","isChecked":false,"level":4,"score":"12"},{"author":"Literally_An_Egg","body":"Im glad I could help you out, friend. I hope things start getting better for you soon.","isChecked":false,"level":5,"score":"6"},{"author":"drackaer","body":"One thing that for me helped put \"misery Olympics\" in perspective was flipping it.  It seems much more ridiculous if we were to say \"you can't be happy about getting that promotion, someone else won the lottery today!\"  But really it is the same kind of thinking: \"you aren't allowed this emotion because someone else experienced a bigger version of that emotion.\"","isChecked":false,"level":4,"score":"13"},{"author":"survivalothefittest","body":"Yep, that's my point. Well said and thanks.","isChecked":false,"level":3,"score":"217"},{"author":"Pas7alavista","body":"Yeah I had to talk about this with my friend recently so the convo is fresh on my mind. He's dating a girl a few years younger than him that uses him as her therapist. Complaining about pretty lame stuff (typical drama and parental shit) and I had to tell him that suffering is not a contest. For that girl, this petty shit may legitimately be the worst thing she's experienced. It's all relative, just because you have seen worse, doesn't mean that another person's problems are no longer valid. You are completely free to think about how dumb it is, but calling people out only makes things worse.","isChecked":false,"level":4,"score":"175"},{"author":"breadybreadman","body":"I've had people do this to me, I'd try and talk to them about my feelings and they would be like \"at least you haven't experienced this bla bla bla\"\n\nAn example, i was complaining to a friend about how shit i felt on a school camp we were on and how i wanted to go home and she said \"you should be grateful, there are children who Don't get these privileges, stop complaining so much its not that bad\" like no, i have to deal with people that i hate for an entire week, my two only close friends aren't even here and i can't contact them. hate it here and i want to go home. \n\nDamn, should have gone to r/offmychest for this, sorry","isChecked":false,"level":5,"score":"45"},{"author":"KuriousKhemicals","body":"Yeah - it's like a mini version of what's up with children. To an average well cared for 3 year old, not getting to have their favorite breakfast is literally one of the most anguishing experiences they've ever had.  We understand that as ridiculous but we also understand that we need to be compassionate and engage with it as a valid feeling because they are a child and their brain hasn't been calibrated yet comprehend more difficult things.\n\nAdults don't usually cry over breakfast choices, but there's still a range of that. The human mind can only process so much despair, and if you've had your standard set by really fucking tough things then the petty bullshit gets scaled down, but for people with luckier pasts some of that bullshit is scaled up to the measure of how bad things can be.","isChecked":false,"level":5,"score":"6"},{"author":"SpeckleLippedTrout","body":"I like to put this as “your 10 is still a 10, even if it’s a 1 to me”\n\nIf the worst pain you’ve ever felt is stunning your toe, then stubbing your toe is a 10. The fact that I’ve lost a hand in a farming incident and that’s my 10 doesn’t make your pain invalid.","isChecked":false,"level":5,"score":"4"},{"author":"Curleysound","body":"I grew up in an entire city of these people. Everything is the suffering olympics. Every problem, someone has it worse.\nEdit: and if you do manage to overcome everything and make something of yourself then you get the “oh, look who’s better than everyone else...” treatment","isChecked":false,"level":3,"score":"4"},{"author":"Asclepigenia","body":"Well, you certainly can't compare yours to *mine*.","isChecked":false,"level":2,"score":"106"},{"author":"sheepthechicken","body":"Agreed. In addition to the way that you’ve already mentioned in other comments, it’s important not to discredit your own pain because others have it “worse.” \n\nYes, there are other humans that have suffered and survived horrific things, and have managed to overcome their past. \n\nThat doesn’t mean that your pain is insignificant. In your timeline, in your experiences, that pain is very significant and deserves to be seen.","isChecked":false,"level":2,"score":"7"},{"author":"TheMemeSaint177","body":"I wish some people would realize that. I remember a friend of mine opened up about his anxiety and this one girl (not a friend and she was just there) said “well if you think THAT’S bad, I have panic attacks every day.” I don’t want to downplay panic attacks and not believing mental health because I’ve struggled with it too, but this was not the time to do that. Rephrase it as “I struggle too” as a way of letting my friend know he’s not the only one.","isChecked":false,"level":2,"score":"8"},{"author":"FLAMING_popsicle","body":"Learn how to cook","isChecked":true,"level":1,"score":"14786"},{"author":"Morocco_Bama","body":"Being quarantined I finally learned how to make bread from scratch! *Sliced* my bread budget, it did!","isChecked":false,"level":2,"score":"3989"},{"author":"BlueDogXL","body":"The amount of money you’ve got has *risen,* hasn’t it?","isChecked":false,"level":3,"score":"1813"},{"author":"notadilemma","body":"oh, you KNOW they’re saving lots of *dough* now.","isChecked":false,"level":4,"score":"1159"},{"author":"Forikorder","body":"they're gonna *knead* that later","isChecked":false,"level":5,"score":"875"},{"author":"waddaya_say","body":"You guys are making me _loaf_ so hard","isChecked":false,"level":6,"score":"724"},{"author":"Morocco_Bama","body":"You can *pumpernickel* that again!","isChecked":false,"level":7,"score":"423"},{"author":"saltyhumor","body":"Sure can, just give it a *rye*.","isChecked":false,"level":8,"score":"463"},{"author":"RedDevil0723","body":"At *yeast* you guys have the stuff to make bread.","isChecked":false,"level":9,"score":"477"},{"author":"Mr_Clean-Up","body":"Meanwhile, I'm so broke I'm sleeping on the *flour*","isChecked":false,"level":10,"score":"450"},{"author":"Proffunkenstein","body":"It’s the yeast you can do.","isChecked":false,"level":5,"score":"189"},{"author":"mackmixt9","body":"My friend loaves to make bread too! She says once you start, you can't qu-wheat.","isChecked":false,"level":6,"score":"130"},{"author":"elebrin","body":"It takes a long time but isn't labor intensive. \n\nThe thing I CAN'T make though is the 35 calorie a slice bread that I usually buy. I like that I can make a sub-200 calorie sandwich :p","isChecked":false,"level":3,"score":"135"},{"author":"Morocco_Bama","body":"> isn't labor intensive \n\nYeah I was blown away by how straightforward it is. It's relaxing!","isChecked":false,"level":4,"score":"57"},{"author":"elebrin","body":"The only annoying thing is the amount of cleanup involved. I love making things by hand/from scratch, but I never ACTUALLY want to do it because I gotta clean up after but I don't want to do it, lol.","isChecked":false,"level":5,"score":"80"},{"author":"Morocco_Bama","body":"Man probably my favorite meal that I make is a seafood alfredo pasta with spinach and mushrooms, with homemade alfredo sauce. It is my favorite thing in the world and it uses up all of the dishes in the house and it takes me *30 fucking minutes* to clean up afterwards.\n\nEDIT: I just re-read my comment and wow is my privilege ever showing.","isChecked":false,"level":6,"score":"134"},{"author":"korinth86","body":"Prep everything before you start cooking. Then use those little breaks in between stiring and whatnot to clean dishes and wipe counters.\n\nAfter dinner cleanup cut down immensely unless your making a casserole or something that is baked in a pan.","isChecked":false,"level":7,"score":"46"},{"author":"Morocco_Bama","body":"I do try, but that particular meal requires constant attention to two pots (noodles and sauce) and a pan, and two of those three can't be cleaned until after everything is complete.","isChecked":false,"level":8,"score":"12"},{"author":"korinth86","body":"ahhhhh, unfortunately delish dish","isChecked":false,"level":9,"score":"7"},{"author":"Kwualli","body":"Clean as you go. It's a freaking time saver and if you start telling yourself that it's part of the cooking process, you kind of fool yourself into cleaning anyway.\n\nReference: Personal experience. I love to cook, but hate to clean up.","isChecked":false,"level":6,"score":"7"},{"author":"2Punx2Furious","body":"It seems that's everyone's idea now. No yeast to be found here in Italy, supermarkets even have signs outside saying they're out of yeast.","isChecked":false,"level":3,"score":"5"},{"author":"Alagane","body":"Gotta get into sourdough in that case","isChecked":false,"level":4,"score":"4"},{"author":"-Nyoom-","body":"I really want to add something. Learn to cook and learn to clean up the mess afterwards.","isChecked":false,"level":2,"score":"261"},{"author":"Pangolin007","body":"CLEAN AS YOU GO PEOPLE. I hate cleaning but I find it’s much more tolerable if I clean each tool as soon as I’ve finished with it.","isChecked":false,"level":3,"score":"315"},{"author":"Bananalando","body":"I also do my best to clean up as I'm cooking. Any time something has to rest or simmer, or bake for a while, my hands are in the sink, washing dishes, but it's definitely not always possible. Some meals have such short cook times or a rapid sequence of events such that you've no choice but to clean up afterwards. The real trick in my experience is to clean up as soon as you're done eating. Relax and unbuckle the proverbial (or literal) belt after the kitchen is clean.","isChecked":false,"level":4,"score":"71"},{"author":"Toska_Ennui","body":"You can clean as you go. Being organized and clean in the kitchen goes a long way. Afterwards you'll have way less to clean if you make this a habit and won't even seem like a chore.\n\n\nThis goes for people who cook for others as well. If the household rule is \"whoever cooks doesn't have to do the dishes\" you can still clean up as you go, that way the person in charge of the dishes will have way less to clean.","isChecked":false,"level":3,"score":"4"},{"author":"Ask-Reggie","body":"I made hot dogs today","isChecked":false,"level":2,"score":"109"},{"author":"SnottyTash","body":"Nice! I made a restaurant make me sushi","isChecked":false,"level":3,"score":"9"},{"author":"macmooie","body":"I was fortunate my dad was a chef. I grew up watching him cook on the stove everyday for us. I'm a master home cook now all thanks to my dad.","isChecked":false,"level":2,"score":"135"},{"author":"Smiles_in_the_dark","body":"Fellow “Chefling” here (that is what my chef father called me as a kid). I am so grateful for everything he taught me!","isChecked":false,"level":3,"score":"11"},{"author":"Psych_o0o_naut","body":"Cooking is such a great skill to teach to someone. It can help you to stay healthy, it's highly individual and creative. Like painting/drawing, but for your body.","isChecked":false,"level":4,"score":"7"},{"author":"Eagleassassin3","body":"I just don’t know where to start. It’s overwhelming. Should I just pick a few recipes I like and just do those?","isChecked":false,"level":2,"score":"6"},{"author":"weewee52","body":"Yes! Start with something with just a few simple ingredients. Maybe also good if it’s something you’d eat regularly as takeout or cooked by someone else, so you are familiar with how it should turn out. \n\nI’m always am amazed at how many people can’t cook. I was not raised to cook for myself, but figured it out. You can do it!","isChecked":false,"level":3,"score":"7"},{"author":"kendramatica","body":"I'm prepared to a' salt you guys with a breadly weapon","isChecked":false,"level":2,"score":"6"},{"author":"Jiu_jitsu_lila","body":"Work out. It does so much not just physically, but also is great for our moods. Even people with physical limitations can adapt some kind of workout to their body.","isChecked":true,"level":1,"score":"5773"},{"author":"Friedeggs15","body":"I agree, I feel emotionally better after I get some kind of exercise.","isChecked":false,"level":2,"score":"719"},{"author":"cripplefoot1","body":"Same here, I've started going back to the gym (at work, in a remote camp) and I feel like a million bucks after my workout","isChecked":false,"level":3,"score":"228"},{"author":"Pedmunds18","body":"Home gym here. It really comes in clutch. I just wish more people would exercise but the hardest thing about it is consistency.","isChecked":false,"level":4,"score":"8"},{"author":"johnchase93","body":"Yea me too. I just got up and grabbed a pizza outta the oven.","isChecked":false,"level":3,"score":"7"},{"author":"Swagiken","body":"I feel compelled to point out that this doesn't work for everybody. I always fall into a deep depression whenever I work out. Getting physical exercise through work is fine, walking long distances as my commute? Fine. But actively going out and working out? I'm fine for the first 10 minutes and by the time I stop I'm a mess. It then lasts for weeks.","isChecked":false,"level":3,"score":"5"},{"author":"grandiosebetafish","body":"Oh my god! This is exactly what happens to me! I just feel hopeless and out of shape and lose all motivation within 10-15 minutes. That turns into depression and it lasts for days. My favorite “work outs” are honestly activities like walking around the city, swimming or dancing at a bar or club. \n\nSo I, uh, haven’t worked out since the pandemic started haha","isChecked":false,"level":4,"score":"5"},{"author":"proddyhorsespice97","body":"Since I've been out of work with the whole quarantine thing I've started running most mornings. I feel like I have so much more energy throughout the day now which seems weird","isChecked":false,"level":2,"score":"153"},{"author":"spaektor","body":"probably helps that you're not working lol","isChecked":false,"level":3,"score":"19"},{"author":"CryForWolf","body":"I never know where to start and how to keep going. Anyone got any tips?","isChecked":false,"level":2,"score":"7"},{"author":"ak501","body":"There are so many options for healthy exercise.  You could get into weightlifting, which is my preferred method, or body weight fitness and calisthenics.  You could start doing kettlebell workouts.  Yoga isn’t my thing, but a lot of people are into that.  I have friends who strictly ride bikes and do pull-ups and they are in excellent shape.  Some people are into running, which will definitely make you fit.  I’ve always wanted to try training in some sort of martial art, but never had the time.  Some people really like workout videos like insanity or p90x and you can do those from home.  CrossFit gets a lot of criticism, but it looks like fun and will probably get you into great shape.\n\nThe thing that I have found to work is to find something that you 1) Enjoy doing and 2) you can progress in and constantly get better.  Your motivation to get fit will fade away relatively quickly, but progressing towards that new squat PR, or being able to keep up with your biking friends, or getting your first muscle up, will keep you going back.  \n\nAlso I hate the mindset of “getting fit” because it isn’t like you spend a couple months working out and you then achieve your goal and can move on with your life, being physically fit is a lifestyle and that is the mindset you need to have.  Physical activity is like brushing your teeth, it is part of your regular routine that you need to find time for because it is important to your overall health and wellbeing.","isChecked":false,"level":3,"score":"10"},{"author":"magnacarter24","body":"IMO consistency is practically 100 times more important than intensity. The hard part is building up a routine, once you’ve been doing something for a few weeks it’s not so hard to keep on doing it. To get the routine started I would start with either strength training or cardio, pick which one is the easiest/most enjoyable for you. Then pick the easiest workout you can imagine. I’m talking like 5 -10 knee pushups, or a 10 minute walk. \n\nNext is the key: Do this everyday and remind yourself how proud you are of completing your workout even on the worst days where you might leave the house, walk for three minutes and come back, you have to be proud. If you can keep this up for two to three weeks I guarantee you will start increasing your workouts without it feeling like a burden. It’s all about taking your time, after a few months you might be running 3 miles or doing a 30 min workout everyday which is more than enough to keep you fit and healthy!","isChecked":false,"level":3,"score":"4"},{"author":"thebaronvontito27","body":"This got my depression in check in a big way. Couldn’t recommend it more.","isChecked":false,"level":2,"score":"7"},{"author":"vivalalina","body":"Damn I wish I could relate, I just get sad and exhausted after working out LOL","isChecked":false,"level":2,"score":"9"},{"author":"remijn","body":"I would argue that physical limitations are actually a reason to work out. Not only to feel better about your body, but also to be able to keep you healthy when you aren't as active in everyday life because of your limitation.","isChecked":false,"level":2,"score":"4"},{"author":"Grammy_2019","body":"Know that not everyone knows your backstory.\n\nKnow that not everything someone talks to you about, is about you.\n\nYou learn when you listen.","isChecked":true,"level":1,"score":"8809"},{"author":"orange_avalanche","body":"Also, the corollary: you know very little of the backstory of almost everybody in your life.","isChecked":false,"level":2,"score":"1640"},{"author":"Pas7alavista","body":"Also, you can't assume that people want to hear your story, or that they want to talk about theirs.","isChecked":false,"level":3,"score":"613"},{"author":"generalbob_04","body":"Also, not every character's backstory is worth making a movie about. (I'm looking at you X-Men)","isChecked":false,"level":4,"score":"111"},{"author":"ExistentialBob","body":"Aw man! I was looking forward to the Dazzler movie...","isChecked":false,"level":5,"score":"4"},{"author":"HumanAirror","body":"I like it that way.  Only talk about your story with people u trust.  Some of us get judged enough as it is!","isChecked":false,"level":4,"score":"7"},{"author":"Pas7alavista","body":"Yes. But some compulsive sharers will expect information back after they talk your ear off about something that you never asked about. That's more of the situation I was describing.","isChecked":false,"level":5,"score":"10"},{"author":"Banditkoala_2point0","body":"I'm the absolute opposite of this. I'm not sure if it's my desperately low self-esteen, or may anxiety and also a *need* for some sense of privacy...... I always assume no-one gives two shits about me so I don't really bother opening up unless I come across someone who feels trustworthy and safe.\n\nI think it comes from an incident where my husband and I were bashed by bikies and some people I knew at the time via work found out and said they'd tell the perps our address/ number (because we pressed charges). It's not that I automatically don't trust people, I just think less information is safest for everyone.","isChecked":false,"level":4,"score":"8"},{"author":"Pas7alavista","body":"I agree with you, I don't see anything unhealthy about keeping to yourself as long as you aren't doing it to hide. If you have even one person in your life that you can share with, it's enough imo.","isChecked":false,"level":5,"score":"4"},{"author":"carlotta4th","body":"Similarly, recognize that even if you remember mistakes you made and are raking yourself over the coals for them--other people most likely didn't notice and don't care even if they did. They're too busy worrying about their own concerns and mistakes. Do *you* constantly remember the time when your coworker forgot to replace the printer ink and printed 20 blank pages? No? Then they don't remember when you did it either, so chill.\n\nChill guys. Life isn't as bad as your brain is convinced it is.","isChecked":false,"level":2,"score":"231"},{"author":"voodoo-ish","body":"The worst part of it all is that I do remember all those times people forget to replace printer inks, forgot to reply that e-mail or were late for a date. And that makes me a wreck that is always walking on eggshells with everybody. hahaha","isChecked":false,"level":3,"score":"11"},{"author":"avg-erryday-normlguy","body":"I was going to say, people remember shit like that all the time.\n\nSome people just have no respect for others and like to feel superior by constantly bringing it up. That's what worries me","isChecked":false,"level":4,"score":"7"},{"author":"skidr0jr","body":"Look up the word 'sonder'. It's pretty much exactly this and everyone could use it for sure!","isChecked":false,"level":2,"score":"110"},{"author":"cityfeeen","body":"Be nice to people. You never know what is going on in someone's head and a little nod to salute a stranger could cheer them up hugely.","isChecked":true,"level":1,"score":"1710"},{"author":"Pangolin007","body":"Similarly, give people the benefit of the doubt. Not always expecting the worst of someone makes life a bit smoother.","isChecked":false,"level":2,"score":"8"},{"author":"Almost_British","body":"Be kind, for everyone you meet is facing a hard battle","isChecked":false,"level":2,"score":"7"},{"author":"kevin_tanjaya","body":"You mean be KIND to people?","isChecked":false,"level":2,"score":"51"},{"author":"Kaidenshiba","body":"He means be kind to strangers","isChecked":false,"level":3,"score":"7"},{"author":"theotherkeith","body":"Why not both?","isChecked":false,"level":3,"score":"8"},{"author":"FuzzyWuzzyMoonBear","body":"Question everything.\n\nThink about why you are the way that you are as a person and how you affect others around you.\n\nEdit: If this comment comes across as dickish or insensitive towards those suffering from mental illness I apologize, that was not my intent. \n\nBe self aware and think critically were the main points I was trying to make. But as others have pointed out also think critically about the answers to your questions.","isChecked":true,"level":1,"score":"8163"},{"author":"StructuralFailure","body":"But why?","isChecked":false,"level":2,"score":"4978"},{"author":"FuzzyWuzzyMoonBear","body":"Why not? Thinking is free","isChecked":false,"level":3,"score":"1787"},{"author":"Dragonsheepling","body":"Why make it free?\n\nEdit: Added Captitalisim","isChecked":false,"level":4,"score":"1479"},{"author":"TheHotze","body":"Too large of a supply, way too small of a demand.","isChecked":false,"level":5,"score":"331"},{"author":"Ornography","body":"this is deep. The demand for thinking for yourself is pretty low. Sometimes you have to argue against what you actually believe to better understand why you believe those things.","isChecked":false,"level":6,"score":"10"},{"author":"TickleMyPiano","body":"Nice","isChecked":false,"level":5,"score":"134"},{"author":"not9anymore","body":"But why is it nice?","isChecked":false,"level":6,"score":"39"},{"author":"eizenh3im","body":"Why did you add Captitalisim?","isChecked":false,"level":5,"score":"5"},{"author":"None","body":"[deleted]","isChecked":false,"level":3,"score":"87"},{"author":"Man_bunny","body":"I see what you did there","isChecked":false,"level":3,"score":"27"},{"author":"pkory1","body":"Agreed that this is important, but questioning everything comes with the responsibility of learning how to think critically. People who question everything, but haven't first learned how to think critically, are exactly how we end up with antivaxxers, people who are scared of 5G and other conspiracy thinkers. So I would add to this, question everything -- but also learn to evaluate what you are questioning without ignoring evidence.","isChecked":false,"level":2,"score":"138"},{"author":"BobTheSCV","body":"Once you start to question everything, the next thing you'll need to learn is living with uncertainty. \n\nIf 2500 years of philosophy has amounted to anything, it's the disturbing realization that there really isn't a lot of things we *can* know for sure, including but not limited to the fact that:\n\n* Your memories are reliable, and by extension anything we think we know about our own past. You really can't refute a statement like \"The world came into existence right now, as-is, with humans and memories of the past\"\n* Your sense experiences are reliable, and by extension anything we think we know about the physical world, including the fact that it exists. See Descartes' evil demon.\n* That our own experience can be generalized to the experience of other humans, that is, that they aren't mindless automatons or NPCs or the like\n* That reality is in objective, and that a posteriori truth claims are useful. It's entirely possible for the world to seem like it does for as long as it has, and then completely change the rules.  We're simply assuming it can't because it hasn't.","isChecked":false,"level":2,"score":"285"},{"author":"cuteboye","body":"Stoic philosophers like Seneca, Marcus Aurelius or Epictuts really helped me to focus more on things in my control and to not care what others think.\n\nIt's really fascinating reading those words and remembering that they were written 2000 years ago","isChecked":false,"level":3,"score":"103"},{"author":"xxNotAPlane","body":"I don't really think that the stoics are all that great. I think that in the time they were righting they provided very great insights. But once the enlightenment arrived, there is no more going back to that sort of spiritualistic form of philosophy, it just isn't accurate for the times we live in. Philosophy and science should be about understanding our own internal contradictions, and being able to view the world through a variety of lenses.","isChecked":false,"level":4,"score":"9"},{"author":"cuteboye","body":"I know what you mean. You need to remember that they literally lived 2000 years ago and all big Stoic philosophers lived through certain crysis (Aurelius literally died in a pandemic that lasted 14 years, Epictetus was a slave and Seneca had to kill himself).\n\nBut they had very good points. \n\nThey try to tell you that you should always remember that you die soon and never hold onto something, as you will return one day (is it a friendship, a loved one or a mobile phone - one day it will be gone). Their philosophy is about logic and acceptance.\n\nThey give you great insights on how to stay calm, no matter how big the storm is.\n\nAnd even thought they tell you that everything will be over one day, they dare you to be a good human being. \n\nHell, Seneca even wrote that he one doenst need to believe in everything the big Stoic philosophers write or say. He said that one should think for himself, with the intention to be good. But one can very well take an argument made by a Stoic philosopher and share his own opinion with others. \n\nSeneca was one of the richest man of his time. He was hated for his lifestyle that stood in such a big contrast to his wealth, but he wrote, that being a Stoic doesn't mean to give everything away or don't care at all, it means that you can (and should) have pleasure, fun and good times, but to never act out of Lust and to be always ready to give everything back if that's you fate.","isChecked":false,"level":5,"score":"21"},{"author":"xxNotAPlane","body":"Yes, it was a great philosiphy, but my point is that once the pandora's box that is the enlightenment was opened, and we entered the modern era, it's not enough, it's not a fulfilling philosophy. Is it great for self help, sure, i guess, but that's not really what the point of philosophy is. Philosophy ought to be about understanding who you are and where you are in a systemic way, and that has only gotten harder. Think about how much more complicated today's world is compared to classical Rome. Think of how inauthentic it is comparatively. If you have the time, I'd suggest you check out Sartre and Heidegger. Existentialism isn't my cup of tea, but it has the same general vibe to it that stoicism has. Heidegger in particular, his ontology is one of distance, specifically distance to death, and he has a very unique way of expressing the anxiety we feel due to that fact.","isChecked":false,"level":6,"score":"6"},{"author":"None","body":"[deleted]","isChecked":false,"level":7,"score":"7"},{"author":"semi-bro","body":"Okay sure, we are all in a matrix simulation of a boltzmann brain in a jar looking at the shadows on the wall of Plato's cave that started last Thursday. what you going to do about it? What's the point of freaking out about all this stuff that you can't prove and if you somehow proved couldn't do anything about?","isChecked":false,"level":3,"score":"6"},{"author":"BobTheSCV","body":"The point is to give you some perspective and intellectual breathing room. It's very easy to get lost in a maze of ideas and thoughts, and forget just how much you've assumed to even get there. \n\nYou can't even know if the world exists, and you're here you are worried about whether a girl likes you?","isChecked":false,"level":4,"score":"5"},{"author":"smg_vigilante","body":"Not being a smartass here, just two things.\n• Memories may be burned in your brain but over time they become less reliable. Your consciousness actually makes your memories malleable, and often alters them to what makes most sense to you.\n• Senses aren't necessarily reliable if you have some mental disorders?","isChecked":false,"level":3,"score":"6"},{"author":"jnyk20","body":"But why do people get angry whenever you question them?","isChecked":false,"level":2,"score":"71"},{"author":"ThatHairyGingerGuy","body":"I dunno... maybe ask them","isChecked":false,"level":3,"score":"81"},{"author":"dlo4sho","body":"100% \n\ncliche alert- knowledge is power. Knowledge comes from finding the answers to questions and even coming up with the questions.","isChecked":false,"level":2,"score":"11"},{"author":"Cytorath","body":"I have raised my sons to question everything, including me.  I don't know everything and I'm not always right.  I've taught them to do it in a respectful manner.  You can't be rude or an ass about it.","isChecked":false,"level":2,"score":"4"},{"author":"barsavii","body":"\"Jon Arryn had been hand for fourteen years, why kill him now?\", Asked Ned.\n\"Because he started asking questions.\", Said Varys.","isChecked":false,"level":2,"score":"3"},{"author":"Eleenuh","body":"Dig a hole. Like actually, I started digging to get to some cables but it feels so good when you've accomplished it and the pile of dirt is huge","isChecked":true,"level":1,"score":"3998"},{"author":"TannedCroissant","body":"I regularly dig holes.  Mainly during conversations in large groups.","isChecked":false,"level":2,"score":"3028"},{"author":"jeazyjosh554","body":"City worker alert","isChecked":false,"level":3,"score":"563"},{"author":"GoodLunchHaveFries","body":"*puts shovel in ground* Yeah that’s good for a couple hours.","isChecked":false,"level":4,"score":"224"},{"author":"TurnPunchKick","body":"I hate so much that people think they are lazy.  My job was watching guys dig a hole for a while.  Actually my job was to be the first guy there to sound the alarm and throw down a ladder if there was a land slide and knowing how many guys we needed to dig out.  But to a bunch of people I was just standing there.","isChecked":false,"level":5,"score":"11"},{"author":"GoodLunchHaveFries","body":"Sounds like a pretty sweet gig","isChecked":false,"level":6,"score":"6"},{"author":"None","body":"[deleted]","isChecked":false,"level":3,"score":"353"},{"author":"nroth21","body":"You’re a national treasure","isChecked":false,"level":4,"score":"53"},{"author":"ensygma","body":"Dr Seuss?","isChecked":false,"level":4,"score":"7"},{"author":"mt19937","body":"https://en.wikipedia.org/wiki/Holes_(novel)\n> The inmates are assigned to dig one hole each day, five feet wide and five feet deep, which the Warden claims \"builds their character\".","isChecked":false,"level":2,"score":"285"},{"author":"thatsmesaurav","body":"What we have got here is failure. Failure to communicate....","isChecked":false,"level":3,"score":"58"},{"author":"JarJarBinks_jpg","body":"WELL THATS JUST TOO DAMN BAD","isChecked":false,"level":4,"score":"15"},{"author":"asdfghjkl710","body":"I just heard that line in my head exactly how it was spoken even though I haven’t seen the movie in 15 years \n\n\nDamn Disney channel commercials","isChecked":false,"level":4,"score":"16"},{"author":"Jonsp7","body":"Some men you just can’t reach","isChecked":false,"level":4,"score":"6"},{"author":"Tarah_with_an_h","body":"Such a great book AND movie!","isChecked":false,"level":3,"score":"26"},{"author":"TheReinsofFullnight","body":"I read the book in 6th grade and then we walked to the movie theater to see it in theaters as a field trip! Seriously one of my most memorable field trips since I loved the book so much.","isChecked":false,"level":4,"score":"8"},{"author":"xzElmozx","body":"Ya thirsty Stanley?\n\nWell...ya better get used to it, cause you're gonna be thirsty for the next 18 months","isChecked":false,"level":4,"score":"7"},{"author":"m-sterspace","body":"I mean, I do think everyone who's able bodied should be required to dig a 5' wide, 5' deep hole, at least once before graduating high school. It's really hard to dig a hole that big. It would at least teach everyone about how hard holes are to dig.","isChecked":false,"level":3,"score":"8"},{"author":"1jamster1","body":"Fair warning digging a grave for your dog is not fun. Though it does help get through some of the emotions.","isChecked":false,"level":2,"score":"110"},{"author":"somajones","body":"Not only that but my esteemed colleague, Nikitenko weighed maybe 60 pounds when he was alive. \nI carried him through the woods to the grave I dug in a spot above our favorite lake and I swear he weighed a thousand pounds.","isChecked":false,"level":3,"score":"71"},{"author":"chalkboardsky","body":"I had to fish my ex girlfriend’s dog from the pool with a large stick when I found him dead in there. Poor chippy was old, blind, and grumpy most of the time, but didn’t deserve to die alone. I ended up digging a large hole in the rain underneath the lamppost in her backyard to bury him. He was considerably heavier from being bloated from the pool and the dampness of the rain. Sorry for dropping that on you, just reminded me of that time.","isChecked":false,"level":4,"score":"29"},{"author":"samfish90212","body":"It was the weight of the emotion. I had a pre mature pup I bottle fed for weeks until he died. He was less than a pound but he felt like he weighed ten when I buried him.","isChecked":false,"level":4,"score":"36"},{"author":"saltyhumor","body":"Shia LaBeouf?","isChecked":false,"level":2,"score":"94"},{"author":"Imperial_LMB","body":"Stanley Yelnats?","isChecked":false,"level":3,"score":"102"},{"author":"Rushderp","body":"Let me tell you Girl Scouts a story...\n\nThere once was a place where it never rained... THE END!","isChecked":false,"level":4,"score":"38"},{"author":"toxoxoxo","body":"Probably my favorite movie as a kid, definitely top 5 still.","isChecked":false,"level":5,"score":"8"},{"author":"KaiserSpawn","body":"I actually just got finished watching this movie. Still a classic.","isChecked":false,"level":6,"score":"6"},{"author":"tommystjohnny","body":"You accidentally spelled his name backwards.\n\nIt's Stanley Yelnats.","isChecked":false,"level":4,"score":"7"},{"author":"Masterofmayhem4lyfe","body":"Builds character","isChecked":false,"level":2,"score":"48"},{"author":"Disciple_of_Sithis","body":"Advisory: Dig in moderation! I've dug many a hole, a few gardens beds and a 14 metre long trench almost a metre deep through basalt and quartz, after a while the digging becomes too much, shovel too heavy, the pick becomes a nightmare and the pride you feel just turns to exhaustion, I never want to touch a shovel again, my digging days are done, so remember this warning and always dig in moderation. :)","isChecked":false,"level":2,"score":"113"},{"author":"savagela","body":"If you need help, Diggers Anonymous can show you a new way of life. Many people say they can stop digging, but  find they cant. We've been there, and we can show you the 12 steps to get out of your hole.","isChecked":false,"level":3,"score":"5"},{"author":"imsair","body":"Very wise words. Dig in moderation, it stops being fun after the dirt disappears.","isChecked":false,"level":3,"score":"4"},{"author":"NewbieWithARuby","body":"People should also dig a hole so they know how hard it is to actually dig a hole.\n\nMy wife and I decided to have a sunken fire pit seating area as they look really nice and we do spend a fair bit of time in the garden. We found a full setup online (bricks, fire place, footing slabs etc) to get delivered and then I looked up the local builders yard to hire a mini-excavator for the day.\n\nShe asked me what I was doing and I told her that our garden is quite clay heavy and I wasn't going to dig a 12ft diametre, 5ft deep hole by hand when I could hire a mini excavator for £80 for a day.\n\nShe literally laughed in my face and said \"it's not that much dirt, you could easily do it\". This went back and forth until we went out into the garden, I measured roughly 2ft square and told her that if she could dig that to 2ft deep I would do it by hand.\n\nShe couldn't even break through the turf so I dug the turf out and then she did maybe 3 half-shovels before proclaiming that I'm an idiot and going back inside.\n\nI felt like a king riding that Bobcat.","isChecked":false,"level":2,"score":"7"},{"author":"theinsanepotato","body":"\"Take a bad kid, make 'em dig holes all day, turns 'em into a good kid. Thats what we do here at camp Greenlake.\"","isChecked":false,"level":2,"score":"7"},{"author":"OhBoyShow","body":"I agree with this. My parents once had a problem in their pipes and had to prove to the government it wasn't on there ground. As the son, I had to dig a 3 meter deep whole. That gave me such a good feeling, I was so impressed with myself.","isChecked":false,"level":2,"score":"30"},{"author":"little_shmink","body":"S T A N L E Y.  Y E L N A T S.","isChecked":false,"level":2,"score":"5"},{"author":"-AAAAAAAAAAAAAAAA-","body":"Go back and play old games you haven't played in years, for me it was the \"robot wants\"  flash game series.","isChecked":true,"level":1,"score":"458"},{"author":"bobagoldenfox3","body":"Right before quarantine, I was over at a friends house and I was able to reconnect with my old Halo squad. Good times","isChecked":false,"level":2,"score":"77"},{"author":"cv-boardgamer","body":"When I was 14, nearly 30 years ago, my cousin and I beat the original Final Fantasy on NES over the summer. It was a fun time and I have lots of good memories about that summer. \n\nRecently I bought one of those Nintendo minis that comes with 30 games. Now that we're in quarantine, I busted it out, and after several sessions of Dr. Mario, I decided to see if I could beat Final Fantasy again. \n\nI started like a week or so ago. My gf (who is a master at Dr. Mario), first would just ignore me and do something else. Finally like 4 days ago, she sat next to me while I was battling ogres outside Elfland, just to see what I was fussing about. She immediately took to it. She busted out her tablet to look up maps, advise me on what spells to purchase, what armor to equip, how to best attack certain enemies, etc. So now we've been on this long quest together trying to collect the 4 orbs. It's been so much fun playing/working on this together, and this game first came out in 1987! (1990 in North America. It is obviously super dated, but still holds up and remains playable and enjoyable). \n\nSo last night we got to the final boss, CHAOS, after an arduous journey through the final temple. He killed my knight immediately with CRACK (forgot to cast the ARUB spell on him), and we were done for after that. We went to bed dejected, but not before buying the HD remaster of FFX, which we're gonna start immediately after we beat CHAOS today after breakfast!\n\nBtw, my cousin that I originally played FF with all those years ago? We were inseparable as kids, best friends. Over the years we drifted apart. I've seen him once in the last 20 years, when we ran into each other at a food truck in 2009. Well yesterday while playing FF, I got an alert on my phone saying that my cousin has just signed up for the House Party app. Guess who will be joining us today via House Party while my gf and I make our 2nd attempt to defeat CHAOS?","isChecked":false,"level":2,"score":"10"},{"author":"Xlcxtrxz","body":"I just did! Played Silent Hill 1-4 again after like 10 years. It was beautiful, nostalgia hits hard.","isChecked":false,"level":2,"score":"4"},{"author":"tinycanofsauce","body":"Think for themselves. Seriously.","isChecked":true,"level":1,"score":"2134"},{"author":"Satanist49","body":"Easier to have the government and/or a religious institution do it for you. /s","isChecked":false,"level":2,"score":"422"},{"author":"coziestlooks","body":"Brave new world basically","isChecked":false,"level":3,"score":"92"},{"author":"Not__A__Furry","body":"NGL, I could go for some soma right about now.","isChecked":false,"level":4,"score":"11"},{"author":"coziestlooks","body":"Fr","isChecked":false,"level":5,"score":"6"},{"author":"matco5376","body":"I think you meant government and/or religious institution and/or reddit","isChecked":false,"level":3,"score":"6"},{"author":"McPiggers","body":"This is the wrong platform to be preaching this lol!","isChecked":false,"level":2,"score":"102"},{"author":"caramelwolf","body":"More like the exact platform that needs it!","isChecked":false,"level":3,"score":"16"},{"author":"Noisycow777","body":"Especially with the reddit hive mind that takes over.","isChecked":false,"level":4,"score":"11"},{"author":"iamprocrastinating93","body":"oKaY buT CoRonA wAs CaUsED By 5g.","isChecked":false,"level":2,"score":"5"},{"author":"morbid_platon","body":"Confront someone who hurt you/ stand up for yourself. It's an incredible feeling, even if the person doesn't  understand what you've gone through. If you have anything left to say to someone, do It! It will be off our mind and you'll feel a hundred pounds lighter.","isChecked":true,"level":1,"score":"654"},{"author":"carlotta4th","body":"After hating arguments/confrontation my entire childhood I'm surprisingly learning as an adult that a bit of anger can be a *good* thing. You stand up for yourself, you state your opinions more solidly... it's not bad to have a bit of confrontation in your life, it actually helps you learn and grow.\n\nNever would have thought it. I saw anger as an irrational thing that just stops people from having reasonable conversations. And yeah, it can still do that if you take it too far--but a *bit* of anger can be quite healthy.","isChecked":false,"level":2,"score":"150"},{"author":"fretka999","body":"Hello, me! I only started to really learn how to utilize anger last year, and you've basically typed my exact thoughts. To me it's like taking a risk. You stand your ground, risk a bit of social harmony, but ultimately get a better outcome. I had to learn how to let people go and accept that you can't always make someone understand. It was all connected in me and I had to dig out all the roots of it to improve myself.","isChecked":false,"level":3,"score":"9"},{"author":"crazycerseicool","body":"I’ve struggled to do this most of my life. I noticed that my work colleagues have trouble discussing financial issues with our clients, but I’ve never had that issue because I don’t consider talking about financial issues a personal attack on the client. Then I realized that explaining to a friend that they crossed a boundary or hurt me in some way is the same thing. I’m not personally attacking my friend, I’m simply trying to improve our friendship. This is a super simplified explanation, but the point is that open, honest and kind communication is nothing to be nervous about.","isChecked":false,"level":2,"score":"12"},{"author":"slumdiggy","body":"Yes!  Huge weight was lifted after I expressed all these feelings I had about my childhood in a letter to my dad a couple years ago.  It didn’t actually change much about our relationship but it changed a lot for me personally.","isChecked":false,"level":2,"score":"9"},{"author":"arkibet","body":"Lol. I did this for the first time and caused it to end a friendship and cause a rift between my entire friend base. I felt better but everyone around me had several weeks of emails and phone calls and we eventually had to separate into two friend groups. This isn’t something I can do easily :(","isChecked":false,"level":2,"score":"6"},{"author":"Garfield_Is_Life","body":"Thanks for the advice, my grandma didn't stand a chance!","isChecked":false,"level":2,"score":"4"},{"author":"survivalothefittest","body":"Go through disappointment, grief, rejection, humiliation, and heartbreak and realize they are still alive and moving forward. Slowly come out of the worst part and start to recover, and learn to stop being afraid of all these things. Start to open up to more things in life.","isChecked":true,"level":1,"score":"1629"},{"author":"besieged_mind","body":"Been all of there and not moving forward, not recovering. \n\nDon't go through all of this if you don't have to, trust me.","isChecked":false,"level":2,"score":"78"},{"author":"jenkinsonfire","body":"I’ve gone through each one of those and hopefully that’ll be it for me. No thanks to any more","isChecked":false,"level":2,"score":"165"},{"author":"survivalothefittest","body":"The point is, everyone goes through all of these. And more than once. That's why knowing you can recover is important.","isChecked":false,"level":3,"score":"50"},{"author":"Taxtro1","body":"No, they don't. Of course you can \"recover\", but only partially. You will be affected by traumatic and humiliating experiences for the rest of your life. To wish others to be humiliated is plain evil.","isChecked":false,"level":4,"score":"15"},{"author":"voodoo-ish","body":"This. I don't get this whole \"get dissapointed, humiliated, beaten and you'll become a better person\" movement.  Probably some Abrahamic thing.","isChecked":false,"level":5,"score":"9"},{"author":"survivalothefittest","body":"It's not about it making you a better person. It's about realizing that you can have all that happen to you and you can live and recover and move on, so you won't be afraid all your life of those things.","isChecked":false,"level":6,"score":"5"},{"author":"TubabuT","body":"“Do not pray for an easy life. Pray for the strength to endure a difficult one.” - Bruce Lee","isChecked":false,"level":3,"score":"8"},{"author":"noiraseac","body":"I love this. I really do feel that most people who come out of these are much wiser compared to those who haven’t. Everyone I met who has experienced these things tend to be such lovely people with the kindest hearts and the wisest minds","isChecked":false,"level":2,"score":"3"},{"author":"GravyxNips","body":"Shut up and listen. You’ll be surprised what you can learn by listening.","isChecked":true,"level":1,"score":"1001"},{"author":"sgtjack86","body":"You’ve got two eyes, two ears and one mouth. Use them accordingly\n\nUnknown source (i.e. I forgot)","isChecked":false,"level":2,"score":"207"},{"author":"dionyziz","body":"> You’ve got two eyes, two ears and one mouth. Use them accordingly\n\n--Epictetus","isChecked":false,"level":3,"score":"124"},{"author":"hextre","body":"Ten fingers my friend. Still don't know what to type.","isChecked":false,"level":4,"score":"4"},{"author":"jamesdeandomino","body":"epico is my bro. along withy marky ori, and the sneaker","isChecked":false,"level":4,"score":"5"},{"author":"HeySolaire","body":"Kinda weird for those of us that are missing parts.","isChecked":false,"level":3,"score":"5"},{"author":"PM_ME_NOTHING_GDAY","body":"You've got two eyes, two ears and no mouth. Tell me Mr. Anderson, what good is a phonecall, if you're unable to speak?","isChecked":false,"level":4,"score":"15"},{"author":"1tacoshort","body":"Nobody ever listened their way out of a job.","isChecked":false,"level":2,"score":"32"},{"author":"throwaway92715","body":"But if everyone shuts up and listens, who speaks?","isChecked":false,"level":2,"score":"6"},{"author":"MrMastodon","body":"Be naked outside somewhere warm. It's pretty neat.","isChecked":true,"level":1,"score":"471"},{"author":"Ani____","body":"I got arrested","isChecked":false,"level":2,"score":"339"},{"author":"DIBE25","body":"Not at the kindergarten","isChecked":false,"level":3,"score":"289"},{"author":"Ani____","body":"oh","isChecked":false,"level":4,"score":"163"},{"author":"DIBE25","body":"Get in the car sir","isChecked":false,"level":5,"score":"68"},{"author":"Atomic0Unicorn","body":"This is a Wendy’s, sir","isChecked":false,"level":6,"score":"8"},{"author":"DIBE25","body":"Get in the van miss","isChecked":false,"level":7,"score":"6"},{"author":"anifail","body":"Was it still pretty neat?","isChecked":false,"level":3,"score":"6"},{"author":"Ani____","body":"yes","isChecked":false,"level":4,"score":"4"},{"author":"tgw1986","body":"also: skinny dipping. \n\ni always thought it was just something people did when they wanted to get up to some hijinks. then one night i wanted to get up to some hijinks and went skinny dipping. fuck does it feel amazing. maybe it’s because i’m a woman and we have to wear more in the way of swimwear, so the boobs definitely felt freer than they ever have (and weightless). but it’s just amazing. it’s like the difference between sex with a condom vs. sex without a condom.","isChecked":false,"level":2,"score":"48"},{"author":"MrMastodon","body":"I went skinny dipping in broad daylight once. Freeing and exhilarating.","isChecked":false,"level":3,"score":"10"},{"author":"PeldaPelda","body":"I tried this once and now I'm not allowed within 500 feet of an elementary school","isChecked":false,"level":2,"score":"17"},{"author":"mickmack321","body":"The struggle is real","isChecked":false,"level":3,"score":"4"},{"author":"brotherdann","body":"Do not. forget. sunscreen.","isChecked":false,"level":2,"score":"8"},{"author":"laurel_lz","body":"I did that on my balcony the first week of social distancing. Feels good.","isChecked":false,"level":2,"score":"5"},{"author":"DrBjarkov","body":"Or somewhere cold. Preferably with a sauna nearby. Streaking through 30 cm of snow and doing a naked dive into a large pile is awesome!","isChecked":false,"level":2,"score":"5"},{"author":"Kikabennet","body":"Travel solo. At least once","isChecked":true,"level":1,"score":"552"},{"author":"BobbyVolcano","body":"I'd rather travel with a Wookie.","isChecked":false,"level":2,"score":"208"},{"author":"CardboardSoyuz","body":"I can arrange that.","isChecked":false,"level":3,"score":"55"},{"author":"HellHathNoFlurry","body":"Traveling solo don't pull people's arms out of their sockets when they're lost.","isChecked":false,"level":3,"score":"8"},{"author":"Stop_CharterSchools","body":"As someone who has traveled extensively alone, I agree.  And to take it further, I recommend doing a long hike alone.","isChecked":false,"level":2,"score":"60"},{"author":"MagicMistoffelees","body":"Agreed, I did a 110km hike by myself and while very mentally difficult, it was super cathartic.","isChecked":false,"level":3,"score":"7"},{"author":"tgw1986","body":"i’d recommend everyone try it. but i’ve done plenty solo, and plenty with others, and i definitely prefer traveling with others. \n\nhere’s why: i firmly believe that absolutely no one ever gives a shit about hearing other people’s travel stories. the only people that engage in them are people who were there. so all the cool things i experienced while traveling solo are things i can never reminisce about with anyone. whereas my travels with others have brought me many lovely trips down memory lane, looking fondly back at the great moments with those close to me. \n\nbut that’s just my experience.","isChecked":false,"level":2,"score":"26"},{"author":"MissLizzyBennet","body":"Experience true, heartbreaking, world stopping grief, and leaning how to live with it. So much gets puts into perspective, and it helps you be more empathetic towards people who have lost.\n\nIf you have never lost someone close to you, then it's hard to describe just how odd it is, or how unhinged you can feel. Your world just ended, how can people be ok with going about their day? Why are people driving, and not crying in the streets? What day is it again? Does it matter? It's been how many days? Have I eaten recently? Does it matter? Does anything matter?\n\nIt also never really goes away, one day I'll be fine, the next, I won't be. It's been almost ten years, still happens.\n\nIf someone is having an obviously bad day, and I don't know them, I can't help but wonder if they're remembering something they can never have again. So you try to be a little kinder, and hope it gets a little easier for them.","isChecked":true,"level":1,"score":"135"},{"author":"TheOminousMoose","body":"This was beautiful. Thank you.","isChecked":false,"level":2,"score":"11"},{"author":"DasHuhn","body":"Last week I had a dream about my grandpa and something we used to do on his farm, called my dad to ask him a question about it and then remembered that he had passed away. It's 4 years at the end of the month.","isChecked":false,"level":2,"score":"11"},{"author":"None","body":"[removed]","isChecked":false,"level":1,"score":"1052"},{"author":"jeanetteroulette","body":"Hydrate!!","isChecked":false,"level":2,"score":"112"},{"author":"Not__A__Furry","body":"Hydrate or diedrate","isChecked":false,"level":3,"score":"10"},{"author":"Kakorat237","body":"One of us.","isChecked":false,"level":2,"score":"70"},{"author":"Back2Bach","body":"Do some volunteer work in your community where you can make a positive difference in the lives of others.","isChecked":false,"level":1,"score":"572"},{"author":"pka4life","body":"Even if you just pick up some trash once and a while","isChecked":false,"level":2,"score":"6"},{"author":"Gerry_Hatrick","body":"Realise how important sleep is, and how much you need.","isChecked":false,"level":1,"score":"339"},{"author":"Thatoneboiwho69","body":"So how much is needed on average?","isChecked":false,"level":2,"score":"7"},{"author":"Tibzz-","body":"6-9 depending on people but some manage with less and some naturally need more","isChecked":false,"level":3,"score":"9"},{"author":"Gerry_Hatrick","body":"People do \"manage\" with less but you're storing up potential trouble for yourself in later life. There are now clear indications between alzheimers and a lifetime of less sleep than recommended, not mention you can even get cancer from not enough sleep, and having worked in mental health, the link between not sleeping and psychosis is beyond doubt.\n\n6-9 hours as stated above, is what you should be aiming for but I'd even suggest maybe 6 isn't enough, 7 at a minimum.","isChecked":false,"level":4,"score":"9"},{"author":"DiamondHeld","body":"Quit a job they hate","isChecked":true,"level":1,"score":"429"},{"author":"empathgirl2","body":"Best thing I ever did!","isChecked":false,"level":2,"score":"49"},{"author":"bloboflifegoo","body":"Me too!","isChecked":false,"level":3,"score":"6"},{"author":"XC_Griff","body":"I worked part time at Target for about a year. Literally one of the most depressing times in my life because I was going to college and working there while also having a girlfriend. I had almost no time to myself to even work out and I was so incredibly depressed. After missing thanksgiving that year to work I submitted my two weeks notice and never went back.\n\nI can say, after that I am so much happier.","isChecked":false,"level":2,"score":"8"},{"author":"flying_pussyfoot","body":"I wish it were that easy","isChecked":false,"level":2,"score":"7"},{"author":"IamThreeToMe","body":"Take a deep breath and chill the fuck out.\n\nEdit: My first award! A thousand thanks!\n\nEdit Part Deux: WOW! 2 more awards! I don’t even know what to say. I’m very appreciative!","isChecked":false,"level":1,"score":"5810"},{"author":"Poem_for_your_sprog","body":"When painful thoughts pervade my mind,  \nAnd strive to stain the space behind -  \n*That life is hard and ends in death -*  \n*That time is short -*  \n\nI take a breath.","isChecked":false,"level":2,"score":"2227"},{"author":"CorkyKribler","body":"Tuck me in Sir, I trust you with the pillows","isChecked":false,"level":3,"score":"302"},{"author":"werecat666","body":"Those aren't pillows.","isChecked":false,"level":4,"score":"93"},{"author":"P0sitive_Outlook","body":"r/TwoSentenceHorror right there!","isChecked":false,"level":5,"score":"12"},{"author":"monkey1811","body":"Will recite before each bong hit. Thank you.","isChecked":false,"level":3,"score":"19"},{"author":"triedfor6years","body":"So I took this “deep breath” that you speak of, now how do I do the chill the fuck out part?","isChecked":false,"level":2,"score":"255"},{"author":"WinterDustDevil","body":"Hold it until have to cough/blackout and exhale the smoke and wait for the head rush","isChecked":false,"level":3,"score":"159"},{"author":"KillerMango11","body":"But then don't cough because you'll get some suspicious looks","isChecked":false,"level":4,"score":"55"},{"author":"WinterDustDevil","body":"😷 Elbow cough 😷","isChecked":false,"level":5,"score":"25"},{"author":"Chonecom","body":"I've heard that hold your breath after a hit doesn't make it any more effective than it already would have been...but I'm not sure on which to believe","isChecked":false,"level":4,"score":"11"},{"author":"WinterDustDevil","body":"I believe \n\nI've always believed\n\nI've believed since that evening in 1973","isChecked":false,"level":5,"score":"11"},{"author":"chewedgum-","body":"This is it","isChecked":false,"level":2,"score":"41"},{"author":"bogidyboy","body":"/r/awardspeechedits","isChecked":false,"level":2,"score":"10"},{"author":"TannedCroissant","body":"Ahh, the simple instructions of how to use a bong.","isChecked":false,"level":2,"score":"45"},{"author":"LordGailish","body":"Chill the fuck out with your edits","isChecked":false,"level":2,"score":"12"},{"author":"The_Real_Stoeptegel","body":"Wish it worked like that","isChecked":false,"level":2,"score":"4"},{"author":"feministicesculptor","body":"Separate from the toxic people in their lives to the maximum extent possible and give their time and energy to themselves and the good people in their lives.","isChecked":false,"level":1,"score":"410"},{"author":"buttonsf","body":"I second this!  This includes people online as well as irl","isChecked":false,"level":2,"score":"14"},{"author":"tgw1986","body":"cutting social media out of my life (even instagram, which i thought was pretty harmless), and no longer engaging with negativity on reddit, have both really improved my mental health so much more than i expected them to. the internet does a number on our psyches, and most of us don’t realize it until we detox. \n\nmy next step is to stop watching trashy reality tv. it’s the entertainment equivalent of junk food, and i know it’s bad for me.","isChecked":false,"level":3,"score":"6"},{"author":"bloboflifegoo","body":"It's sad this comment doesn't have more upvotes. Just tells me people still aren't doing this in their lives or for some reason think it's wrong or selfish to free themselves of toxicity.","isChecked":false,"level":2,"score":"4"},{"author":"nonconformistnugget","body":"Sewing. Super useful skill that’s saved me a lot of money.","isChecked":false,"level":1,"score":"135"},{"author":"greatplains35","body":"Read books","isChecked":false,"level":1,"score":"283"},{"author":"HeftyNugs","body":"The fact this only has 200 upvotes 9 hours later really shows how little people value reading.\n\nHonestly the single best change I've made in my life in the last 6-7 months. For non-fiction reading, you're either learning something or reflecting on something and it's really incredible for personal growth.","isChecked":false,"level":2,"score":"8"},{"author":"KaladinOathbringer","body":"Recommend a book to me :)","isChecked":false,"level":3,"score":"6"},{"author":"HeftyNugs","body":"In any case, I'd recommend some of these:\n\n* The Power of Habit\n\n* Man's Search For Meaning\n\n* Deep Work\n\n* So Good They Can't Ignore You\n\n* How To Win Friends and Influence People\n\n* The 7 Habits of Highly Effective People\n\n* Ego Is The Enemy","isChecked":false,"level":4,"score":"7"},{"author":"HeyKrech","body":"Leave your hometown and travel. Not necessary to travel by air or with a passport (though if you're able, yes please travel to a foreign country). When you travel and meet people, you realize that the world is a beautiful place and you are never truly stuck in a terrible home.","isChecked":false,"level":1,"score":"251"},{"author":"notreal280037","body":"I also say aim for culture shock. Don’t just go to tourist spots. See how the local people live. Get amazed and uncomfortable and see a different perspective.","isChecked":false,"level":2,"score":"86"},{"author":"EmoEnforcer","body":"Off topic story incoming, but when I turned 18 I was supposed to backpack though Europe. I had everything planned to a T, and then I met a boy who said to wait a year and he would come with me. 4 years later I regret waiting for him because he would have been there when I got back. So I guess my advice is don't wait for someone to do anything.","isChecked":false,"level":3,"score":"20"},{"author":"NoviceoftheWorld","body":"\"Travel is fatal to prejudice, bigotry, and narrow-mindedness\"\n\n-Mark Twain","isChecked":false,"level":3,"score":"9"},{"author":"bloboflifegoo","body":"I would go so far as to say actually LIVE somewhere other than your hometown, even if only for a year. Make that place you choose a completely different state or country and a completely different setting. If you grew up near the beach, go live in the mountains. If you grew up in a small town, go live in a big city for awhile. If you grew up in say southern US, go live up north, or vice versa. Not forever, just long enough to really understand why people enjoy that other life so much. Never assume you wouldn't enjoy it because it's unfamiliar to you and never assume you already know what that other place is about because you've \"heard stories\". You'll end up knowing yourself better having detached yourself from the things you might think of as defining you.","isChecked":false,"level":2,"score":"12"},{"author":"HerbOverkill","body":"Take a minute to write down their thoughts and feelings","isChecked":false,"level":1,"score":"165"},{"author":"StructuralFailure","body":"Who on earth only has a minute's worth of thoughts and feelings?","isChecked":false,"level":2,"score":"60"},{"author":"bobagoldenfox3","body":"Ok, then take as much time as you need, good sir. Relax and reflect.","isChecked":false,"level":3,"score":"40"},{"author":"ihellioti","body":"I don’t need a written record of how stupid I feel lately.","isChecked":false,"level":2,"score":"26"},{"author":"urdealerbruh","body":"Whole life for me","isChecked":false,"level":3,"score":"7"},{"author":"ihellioti","body":"Bro, learned I’m getting a divorce right as this shit started. Wife cheated. Been together just shy fifteen years. Married ten. Have a kid. Stuck in quarantine with the person I now consider my ex wife too. I love ittttttt","isChecked":false,"level":4,"score":"7"},{"author":"urdealerbruh","body":"Fuck im sorry bro hope u have it better","isChecked":false,"level":5,"score":"8"},{"author":"palishkoto","body":"Get out of their comfort zone.","isChecked":false,"level":1,"score":"170"},{"author":"mostlysane2020","body":"Love some living being out of their family","isChecked":false,"level":1,"score":"94"},{"author":"SodomyDefenda","body":"Incorrect. I got a girlfriend finally by following your advice but now my wife took my dog and isn't responding to her calls.\nCheers","isChecked":false,"level":2,"score":"52"},{"author":"queenmichele16","body":"Sleep in a comfortable bed with warm covers on a cold day.","isChecked":false,"level":1,"score":"34"},{"author":"LonelyCooks","body":"Travel. Experience other cultures properly and see lots of amazing, beautiful places.","isChecked":false,"level":1,"score":"240"},{"author":"RollingandJabbing","body":"Absolutely, but I sort of dislike how travelling has become a competitive sport in the last little while","isChecked":false,"level":2,"score":"89"},{"author":"suhdude539","body":"God, I hate this so much. It’s like “oh, you took a little weekend road trip? Let me tell you, for the 7th time, about the time I spent 3 months traveling southwest Europe” like we get it, your parents are rich","isChecked":false,"level":3,"score":"90"},{"author":"RollingandJabbing","body":"On dating apps in the UK the amount of ladies whose profiles at literally just \"21 countries. Doing 30 before 30. Fluent in sarcasm\" then get to the next one and it's the same thing with a different number. Going on holiday doesn't equate to a personality","isChecked":false,"level":4,"score":"58"},{"author":"sheepman76","body":"What’s crazy is that this is super common in the US too. It’s expensive as fuck to travel to Europe from the US. \n\nLike yeah, I love to travel too, but I’m poor and I go to places my friends live.","isChecked":false,"level":5,"score":"29"},{"author":"Harpocrates-Marx","body":"The way self-identified travelers talk about traveling is nauseating tbh","isChecked":false,"level":3,"score":"5"},{"author":"spottedmango","body":"Absolutely. Travel to a land where you don’t speak the language and learn about another culture. When you arrive home, you will see things that you took for granted and have new ideas to inspire you for a lifetime.","isChecked":false,"level":2,"score":"15"},{"author":"poopellar","body":"Also, the food.","isChecked":false,"level":3,"score":"10"},{"author":"ThatGuyIsGeneric","body":"Dance if they want to, leave those friends behind, cause their friends don't dance and if they don't dance then they're no friends of mine.","isChecked":false,"level":1,"score":"247"},{"author":"SuddenStand","body":"Delete facebook","isChecked":false,"level":1,"score":"27"},{"author":"roadwobbler","body":"Be born, suffer physical frailties, die; everything else is open.","isChecked":false,"level":1,"score":"422"},{"author":"GravyxNips","body":"Do I need to though?","isChecked":false,"level":2,"score":"69"},{"author":"jdlech","body":"breathe, eat, drink, poop, sleep; or else they will live very short lives.","isChecked":false,"level":2,"score":"46"},{"author":"Abutrug","body":"That reminds me \n\nIF YOU DON'T EAT, YOU DON'T SHIT\n\nIF YOU DON'T SHIT, YOU DIE","isChecked":false,"level":3,"score":"64"},{"author":"Kamisori","body":"I have no bunghole and I must poop","isChecked":false,"level":3,"score":"5"},{"author":"JohnLayman","body":"Actually, we apologize but due to COVID-19, everything else is closed.","isChecked":false,"level":2,"score":"5"},{"author":"Poem_for_your_sprog","body":">\"What is something everyone needs to do in their life?\"\n\nGo do what you want to.  \nGo be who you'll be.  \nBe free to be other.  \nBe free to be free.  \nHave kids,  \nor a wife,  \nor a husband,  \na pet.  \nRemember your past,  \nor just maybe,  \nforget.  \n\nGo do what you're dreaming.  \nGo choose to be true.  \nGo live it for others,  \nor live it for you.  \nHave hopes and ambitions,  \nadventures to roam.  \nAnd get out to travel,  \nor just stay at home.  \n\nGo do what you want to.  \nGo be who'll you be.  \nBe free to be other.  \nBe free to be free.  \nBe him  \nor be her  \nand go do  \nwith good luck.\n\nAs long as you're happy,  \nthen who gives a fuck?","isChecked":false,"level":1,"score":"595"},{"author":"formerexpatintheus","body":"Thank you for the joyful poem today and every other day I catch one. I need to stop giving a fuck about others' opinions.","isChecked":false,"level":2,"score":"46"},{"author":"rlongy","body":">I need to stop giving a fuck about others' opinions.\n\nWell yes, but only to a certain extent, if you don't care about other people's opinions opinions at all your just an asshole, but you shouldn't let others opinions affect how you live either","isChecked":false,"level":3,"score":"10"},{"author":"sanctora10","body":"Visit Auschwitz or any other concentration camp to really understand what humanity is capable of","isChecked":false,"level":1,"score":"23"},{"author":"-eDgAR-","body":"Take a road trip.\n\nGoing across the country in a car, especially with friends, is an experience that everyone should have in their lives.","isChecked":false,"level":1,"score":"66"},{"author":"angeryfluff","body":"If only I had that kind of friends","isChecked":false,"level":2,"score":"7"},{"author":"cutcoronagraph","body":"When you know you've pooped. You felt it. You pushed and pushed then something came out. You know it did. You look in the toilet bowl and see nothing. Puzzled you attempt to wipe in efforts to prove to yourself that you did in fact just poop. You wipe, and the paper/leaf/hand you used to wipe is spotless. Everyone should experience the ghost poo.","isChecked":false,"level":1,"score":"109"},{"author":"1jamster1","body":"Is that not just those weird bubble farts?","isChecked":false,"level":2,"score":"20"},{"author":"mommasandpoppas","body":"Nah, they hide in the hole and you can’t see them.","isChecked":false,"level":3,"score":"5"},{"author":"dothackslash","body":"Tell us more, chief elder","isChecked":false,"level":2,"score":"7"},{"author":"jameslawrence1","body":"Throw your phone away for the day and appreciate your god damn life.","isChecked":false,"level":1,"score":"452"},{"author":"a-ol","body":"It’s honestly crazy how much time of my life I’ve wasted just staring at a screen 😕","isChecked":false,"level":2,"score":"210"},{"author":"02silverado53","body":"Yet here we are, still staring at a screen","isChecked":false,"level":3,"score":"230"},{"author":"GaspodeTheW0nderD0g","body":"Today's the day","isChecked":false,"level":3,"score":"35"},{"author":"nicolulpis","body":"Well... maybe tomorrow so I can start at 00:00","isChecked":false,"level":4,"score":"5"},{"author":"missmiia212","body":"But what if life is boring.","isChecked":false,"level":2,"score":"43"},{"author":"raggedyman84","body":"Is life boring or are you?","isChecked":false,"level":3,"score":"120"},{"author":"Morocco_Bama","body":"Damn..","isChecked":false,"level":4,"score":"36"},{"author":"bobagoldenfox3","body":"Ouch","isChecked":false,"level":4,"score":"21"},{"author":"THEREALCABEZAGRANDE","body":"Both? Hard to be interesting when nothing is interesting to you.","isChecked":false,"level":4,"score":"18"},{"author":"HawkLexTrippJam","body":"Bingo.","isChecked":false,"level":5,"score":"7"},{"author":"bugphotoguy","body":"There was a post the other day, I think a tweet, where a guy was saying you'd be bored af right now without playing video games. Then a reply said basically \"hurdur, I don't play video games, but I get loads of sex instead\".\n\nThey are both boring people. Why would anybody think these are the only two things to do during quarantine? How dull does your life have to be for these to be the only two options?\n\nI've been at home for nearly two weeks, and so far I've done some drawing, painting, played guitar, mandolin, rewrote a Disney song to make it COVID-19 relevant (I'm expecting a DMCA notice for that one), baked cakes and bread, cooked something from the German McDonald's menu, done wood carving, some origami, some chalkboard art, some still life photography.\n\nI don't know how people get through life with so few hobbies. Sex (if you can get it) and gaming are great, but there's so much more to life.","isChecked":false,"level":4,"score":"5"},{"author":"Fiftyset80","body":"r/PhonesAreBad","isChecked":false,"level":2,"score":"27"},{"author":"sk8terd8ter","body":"Work in a face to face customer service job for at  least one week. So, either retail, restaurant or even call center. Then maybe people wouldn’t be such assholes.","isChecked":false,"level":1,"score":"101"},{"author":"1jamster1","body":"Nah some people will see they were treated like shit and then just reciprocate. People are just morons sometimes. Like all those people who cause the same kind of traffic they get stuck in.","isChecked":false,"level":2,"score":"32"},{"author":"Davidlikesmenboys","body":"Idk if I agree with this one. I think the (some) you are referring to is a huge minority. The large majority of people I've worked with in retail would not fucking dare treating others the way they're treated at work. It's disgusting. Also one week is absolutely not long enough as per the original comment. You can easily get a week straight of nice customers. One month during a busy a season like Christmas and oh fucking boy will you get some absolute peaches.","isChecked":false,"level":3,"score":"5"},{"author":"JaneOlberding","body":"Quit a job they hate","isChecked":false,"level":1,"score":"40"},{"author":"iknowthisischeesy","body":"Go to a cliff and scream their lungs out.","isChecked":false,"level":1,"score":"107"},{"author":"SuperCool_Saiyan","body":"Just dont fall","isChecked":false,"level":2,"score":"11"},{"author":"nameless_guy_3983","body":"you are supposed to do it as you fall","isChecked":false,"level":3,"score":"10"},{"author":"IAm12AngryMen","body":"\"I'M GAY^GAY^GAY^GAY!\"","isChecked":false,"level":2,"score":"12"},{"author":"tomtom889","body":"Gliding. No not hang gliding. But gliding in a sailplane, once you release off the tow plane you're kinda at the mercy of the elements to a degree. Better than flying with an engine, and certainly gives you a big adrenaline rush. Visit your local gliding club and have a short flight! You won't regret it.","isChecked":false,"level":1,"score":"17"},{"author":"archimedesismycat","body":"Travel to someplace  with a totally  different  culture  then what you know.","isChecked":false,"level":1,"score":"33"},{"author":"titan-soul","body":"Experience heartbreak.\nI had a friend that always said, \"Everyone deserves to have their heartbroken at least twice, because we almost never learn the first time.\"","isChecked":false,"level":1,"score":"37"},{"author":"goodtimekid","body":"Go to Yosemite National Park. Words fail.","isChecked":false,"level":1,"score":"35"},{"author":"mikio666","body":"Psychedelics","isChecked":false,"level":1,"score":"33"},{"author":"seanmashitoshi","body":"poop.","isChecked":false,"level":1,"score":"137"},{"author":"MaddoxX_1996","body":"Technically, you can go without pooping once in your life","isChecked":false,"level":2,"score":"30"},{"author":"capta1namazing","body":"You can also go without breathing your entire life. Just isn't that long of a life.","isChecked":false,"level":3,"score":"68"},{"author":"ICantThinkOfNameHelp","body":"Reminds me of that one joke, \"Babies born underwater can live their whole lives underwater\"","isChecked":false,"level":4,"score":"26"},{"author":"qquestd0","body":"If you stop eating now, you won’t need to eat for the rest of your life","isChecked":false,"level":4,"score":"5"},{"author":"Lobsterman3411","body":"Go to court for at least one morning or a full day.\n\nYou will be stunned to learn what is going on between the ears of half the people you walk by on the street.\n\nIf you think mankind is pretty fucked, you don't know the half of it.","isChecked":false,"level":1,"score":"49"},{"author":"AllGoldErrythang","body":"Figure out what makes you happy, and fight to do that for the rest of your life.","isChecked":false,"level":1,"score":"16"},{"author":"ChefFaker","body":"Learn a language. I think it's a great way to understand other people and cultures.","isChecked":false,"level":1,"score":"16"},{"author":"destinyplayer1","body":"Go skydiving.","isChecked":false,"level":1,"score":"124"},{"author":"TheLamesterist","body":"One of those days.","isChecked":false,"level":2,"score":"21"},{"author":"gothands06","body":"This was my answer. Just went last November and it was exhilarating. Every instinct in my body said do not jump out of this damn plane and then there I was free falling out of a damn plane. Absolutely amazing, and I will definitely be going again.","isChecked":false,"level":2,"score":"33"},{"author":"destinyplayer1","body":"I went a few years ago. I was very nervous. The day and night before I couldn’t eat or sleep. Once the door opened at 10,500 feet I felt very calm and it was an amazing feeling free falling. I had an adrenaline high for days.","isChecked":false,"level":3,"score":"21"},{"author":"plsnfrd","body":"Agree. Until someone experiences the thrill of free fall followed by the serenity of gliding down they will never know what they are missing.","isChecked":false,"level":2,"score":"5"},{"author":"SinisterCheese","body":"Have a really good wank session.  \nI'm not even fucking joking.  \n\n\nI'm talking about really good \"Explore my body and sexuality, and get comfortable with it\" wank session.  \n\n\nThis world has way too fucking much issues caused by sexual frustration and shame.  \n\n\nHave a drink, have a good wank. Chill the fuck out.","isChecked":false,"level":1,"score":"175"},{"author":"caylyna","body":"See a therapist.","isChecked":false,"level":1,"score":"98"},{"author":"Amandabear323","body":"I think this is really important. You don't have to be on the verge of a mental breakdown to see a therapist. You're life could be going exactly how you want it to and it would still be beneficial to go speak to one. You don't need a long commitment, it is perfectly okay to go only once or twice. A good therapist can teach you how to improve yourself, sometimes in areas you didn't even know you were lacking. They are great at teaching you how to expand and change your way of thinking for the better.","isChecked":false,"level":2,"score":"10"},{"author":"LesPolsfuss","body":"See the Grand Canyon","isChecked":false,"level":1,"score":"28"},{"author":"Stop_CharterSchools","body":"Don’t just drive there! Walk down into it!","isChecked":false,"level":2,"score":"9"},{"author":"SingularEgg","body":"Be comfortable being single and in a relationship","isChecked":false,"level":1,"score":"53"},{"author":"erstwyle","body":"Work a service job at least once.","isChecked":false,"level":1,"score":"69"},{"author":"dragonlady_11","body":"Work in retail/customer service.","isChecked":false,"level":1,"score":"91"},{"author":"BD_TheBeast","body":"Suffer.\n\nThrough suffering, we learn and grow, and learn to appreciate all the times we're not suffering. We become better people so that we can minimize the suffering of others.\n\nAnd no, I'm not religious.","isChecked":false,"level":1,"score":"94"},{"author":"listen_comprehend","body":"This is good, I never suffered growing up. It's very apparent in my older life. Friendless, inexperienced, not creative, etc. Suffering is good for character development. And no, I'm not religious either.","isChecked":false,"level":2,"score":"22"},{"author":"1jamster1","body":"Suffering only helps so much. There is a point where you just become increasingly bitter about everything.","isChecked":false,"level":3,"score":"19"},{"author":"LittleRedLamps","body":"If it's any consolation, I've suffered and I'm also friendless, inexperienced and not creative","isChecked":false,"level":3,"score":"8"},{"author":"silver362","body":"Rather than call it suffering, I'd say experience hardship.\n\nVoluntary hardship especially can make you realise you are a lot stronger and more capable than you probably think, and the biggest thing that holds people back is their mindset. Everyone can benefit from the ability to remain stoic under pressure, and make more rational decisions by keeping negative emotions in check when they need to","isChecked":false,"level":2,"score":"4"},{"author":"Dragon_the_Shut_In","body":"Fall head over heels in love, if only just once. Take the chance of getting hurt by another. Even if the relationship doesn’t work out in the end, you’ll still be grateful for the time you’ve had.","isChecked":false,"level":1,"score":"13"},{"author":"sidd332","body":"Eat a whole cake by yourself.I did it,it was heavenly","isChecked":false,"level":1,"score":"54"},{"author":"colslab","body":"Read fiction from time to time","isChecked":false,"level":1,"score":"24"},{"author":"DRIZZYLMG","body":"Play outside in the mud","isChecked":false,"level":1,"score":"11"},{"author":"octopoddle","body":"Sit and watch the sunset and recognise that the sun is not sinking, and you are on a planet which is revolving away from the sun (poorly worded, but you get my meaning I hope). Knowing what we are (evolved animals) and where we are is an important part of life. Similarly, looking up at the stars and recognising that you're not looking up, you're looking out.","isChecked":false,"level":1,"score":"9"},{"author":"chassidy97","body":"Go to a concert or any live music event","isChecked":false,"level":1,"score":"11"},{"author":"crappy_guitarist","body":"Learn to play an instrument. I'm a 37yo guy and I don't generally show my feelings. I find that I channel those feelings through my music.","isChecked":false,"level":1,"score":"9"},{"author":"jonpberg","body":"Stay the hell home","isChecked":false,"level":1,"score":"42"},{"author":"NerdManTheNerd","body":"Be loved. Romantically, platonically, parentally, brotherly, whatever way they're comfortable with. Being loved is a damn special thing.","isChecked":false,"level":1,"score":"37"},{"author":"bakuLa26","body":"Technically, everyone cannot really be loved in all the ways you mention. Some people come with broken families or worse, no families. So maybe one can find enough people to love each one in these many ways.","isChecked":false,"level":2,"score":"11"},{"author":"NerdManTheNerd","body":"There are friends like brothers and mentors like parents.","isChecked":false,"level":3,"score":"7"},{"author":"DIBE25","body":"can anybody find me somebody to love?","isChecked":false,"level":2,"score":"8"},{"author":"Twat_In_Hells_Chance","body":"Work in retail for three months, over Christmas.","isChecked":false,"level":1,"score":"28"},{"author":"Stevemetz38","body":"Learn how to think critically based on facts rather than blindly following emotion or popular belief","isChecked":false,"level":1,"score":"18"},{"author":"LowPopopol","body":"Go to a concert of their favorite artist(s)","isChecked":false,"level":1,"score":"9"},{"author":"BoobsRmadeforboobing","body":"_apparently_ my ex","isChecked":false,"level":1,"score":"8"},{"author":"musecalliope2000","body":"Live in another country. You understand the world from a completely different standpoint when you have to learn local customs, structures (government, healthcare, housing, transportation, etc), and languages. It helps you understand all sorts of things that armchair experts think they know a lot about, but without the discomfort of a totally different lived experience, it's hard to truly understand a completely different existence.","isChecked":false,"level":1,"score":"10"},{"author":"fakefromjakestarm","body":"Fail. Some of life's biggest lessons come from failures; it's during those times where we change and grow the most.","isChecked":false,"level":1,"score":"9"},{"author":"Babygirl9426","body":"Become happy with themselves","isChecked":false,"level":1,"score":"40"},{"author":"Creative_Recover","body":"1. Do a minimum wage job, it makes you appreciate key workers low down on the chain.\n2. Visit other countries, seeing how other people live and experiencing their culture. \n3. Set some boundaries down between yourself, your work and certain people in your life. \n4. Look after your teeth, health and skin; original teeth are always superior to false ones, prevention is better than cure and no amount of creams will undo a lifetime of neglecting to protect your skin from the sun.\n5. Put aside money for a pension.","isChecked":false,"level":1,"score":"29"},{"author":"totallynotademogorge","body":"Go on a long hike. It really helps to put in perspective how small our problems are when we see how small we are in this great big world. The mental therapy is also a nice bonus.","isChecked":false,"level":1,"score":"8"},{"author":"_dezasterz0_","body":"Ride a rollercoaster or an amusement park ride that scares you. \n\nYou never have to try it again if you dislike the experience but you also get the validation of conquering something that looks conventionally scary and intimidating.","isChecked":false,"level":1,"score":"8"},{"author":"moskvausa","body":"These are the things one must accomplish in their lifetime.  Not master them, but at least give it a college try (not in order of importance):\n\n1. Learn how to cook\n2. Learn how to play a musical instrument\n3. Become a good lover\n4. Learn a foreign language \n5. Learn to drive a manual transmission\n\nThe basic five.  Have fun.","isChecked":false,"level":1,"score":"9"},{"author":"CatsInTrenchCoat","body":"Budget. Know how to spend money, and stretch a dollar. Sometimes it won’t be enough, but trying to put even a few dollars away every little while can save your butt.","isChecked":false,"level":1,"score":"8"},{"author":"SharpShotLFCFan","body":"Sail the ocean.","isChecked":false,"level":1,"score":"16"},{"author":"-booper-","body":"Another person","isChecked":false,"level":1,"score":"22"},{"author":"carpenter1965","body":"fall in love","isChecked":false,"level":1,"score":"15"},{"author":"TonyaSchwarz","body":"To wait for happiness, you have to stop waiting for it.","isChecked":false,"level":1,"score":"6"},{"author":"joseefsharif","body":"Go out in the world and live in a place completely unlike the place you are from.","isChecked":false,"level":1,"score":"7"},{"author":"goodsy","body":"Make music.","isChecked":false,"level":1,"score":"26"},{"author":"LukasDekanozishvili","body":"This post was made by FL gang","isChecked":false,"level":2,"score":"8"},{"author":"timlafich","body":"Learn to not give a fuck","isChecked":false,"level":1,"score":"20"},{"author":"eldritch_candy","body":"Find meaning in it.","isChecked":false,"level":1,"score":"19"},{"author":"SnooozerName","body":"Shrooms","isChecked":false,"level":1,"score":"89"},{"author":"Submarine_Pirate","body":"Came here to say that. My very first take away from doing shrooms the first time was that every person on earth needed to try them.","isChecked":false,"level":2,"score":"33"},{"author":"Smol_swol","body":"Please elaborate.","isChecked":false,"level":3,"score":"6"},{"author":"Submarine_Pirate","body":"When you’re sober only a small part of who you are is really present and vocal in your subconscious, your current mental manifestation of your self, “the narrator of your thoughts”, but when you do mushrooms all of your self constructed and subconscious mental barriers melt away and you’re 100% there. It’s like sitting down to speak with your own soul. \n\nYou understand empathy, insecurity, fear, and love in such a raw way that issues you’ve been hung up on unable to resolve for years all of a sudden seem as simple as closing a door.","isChecked":false,"level":4,"score":"41"},{"author":"Morocco_Bama","body":"I'm nervous as hell about having a bad trip, though.","isChecked":false,"level":5,"score":"11"},{"author":"Submarine_Pirate","body":"It’s a possibility. A bad trip will be the worst weeks of your life (it will be hours but it will feel like weeks), and you’ll think about it daily for months afterwards. But bad trip’s can be the most important, think of them as surgery to remove a tumor. It’s going to be painful but in the end you’ll feel more cathartic than you have in your entire life. It’s literally facing your demons. \n\nI had a bad trip where I was sprawled out on the floor in the bottom of a very deep dark pit, the only light was a pin prick 300 ft above me. Every mistake I’d ever made in a close relationship washed over me, I felt every time I’d been mean to my younger siblings growing up, every time I’d disappointed my parents for no reason other than to rebel, every time I’d lead a girl on because I wanted attention and sex but wasn’t actually romantically interested in them, I felt the damage I was doing to myself by putting pressure to achieve arbitrary goals that weren’t my own or anyone else’s just what I thought I was supposed to do. I cried in that hole alone for what felt like weeks. \n\nBut when it was over I felt.... clean if that makes sense? No regret, no anxiety, no hesitation. I knew my self better, I understood my own actions and feelings and that made me a better person. \n\nObviously eventually the tangibility of reality pulls you back and you get back to normal, but I find stepping out of reality every once in awhile makes you appreciate it more. Shrooms aren’t like weed/coke/booze where once you sober up you’re like “fuck yeah let’s get fucked up again tomorrow” it’s something that sits with you and you ponder on. The one time I did a heroic dose (+5g’s) I didn’t touch psychedelics for almost 2 years, I’d learned what I needed to.","isChecked":false,"level":6,"score":"17"},{"author":"suhani_Pawar","body":"Help others in need.","isChecked":false,"level":1,"score":"7"},{"author":"macmooie","body":"Be happy - how to: have something to do, have something to look fwd to, have something to be proud of.","isChecked":false,"level":1,"score":"7"},{"author":"pjpfield","body":"Fall in love and make a legitimate connection with their significant other","isChecked":false,"level":1,"score":"6"},{"author":"Lykablyat","body":"Get out of your comfort zone to understand others. Can't understand why people like playing video games? Try one. Trying to figure out why so many people like that book? Read it. Thinking to yourself why that one singer has so many followers? Listen to their songs. Your friend won't stop talking about that restaurant down the street? Have a lunch. \n\nWhen you get out of your comfort zone and start experiencing life through someone else's eyes, you realize how much you are missing out on life.","isChecked":false,"level":1,"score":"5"},{"author":"actually_ru","body":"stay the fuck inside for like the next month","isChecked":false,"level":1,"score":"7"},{"author":"ezillatsyrk","body":"Talk to a homeless person. Listen to their story.","isChecked":false,"level":1,"score":"18"},{"author":"Grand-Muffin","body":"Study the Holocaust in-depth. To avoid repeating history it’s important to have an understanding of what can happens when people decide that certain other groups of people are not fully human.","isChecked":false,"level":1,"score":"20"},{"author":"nietzschesoptimism","body":"Volunteer once a week at a hospital/shelter/school for a few months. Truly is a life changer.","isChecked":false,"level":1,"score":"15"},{"author":"fullmoonbloom","body":"DMT","isChecked":false,"level":1,"score":"22"},{"author":"ruburbi","body":"Psychedelics","isChecked":false,"level":1,"score":"22"},{"author":"NoLongerReddits","body":"Floss","isChecked":false,"level":1,"score":"5"},{"author":"TheFoodHobbyist","body":"Go to therapy.","isChecked":false,"level":1,"score":"5"},{"author":"randomlycandy","body":"Take care of their teeth!","isChecked":false,"level":1,"score":"5"},{"author":"TwistedImprint","body":"Sit outside during the sunrise and just appreciate what is around you. No technology or anything.","isChecked":false,"level":1,"score":"4"},{"author":"buttonsf","body":"Make a bucket list, and work toward completing it!\n\nDo everything at least once, twice if you're not sure you liked it the first time.\n\nDon't be afraid to say \"no\".  You don't have to greet people with a hug or kiss if you don't want to and NEVER EVER make your children do it.  Teach consent early; toddlers can understand they have body autonomy.\n\nCompliment strangers.  It feels weird at first but it gets easier, and you can learn so much about people! \n\nDon't be afraid to tell old people to FO.  Not all old people deserve our respect.","isChecked":false,"level":1,"score":"5"},{"author":"Ali_cAt1","body":"Learn to love yourself. Life is too short to hate the only person you will be with for life.","isChecked":false,"level":1,"score":"6"},{"author":"HmBread","body":"Go backpacking at least once. Its such a great experience, and it makes you think about the environment a little more","isChecked":false,"level":1,"score":"5"},{"author":"softserve-4","body":"2 things, climb a mountain, and swim in the ocean","isChecked":false,"level":1,"score":"4"},{"author":"whendidisaythat","body":"Stay home","isChecked":false,"level":1,"score":"9"},{"author":"djbturtlefan","body":"Understand that the answers we seek are inside of us not outside of us.","isChecked":false,"level":1,"score":"9"},{"author":"ramtax666","body":"This is a very misunderstood questions I see. \n\n\nI believe everyone should clime a mountain and spend a night there under the stars thinking how small we are in the universe and if truly matters if that idiot cut me of in traffic. I a truly unique way of achieving the calm needed to find him and cutting his brake lines.","isChecked":false,"level":1,"score":"31"},{"author":"poopellar","body":"I usually do that when I'm in bed trying to sleep.","isChecked":false,"level":2,"score":"4"},{"author":"OhBoyShow","body":"You live on a mountain?","isChecked":false,"level":3,"score":"6"},{"author":"death2escape","body":"Stand in front of the mirror and say “I love you” until you believe it","isChecked":false,"level":1,"score":"23"},{"author":"1luckyarcher","body":"Well I don't have that much time.","isChecked":false,"level":2,"score":"8"},{"author":"tonyngai","body":"Shave their head","isChecked":false,"level":1,"score":"14"},{"author":"KnoxSHickman","body":"One day with absolutely no worries. I mean a day where you have no discomforts, no obligations, no thoughts about bills, the mortgage, student loans or anything else. A day where no one expects anything from you, no one is entitled to your time, and you owe nobody anything. You are absolutely free and unencumbered and are simply just existing and can do whatever you want.\n\nI don't mean a vacation where you put these things out of mind for a while. I mean a day where these things don't exist.\n\nChildhood doesn't count because you are too young to appreciate this. I mean a day absolutely free where you can appreciate it.\n\nThat would be living the dream.","isChecked":false,"level":1,"score":"4"},{"author":"tonperebb","body":"Verify something before sharing it across your social circle.","isChecked":false,"level":1,"score":"3"},{"author":"KemperDelToro","body":"See a space shuttle launch at night","isChecked":false,"level":1,"score":"4"},{"author":"HauseofStorm","body":"Travel. Even if you can’t afford to travel out of state or out of the country, just go somewhere else besides your daily commutes. See something other than your daily scenes.","isChecked":false,"level":1,"score":"4"},{"author":"Pkpkpkpk_","body":"Chill the fuck out.","isChecked":false,"level":1,"score":"3"},{"author":"DaniloAlimo","body":"Make mistakes , that's a good lesson to learn how to make decisions , and not just the one that is most comfortable but the ones that could make u suffer !","isChecked":false,"level":1,"score":"5"},{"author":"lightd93","body":"Travel to another country. Preferably to another continent. It can be very eye opening seeing other people’s cultures and how they live day to day.","isChecked":false,"level":1,"score":"5"},{"author":"Ali_cAt1","body":"Learn to love yourself. Life is too short to hate the only person you will be with for life.","isChecked":false,"level":1,"score":"4"},{"author":"Alexande3rd-of-Pella","body":"Everyone needs to just sit down, and at the least, try to write a book, poem, or something. Even if you aren’t confident in the idea, others may be inspired or do something even greater with it. Everyone has a song or a story in them.","isChecked":false,"level":1,"score":"5"},{"author":"LoqtTheCock","body":"Learn a language. It makes you so much more aware of others cultures and customs, and its actually fun as hell to do. you also learn a lit more about you’re own language and instead of constantly saying “I’m bored” you can say “Well, I might as well study some french!”","isChecked":false,"level":1,"score":"4"},{"author":"danlab69","body":"Forgive yourself.","isChecked":false,"level":1,"score":"4"},{"author":"dixiepicnic","body":"Take a long hike with friends and spend the night outdoors.","isChecked":false,"level":1,"score":"4"},{"author":"crumbs2k12","body":"Don't be afraid to fail to come back even stronger If you truly want to do that thing in life","isChecked":false,"level":1,"score":"4"},{"author":"Tired_Mammal444","body":"Learn from their mistakes.","isChecked":false,"level":1,"score":"4"},{"author":"jkandpoo","body":"Be grateful.","isChecked":false,"level":1,"score":"3"},{"author":"reddNOOB2016","body":"Art.","isChecked":false,"level":1,"score":"4"}],"id":"fus0ib","submissionData":{"author":"watwolves8855","body":"","score":"17137","subreddit":"AskReddit","title":"What is something everyone needs to do in their life?"},"url":"https://www.reddit.com/r/AskReddit/comments/fus0ib/what_is_something_everyone_needs_to_do_in_their/"}