{"commentsData":[{"author":"xfearthehiddenx","body":"• Stayed in bed for a couple of decades while his daughter single handedly provided for 4 elderly individuals, and a child (who later also applies his income to the house).\n\n• still bought tobacco despite not providing any income, or helping. \n\n• complained about the only food his family could afford despite not providing any income, or helping. \n\n• manages to get up to buy a bar of chocolate, and tobacco. But not have a job.\n\n• jumps out of bed like a miracle as soon as his grandson wins the golden ticket, and dances like a stage show. While claiming he hasn't stood in 20 years. \n\n• assumes charlie is taking him, and not... oh idk... his mother maybe.\n\n• sings \"I have a golden ticket\" song as if *he's* the one that won it. - u/eviloverlord1662\n\n• leaves the other three elderly individuals to be cared for whilst he, and his grandson go on a fun filled adventure. Never once mentioning them again. - u/tuesdayswhispers\n\n• tells charlie to sign a legal document despite being underage.\n\n• sexually assaults a woman in a locked room full of people - u/Casimir_III\n\n• convinces Charlie to steal an unfinished prototype product that almost gets him killed.\n\n• tells charlie that they'll sell the gobstopper since Wonka won't give him the prize. \n\n• has coke nails. - u/Boingo0220\n\n• possibility of social security yet still poor enough to need Charlie's income. (What was he blowing it on?) - u/olde_greg\n\nI'm sure I missed something. Will update if anyone can think of something else. Also join us on r/grandpajoehate.\n\nHello all. To anyone coming late I hope you've enjoyed the list. I've tried to keep them in order of occurence. I'm still adding as I get more. So if you know of something don't be afraid to say it. I'd also like to thank everyone who commented to add something. You've helped make this a great grandpa joe shit post. I think this is my most upvoted comment.","isChecked":true,"level":1,"score":"1126"},{"author":"Wwollof","body":"This is a very robust account thankyou. I am starting to hate Grandpa Joe now.","isChecked":true,"level":2,"score":"348"},{"author":"xfearthehiddenx","body":"One of us. r/grandpajoehate","isChecked":true,"level":3,"score":"221"},{"author":"jayenn77","body":"im dead, there's really a subreddit for that","isChecked":false,"level":4,"score":"54"},{"author":"catboobpuppyfuck","body":"You know who should be dead? Grandpa Joe for his numerous crimes against humanity. That twisted fuck drank fizzy lifting drink so he could spread coronavirus through the entire factory’s ventilation system. The Oopma-Loompas didn’t stand a fucking chance.","isChecked":false,"level":5,"score":"73"},{"author":"T00Bytoon","body":"Grandpa Joe is the Grelod the Kind of Roald Dahl books","isChecked":false,"level":6,"score":"10"},{"author":"goatjugsoup","body":"worse than the twits?","isChecked":false,"level":7,"score":"1"},{"author":"rustydomino","body":"Subscribed to this Mecca of awesomeness. Fuck grandpa Joe.","isChecked":false,"level":4,"score":"26"},{"author":"QuarkySisko","body":"Yes, join us","isChecked":false,"level":4,"score":"11"},{"author":"Bee_Rye85","body":"Good, good, let the hate flow through you.","isChecked":false,"level":3,"score":"33"},{"author":"cappilla","body":"Lol","isChecked":false,"level":3,"score":"3"},{"author":"ACrispyPieceOfBacon","body":"You have seen the light.","isChecked":false,"level":3,"score":"2"},{"author":"BondraP","body":"Grandpa Joe can eat a big fat dick","isChecked":false,"level":3,"score":"2"},{"author":"Ohwellslateon","body":"And then choke to death on it.","isChecked":false,"level":4,"score":"1"},{"author":"cheechuu","body":"Do you know what robust means ? :)","isChecked":false,"level":3,"score":"0"},{"author":"Boingo0220","body":"- Coke nails.","isChecked":false,"level":2,"score":"40"},{"author":"xfearthehiddenx","body":"Added.","isChecked":false,"level":3,"score":"11"},{"author":"False-Understanding","body":"What’s that?","isChecked":false,"level":3,"score":"6"},{"author":"dwillphx","body":"When you let one of your nails grow out (usually the pinky one) so you can scoop out a bump of coke and snort it. (think this was a 70s thing)","isChecked":false,"level":4,"score":"30"},{"author":"Meanwhile-in-Paris","body":"Wait, What?!! I suddenly see my uncle under a very different light...  And I believed him when he said it was to play guitar....","isChecked":false,"level":5,"score":"15"},{"author":"PapaBradford","body":"A coke nail was traditionally just the pinky, if your uncle had most or all of his nails long, he probably didn't do a lot of coke. Also, as someone else said, it was more of a 70's-80's thing","isChecked":false,"level":6,"score":"7"},{"author":"IWasSayingBoourner","body":"I saw a lot of it in the early-mid 2000s for some reason, which was weird because I didn't roll with that crowd at all.","isChecked":false,"level":7,"score":"3"},{"author":"Meanwhile-in-Paris","body":"The time frame checks out. That wouldn’t surprises me after all, what surprises me more is my naivety...","isChecked":false,"level":7,"score":"1"},{"author":"PhenibutNumber1Fan","body":"Fingerpickers absolutely grow their nails out. He might not have been lying.","isChecked":false,"level":6,"score":"5"},{"author":"DwarfTheMike","body":"Was it just one or two fingers or all of them on the right hand?","isChecked":false,"level":6,"score":"4"},{"author":"Meanwhile-in-Paris","body":"I am pretty sure it was just his pinky. But the more I try to recall, the more I think he could have had others. It’s a distant memory... but he was was in his 20’s in the 70’s. That’s would not be out of character for him.","isChecked":false,"level":7,"score":"1"},{"author":"False-Understanding","body":"Thanks for enlightening me haha","isChecked":false,"level":5,"score":"3"},{"author":"KingInky13","body":"Also started WWII.\n\nEdit: shit, sorry, that was Hitler. I'm always getting those two mixed up.","isChecked":false,"level":2,"score":"74"},{"author":"drm38r","body":"You do that too? Good to know I’m not the only one.","isChecked":false,"level":3,"score":"12"},{"author":"KCMahomes1738","body":"This is a great breakdown.   He really was a piece of shit.","isChecked":false,"level":2,"score":"18"},{"author":"cappilla","body":"Yeah after reading all of that I'm starting to feel the same way.","isChecked":false,"level":3,"score":"3"},{"author":"Ludwig_Von_Koopa1","body":"Kind of makes me wonder if the other 3 grandparents weren't faking it too.","isChecked":false,"level":2,"score":"15"},{"author":"cappilla","body":"So did it ever explain why they were bedridden?","isChecked":false,"level":3,"score":"8"},{"author":"omnilynx","body":"Just old. It was pretty common back in the day to live with a bedridden grandparent since nursing homes weren’t so much of a thing. That Charlie lived with *all four* was just an exaggerated way for Mr. Dahl to show how bad things were for the family.","isChecked":false,"level":4,"score":"3"},{"author":"SabreSnick","body":"It's a plot point in the sequel book that they refuse to get out of bed for any reason, even though they may be physically capable. It literally takes going to space and turning off the gravity for them to float out.","isChecked":false,"level":4,"score":"1"},{"author":"pretzel_nuggets","body":"I always wondered how the hell he jumped out of bed after being bed bound for 20 years. And no bedsores? Whos turning all of them every 2 hours? Do they poop in the bed and all r of them have to roll to get it changed? Too many inconsistencies.","isChecked":false,"level":2,"score":"15"},{"author":"eviloverlord1662","body":"Remember the song \"*I* have a golden ticket\"? Yeah, it wasn't Charlie singing that.","isChecked":false,"level":2,"score":"13"},{"author":"xfearthehiddenx","body":"Added","isChecked":false,"level":3,"score":"2"},{"author":"phoenix7raqs","body":"Most of that is not in the book.  Out of COVID 19 boredom, I just read it.  I haven’t seen the movie (original not the remake) in decades.","isChecked":false,"level":2,"score":"8"},{"author":"xfearthehiddenx","body":"Sorry. Going by the movie for this info. Grandpa joe is a little different in each  instance.","isChecked":false,"level":3,"score":"5"},{"author":"cappilla","body":"Wow bud after reading all of that I may have to reconsider my thoughts on the matter.\n(Oh and I never realized he had \"coke nails\" lol)","isChecked":false,"level":2,"score":"7"},{"author":"tuesdayswhispers","body":"I found it hilarious the way he immediately ditched the other 3 grandparents and didn’t mention them again","isChecked":false,"level":2,"score":"8"},{"author":"xfearthehiddenx","body":"Added","isChecked":false,"level":3,"score":"2"},{"author":"IWasSayingBoourner","body":"If you do the math, he claims he hasn't walked since before WW2, so he's probably a draft dodger too.","isChecked":false,"level":2,"score":"6"},{"author":"xfearthehiddenx","body":"Unfortunately its difficult to know the exact time, and location of the movies, and book. As it is never stated outright. However the original movie is film in Munich. Which is in germany. So it's very possible he was in the war.... or working a camp. Who knows.","isChecked":false,"level":3,"score":"2"},{"author":"Casimir_III","body":"He also groped Mrs. Teevee","isChecked":false,"level":2,"score":"6"},{"author":"xfearthehiddenx","body":"Added","isChecked":false,"level":3,"score":"1"},{"author":"Multitrak","body":"Came here to say \"Moocher\", but this takes the cake!","isChecked":false,"level":2,"score":"4"},{"author":"olde_greg","body":"Is it possible he was getting social security? Actually with 4 grandparents and the average check being $1300 that’s $5200 in income per month, though this would have to be adjusted to 1970 numbers","isChecked":false,"level":2,"score":"11"},{"author":"xfearthehiddenx","body":"Even at 1970s numbers they shouldn't have been struggling to get by on pea soup, and bread Charlie scrounged his pay to get. But I'll add it.","isChecked":false,"level":3,"score":"13"},{"author":"KnockMeYourLobes","body":"Did they even HAVE whatever the English version of Social Security was back then?","isChecked":false,"level":3,"score":"8"},{"author":"xfearthehiddenx","body":"It's never specifically stated where they live. Could be the USA. Could be the UK. Could be somewhere else, or a fictional place.","isChecked":false,"level":4,"score":"3"},{"author":"KnockMeYourLobes","body":"True. Reading the books and watching the first movie (not that awful Johnny Depp remake, seriously wtf was that?), I got the feeling they lived in/near London.","isChecked":false,"level":5,"score":"10"},{"author":"xfearthehiddenx","body":"Well according to the book. Charlie's first chocolate bar was paid for with a dollar as opposed to a euro. And the movie was filmed in Munich which is Germany.","isChecked":false,"level":6,"score":"10"},{"author":"OcotilloWells","body":"The elevator at the end is flying over Nördlingen in Germany. \n\nFun fact: it is in the middle of a meteor crater.","isChecked":false,"level":7,"score":"10"},{"author":"Itxi","body":"Britain doesn't use Euros.\n\nThe original had Charlie buy the chocolate with a 50p piece he found, it's only in the American version he pays with a dollar","isChecked":false,"level":7,"score":"3"},{"author":"MyPigWaddles","body":"Wait, is there an American version of the *book?* Like a Harry Potter and the Sorcerer's Stone situation?","isChecked":false,"level":8,"score":"2"},{"author":"cappilla","body":"If so then why were they so poor?","isChecked":false,"level":3,"score":"7"},{"author":"olde_greg","body":"Because the selfish ass grandparents were hiding the money from the parents and Charlie. Charlie was naive and nice enough to deposit their checks every week without questioning it.","isChecked":false,"level":4,"score":"10"},{"author":"cappilla","body":"Is that just an assumption?","isChecked":false,"level":5,"score":"3"},{"author":"olde_greg","body":"Well yeah, but it explains why he could afford smokes.","isChecked":false,"level":6,"score":"9"},{"author":"xfearthehiddenx","body":"Charlie gave him tobacco money in the movie. If he got social security he was hoarding it.","isChecked":false,"level":7,"score":"5"},{"author":"olde_greg","body":"Probably, I'm just piling on with the grandpa joe hate, wouldn't surprise me if he had income he wasn't telling the family about","isChecked":false,"level":8,"score":"5"},{"author":"cappilla","body":"I guess","isChecked":false,"level":7,"score":"1"},{"author":"golden_fli","body":"Even if you go by the US it was published in 1964. If Joe hadn't walked, and therefore worked, in 20 years that would have basically been since 1944(possibly longer since he worked). If you go by that he PROBABLY wouldn't have been eligible for Social Security.","isChecked":false,"level":3,"score":"2"},{"author":"crazycatlady331","body":"IIRC it was not set in the US.","isChecked":false,"level":3,"score":"1"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"1"},{"author":"xfearthehiddenx","body":"Theres also some question as to where/when they actually are in the movie. Given both movies, as well as the book all seem to take place in different times, and places.","isChecked":false,"level":3,"score":"1"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"1"},{"author":"xfearthehiddenx","body":"I added it as a possibly because there is no definitive answer regarding where, or when the movies, and book take place. It is also possible that social security is not a thing for them.","isChecked":false,"level":3,"score":"1"},{"author":"bunny_place","body":"fuck that cunt","isChecked":false,"level":2,"score":"1"},{"author":"psu777","body":"All the things I never thought about!  Thanks!.....I think","isChecked":false,"level":2,"score":"1"},{"author":"BMG1976","body":"this wins the internet for today","isChecked":false,"level":2,"score":"1"},{"author":"Baxter_Pro","body":"That sums it up, thank you","isChecked":false,"level":2,"score":"1"},{"author":"eddmario","body":"Did you ever consider that he had untreated or undiagnosed depression? It would explain how he got happy all of a sudden.  \n\nAnd the whole golden ticket song could have been a metaphor for the whole family...","isChecked":false,"level":2,"score":"1"},{"author":"AncientLineage","body":"Wow that’s a great sub. Joined","isChecked":false,"level":2,"score":"1"},{"author":"Vegan-Kirk","body":"Damn brother. I'd give you an award but I would never purchase coins lmao. This comment is fuckin gold","isChecked":false,"level":2,"score":"0"},{"author":"xfearthehiddenx","body":"Thanks.","isChecked":false,"level":3,"score":"1"},{"author":"Djrhskr","body":"You forgot to say that he is a free loathing piece of shit shated out of a mans anus who killed his mother at 2 and then set up to rape hitler's mother who guess where she was 9 months later? God, I hate that cabbage eater piece of shit","isChecked":false,"level":2,"score":"-6"},{"author":"xfearthehiddenx","body":"Trying to stick to canon. But thank you for the input.","isChecked":false,"level":3,"score":"6"},{"author":"slpyboi","body":"He’s a fuckin bum. The dude can’t help out around the house, can’t help with bills, can’t work. But as soon as he gets invited to the chocolate factory he jumps up, healthy as f ready to go.","isChecked":true,"level":1,"score":"215"},{"author":"cappilla","body":"\"He's a fuckin bum\" hahaha OMG that's hilarious. You cracked me up and made my day dude so thank you for that. With the way I've been feeling lately it's good to have a good laugh.","isChecked":false,"level":2,"score":"21"},{"author":"Invisiblethespian","body":"Benefit fraud is a hell of a crime.","isChecked":false,"level":2,"score":"43"},{"author":"golden_fli","body":"Invited? No, HE invited himself. Dude's an even bigger dick then you're giving him credit for lol.","isChecked":false,"level":2,"score":"9"},{"author":"cjcs","body":"Wouldn’t he be getting social security? That might help a bit with bills.","isChecked":false,"level":2,"score":"1"},{"author":"4AcidRayne","body":"I, very much, feel like Charlie's mother and I feel that way quite often. My uncle is, in every way, Joe. \n\nI do everything for my uncle. When it's time for food, I cook it and deliver it to him as if he were royalty. He doesn't even walk to the table; he feasts at his chair while watching TV. When it's time for laundry I collect the dirty laundry, wash it, and deliver it. When it's time to do all the chores, I do them alone. When it's time to go get groceries I do it by my damn self even though I'm walking around on surgically reconstructed feet and have never taken a step that wasn't painful. \n\nI \n\nDo\n\nEverything\n\nThe only tasks he does for himself are eating my food, watching TV, sleeping, and wiping his own ass. That last one, there's a day coming when that's my job too. Yet, on Sundays (prior to the COVID shutdown) he'd be up and dressed ready to go to church at 0900. He's \"too tired\" to do anything else, but he's sure as hell got the energy to do something he wants to do. I've never known him to lack enthusiasm or energy to go socialize at church. \n\nJoe laid on his lazy worthless ass and let Charlie's mom slave away to do everything necessary to keep him alive, riding the story of being bedridden along with the others. Oh, but there's somethin' ***fun to do***? Well shit, up and at 'em, let's sing and dance and prance around with the ease of a ballet dancer. \n\nI totally get the rage behind everyone who hates the worthless ol' bastard, because I (and a few others) are intimately familiar with the life his long-term ruse put Charlie's mom through. \n\nFurther, I'd wager that ol' Joe did just like my uncle does every Sunday; once all the fun is done, it's back to \"tired mode\" when everything becomes my job again. As soon as they got back from the adventure, Joe likely slid right back into his bed clothes, slid under the covers, and reverted back to doing nothing and letting Charlie's mother do everything for him again. Get back into pitiable mode to keep the guilt trip going. \n\nIs there any reason people *wouldn't* hate him? He perpetuated a 20+ year ***lie*** that practically enslaved Charlie's mom. When his lie began, she was likely a vibrant young woman, but his lazy lie kept her there until the vibrancy was gone. I suspect that if she'd left there'd be nobody to look after them, so the weight of her obligation wasn't one she could easily shake off. \n\nIs there ***anything*** to like about someone who uses a perpetual guilt trip to keep someone under their control under false pretenses? If you're healthy enough to go prancing around and trotting off to go tour a factory, by god you're healthy enough to get off your worthless ass and lend a hand. \n\nIt really begs the most damning question of all; George. Georgina, Josephine. Charlie's *other* bedridden grandparents. Real or ruse? Decrepit or deceptive? Bedridden or bullshit?","isChecked":false,"level":1,"score":"95"},{"author":"Wwollof","body":"I can see how that scene in Charlie in the chocolate factory would resonate with you from the story you have just told. It's not just Grandpa Joe the character, it's the idea of him and the fact there are Grandpa Joe's among us out in society. I am glad I asked the question because I am learning more and more. Seriously fuck Grandpa Joe.","isChecked":false,"level":2,"score":"32"},{"author":"4AcidRayne","body":">  Seriously fuck Grandpa Joe.\n\nPlease no, that would be fun for him. I'd rather he just get a taste of his own medicine. Hop up Joe, and let me see how the bed feels, oh, and I like my eggs over easy, light on the salt.","isChecked":false,"level":3,"score":"11"},{"author":"Rhodin265","body":"Any chance you could stick him in a home?","isChecked":false,"level":2,"score":"11"},{"author":"4AcidRayne","body":"There is no money and I gave my dying mother my word I wouldn't. It's at the top of my list of regrets, but that's life.","isChecked":false,"level":3,"score":"16"},{"author":"sumerijah","body":"I don't want to be a dick, but what is your mom gonna do, call the cops? Away with his ass, you also have a right to a life.","isChecked":false,"level":4,"score":"41"},{"author":"Rhodin265","body":"First of all, caregiver fatigue is a real, actual thing and the resentment is normal.  You do need to take care of yourself.  His insurance (or yours!) may cover a home health aide or an adult daycare.  They might not be taking people now, but you can still apply while waiting for the outbreak to pass.  You should also look into counseling or a support group for people who take care of their elderly or disabled relatives.  You can have virtual visits if your area is locked down.\n\nAnother possible idea is hiring a maid service.  It would be cheaper than a home.","isChecked":false,"level":4,"score":"20"},{"author":"4AcidRayne","body":"Thank you.","isChecked":false,"level":5,"score":"6"},{"author":"cappilla","body":"Awww well that's sweet that you honor your mama's wishes but it seems like your uncle is just taking advantage of you.","isChecked":false,"level":4,"score":"13"},{"author":"greenteaenthusiast","body":"Wow - that is quite a guilt trip to lay on someone.  If your uncle doesn't have any money, he can probably qualify for Medicaid.  Them you could try to get him moved into a nursing home and you can then be free of this burden and can live your life.  Otherwise, evict the bum.","isChecked":false,"level":4,"score":"6"},{"author":"porkbonebroth","body":"Just give him a notice of eviction. He'll find residence and you won't put him in a home.","isChecked":false,"level":4,"score":"6"},{"author":"cappilla","body":"Damn so why do you put up with that shit?","isChecked":false,"level":2,"score":"9"},{"author":"Scentedfinger","body":"Is it possible for Sunday he takes medication, like a Percocet, but doesn't the rest if the week?","isChecked":false,"level":2,"score":"2"},{"author":"4AcidRayne","body":"Highly unlikely. I'm also the one that's stuck going to the pharmacy too. If he's getting painkillers or pep pills, it's not from a legal source and would have to come from a church friend.","isChecked":false,"level":3,"score":"2"},{"author":"Connor_Hansen","body":"My uncle does that, he can screw around all he wants, but as soon as me or my brother mess up we're \"stupid\" and he hates us. He constantly yells at my aunt, despite her letting him live here.","isChecked":false,"level":2,"score":"2"},{"author":"gmaz2011","body":"He laid in bed, watching everyone starve, until he got the chance to go to the factory and then suddenly could dance","isChecked":true,"level":1,"score":"55"},{"author":"guyhabit","body":"If anyone that deserved to go to the factory with Charlie was his mom.","isChecked":false,"level":2,"score":"23"},{"author":"cappilla","body":"I totally agree, i felt bad for her:(","isChecked":false,"level":3,"score":"8"},{"author":"gmaz2011","body":"In the book there is a Dad, he just did not make much money","isChecked":false,"level":3,"score":"1"},{"author":"cappilla","body":"Hahaha","isChecked":false,"level":2,"score":"1"},{"author":"EmpressVinyl","body":"He's a welfare leach, commits corporate espionage, and makes fun of children behind their back. What are the main reasons people **don't** hate him?","isChecked":true,"level":1,"score":"30"},{"author":"dirtymoney","body":"Grandpa Joe.... corporate spy","isChecked":false,"level":2,"score":"4"},{"author":"Friendtowerewolves","body":"Too be fair, he was bedridden for as Charlie's mom put it bed-ridden for the past twenty years. It did take him some time to even be able to stand up and walk again. Even though, in real life, he would have needed some major physical therapy to be able to walk again. The one thing I did hate about Grandpa Joe was how sexist he was. When Augustus and Mike were in trouble, he showed a great deal of concern but, with Violet and Veruca, when they got in trouble, he didn't really care and even berated them although not directly to them.","isChecked":false,"level":2,"score":"9"},{"author":"KingInky13","body":"It took that lazy asshole like 30 seconds to be in a full dance once free chocolate was involved.","isChecked":false,"level":3,"score":"26"},{"author":"cappilla","body":"Hahaha, that's hilarious OMG","isChecked":false,"level":4,"score":"5"},{"author":"Friendtowerewolves","body":"The miracle of chocolate.","isChecked":false,"level":4,"score":"1"},{"author":"Potatotale66","body":"Guy's just a bit of a fucking prick, isn't he?\nRefuses to get out of bed for years because the fucking floor's too cold for him and he's too old for it, but when Charlie gets something that might be a bit of fun, he's hopping around on that floor like it's a fucking hot potato.\nGo and get a job, Joe, you worthless, COVID-spreading sack of shit.","isChecked":true,"level":1,"score":"23"},{"author":"cappilla","body":"Lol","isChecked":false,"level":2,"score":"3"},{"author":"roguekiller23231","body":"If he was fit and healthy enough to jump out of bed, do a dance and tour a chocolate factory, he shouldn’t have stayed in bed all those years and relied on a child and his mother to work and provide for him and the other 3 old people. \n\nHe should have also let Charlie’s mother go to the factory rather than him, she needed the break.","isChecked":true,"level":1,"score":"17"},{"author":"Time-Parfait","body":"I’ve never thought if it this way before. too true!","isChecked":false,"level":2,"score":"4"},{"author":"cappilla","body":"I totally agree that Charlie's poor mom deserved a break and should have went instead of Joe. And I'm not defending him by no means but how come no one says anything about the other grandparents? Weren't they the same way?","isChecked":false,"level":2,"score":"3"},{"author":"roguekiller23231","body":"They didn’t spring out of bed and do a dance!  Neither did they waste (or at least it wasn’t established if they did or not) money on tobacco.","isChecked":false,"level":3,"score":"4"},{"author":"cappilla","body":"Fair enough","isChecked":false,"level":4,"score":"2"},{"author":"bojanglehorseman","body":"He laid bed for twenty fucking years, watching everyone starve to death, while he could have helped around the house.","isChecked":true,"level":1,"score":"36"},{"author":"WingusMcgee","body":"It would be faster to ask for reasons they don't.","isChecked":true,"level":1,"score":"29"},{"author":"xBlueRush","body":"Because the degenerate piece of filth is patient zero","isChecked":false,"level":1,"score":"9"},{"author":"cappilla","body":"\"The degenerate piece of filth\" lol","isChecked":false,"level":2,"score":"3"},{"author":"teeny_gecko","body":"r/grandpajoehate","isChecked":false,"level":1,"score":"19"},{"author":"PottrPppetPalamander","body":"That might be able to help OP.","isChecked":false,"level":2,"score":"10"},{"author":"bluntdogcamelman","body":"Cause hes a fookin mooch","isChecked":false,"level":1,"score":"18"},{"author":"Reasonlikely","body":"It's Charlie's fucking ticket Joe.","isChecked":false,"level":1,"score":"9"},{"author":"galagapilot","body":"First, fuck that guy. I just want to get that out there.   \n\n\nFeartheHidden's list has all of the major points. The part with him laying around for [twenty years](https://www.youtube.com/watch?v=29_uSlEEPSk), TWO FREAKING DECADES, before deciding to get out of bed, resonated with me the most. \"I got a golden ticket!\" No, your grandson got one. You just suddenly found out that your legs work, decided to get out of bed and dance around like he's on Broadway.   \n\n\nHe also got Charlie killed from drinking the fizzy-lifting drink. Wonka told them all that he couldn't have \"children floating around all over the place.\" Grandpa Joe has no time for that logic. [\"Let's take a drink, nobody is watching\"](https://youtu.be/YD-3vE_R7p8?t=33). The only way Charlie saved himself and Joe was by figuring out that if they could burp they could get back to the ground.   \n\n\nAt the end, because he didn't get his way, he threatened to [turn over the Everlasting Gobstopper to Slugworth.](https://youtu.be/NrZMdqi2D1Y?t=98) Yes, he was gonna fuck over Wonka despite being the one who voluntarily (not accidentally, but voluntarily) broke the rules. This is on top of calling Wonka \"a crook, a cheat, and a swindler\"? The size of the balls on that guy. The only reason they won was because Charlie was smart enough to return the Gobstopper. Grandpa Joe was about to fuck Wonka over, then has the nerve to say \"And me?\" Get lost, you crook. Joe would have sold  that Gobstopper for tobacco money if given the chance. The real happy ending would have been if they would have ejected Joe out of the Wonkavator as Charlie was being awarded the factory.","isChecked":false,"level":1,"score":"10"},{"author":"JambiChick","body":"Haha! He's a faker! He stays in that damn bed until the family's luck FINALLY turns, and with the cue of a song & a golden ticket, he's up & moving around like a 30yr old. He also convinces Charlie to steal the fizzy-lifting drinks! My theory: he's an achly","isChecked":false,"level":1,"score":"8"},{"author":"Everybodysbastard","body":"He knowingly gives people Coronavirus.","isChecked":false,"level":1,"score":"7"},{"author":"RoadFlowerVIP","body":"Cause he is a malingerer","isChecked":false,"level":1,"score":"3"},{"author":"auntsuzy","body":"He’s a bum simple as.","isChecked":false,"level":1,"score":"4"},{"author":"cappilla","body":"Yup","isChecked":false,"level":2,"score":"1"},{"author":"LDBMIKEY86","body":"\"I never thought my life could be anything but catastrophe, but suddenly I begin to see a bit of good luck for me. 'Cause I've got a golden ticket. I've got a golden twinkle in my eye\"\n\nHe touched Mike Teavee's mom inappropriately, denied it, then proceeded to lick the wallpaper like a creep, in his defiance.","isChecked":false,"level":1,"score":"4"},{"author":"tag-your-it-","body":"They straight up drank that candy juice that made him fly after being told not to. Mike TV was the real hero of this story!!","isChecked":false,"level":1,"score":"4"},{"author":"SomeJerk27","body":"I think that people are just kind of annoyed for him for staying in bed all the time and then suddenly being able to leap out and dance when Charlie finds the ticket. It was probably intended for him to have just been revived by new hope, but people get suspicious of shit. I think it’s probably just a meme for the most part.","isChecked":false,"level":1,"score":"4"},{"author":"Spike_Witwicky","body":"He's a grumpy asshole.","isChecked":false,"level":1,"score":"3"},{"author":"QuantumWizard-314","body":"Grandpa Joe's bedridden for 20 years. Charlie gets a golden ticket. Can walk, sing and dance. Do I smell... Benefit fraud...","isChecked":false,"level":1,"score":"3"},{"author":"AudreyTwoToo","body":"He doesn't even have the decency to apply for benefits and contribure to the household. He just lies around doing nothing. In the book, it's actually far worse than the movies. They are actually on the verge of starving to death. Charlie can barely walk and his bones are all showing.","isChecked":false,"level":2,"score":"2"},{"author":"cappilla","body":"This is the first I'm hearing of this","isChecked":false,"level":1,"score":"3"},{"author":"SomeJerk27","body":"r/grandpajoehate","isChecked":false,"level":2,"score":"1"},{"author":"CourageKitten","body":"Grandpa Joe claims he “hadn’t stood up in 20 years”. Since Charlie is clearly less than 20 years old, this means he missed Charlie’s birth, as well as (in the original movie) Charlie’s father’s death and funeral, yet when Charlie gets a chance to go to the chocolate factory, a profit opportunity for Joe, he’s suddenly up and dancing around.","isChecked":true,"level":1,"score":"3"},{"author":"imjustsomejunkmail","body":"He is a freeloader. He can walk just fine but he acts like a cripple so he doesn’t have to work. This affects the entire family, since another paycheck would be useful since they’re very poor.","isChecked":false,"level":1,"score":"3"},{"author":"disneydatknee89","body":"Benefit fruad","isChecked":false,"level":1,"score":"3"},{"author":"Marise20","body":"I always feel bad for the other grandparents and the mom. They are all right there in the room when Charlie invites Grandpa Joe. That must have felt pretty crappy for them.","isChecked":false,"level":1,"score":"3"},{"author":"tatsuedoa","body":"\"I cant work or do chores, I'm too old and feeble.\"\n\n\"Grandpa I got a tour of a chocolate factory\"\n\n\"Well look at that, I can jump and dance and run around and I'm going to go on that tour.\"\n\nHe was a lazy cunt.","isChecked":false,"level":1,"score":"3"},{"author":"TheCirclesSquared","body":"/r/grandpajoehate","isChecked":false,"level":1,"score":"2"},{"author":"Defalt80406","body":"He's a freeloader and if you look he's got coke nails","isChecked":true,"level":1,"score":"2"},{"author":"Gayle1103","body":"Because he was a lazy person who relied on his family to feed and clothe him when he got out of bed just fine to go to the factory. Plus he held that poor kid down his whole life.","isChecked":false,"level":1,"score":"2"},{"author":"thatoneguyxilef","body":"He only got out of bed to eat some candy","isChecked":true,"level":1,"score":"2"},{"author":"Omega_art","body":"I didnt know people hated Grandpa Joe.","isChecked":false,"level":1,"score":"2"},{"author":"blushingtwirls","body":"I hated him for so long, he stayed in bed for YEARS while his family struggled, barely having food and leaving in complete poverty with what seemed like no wait out. Having said family wait on him hand and foot, giving him food and a warm bed, you can tell they didn't really many beds, wouldn't be surprised if it was the only bed. Why else would they have four sick elderly folk on one bed if they had others. So essentially he made sure he got to stay in the only bed with a full belly, while not really needing to. Once the opportunity came up to go do something amazing, he can not only get up, but do an ENTIRE song and dance routine. He just a very selfish jerk, clearly only looking out for himself\n\n\n\nPS if there are any grammatical mistakes, I  apologise, I'm half asleep, on mobile and quite frankly lazy","isChecked":false,"level":1,"score":"2"},{"author":"Biggmoist","body":"Not as lazy as grandpa Joe though.","isChecked":false,"level":2,"score":"5"},{"author":"blushingtwirls","body":"Hahaha I think I just died from this response","isChecked":false,"level":3,"score":"2"},{"author":"HaggisDomesticus","body":"Smells of cigars and cabbage water.","isChecked":false,"level":1,"score":"2"},{"author":"lweissel","body":"Because this asshat stayed in bed for god knows how long, while his family suffered thorough poverty. Then finally when something good happens he springs into action as if nothing ever happened to him. Also I believe he is the person that tells Charlie to break the rules or whatever so that’s also a dick move.","isChecked":false,"level":1,"score":"2"},{"author":"milknot","body":"He is a bitach","isChecked":false,"level":1,"score":"2"},{"author":"lilacsweetener","body":"They don’t understand that he was a cripple who had nothing to hope for. The ticket didn’t cure him but it gives him something to strive for.","isChecked":false,"level":1,"score":"2"},{"author":"Nazbolgangriseup","body":"He’s literally Hitler","isChecked":false,"level":1,"score":"6"},{"author":"MolestyGinger","body":"He looks the type to say racist shit and then cite the Bible even though he skipped church every Sunday to drink beer in the garage while he made his family go","isChecked":false,"level":1,"score":"1"},{"author":"KingTooshie","body":"He’s a lazy lyin bitch","isChecked":false,"level":1,"score":"1"},{"author":"Khan-ye","body":"Because he owes me money","isChecked":false,"level":1,"score":"1"},{"author":"Dark_Vengence","body":"Fuck that ancient decrepit cunt!","isChecked":false,"level":1,"score":"1"},{"author":"erth","body":"Grandpa Joe is asshole. Why Charlie hate?","isChecked":false,"level":1,"score":"1"},{"author":"CrazyHorseWest","body":"He farts in bed.","isChecked":false,"level":1,"score":"1"},{"author":"Dkwhyimhere7","body":"I haven't watched that movie in years...It gives me anxiety","isChecked":false,"level":1,"score":"1"},{"author":"space_squid448","body":"Because he’s the scum of the earth","isChecked":false,"level":1,"score":"1"},{"author":"Extension-Memory","body":" He really \n\nwas a piece\n\n of shit.","isChecked":false,"level":1,"score":"1"},{"author":"bay03","body":"Boy stayed in bed for YEARS and made people being him shit until he heard about going to a chocolate factory and then he got up.","isChecked":false,"level":1,"score":"1"},{"author":"TopsidedLesticles","body":"/r/UnexpectedMulaney","isChecked":false,"level":1,"score":"0"},{"author":"None","body":"[removed]","isChecked":false,"level":1,"score":"-2"},{"author":"Mouseinanutshell","body":"What","isChecked":false,"level":2,"score":"3"},{"author":"aSpaceWalrus","body":"Because they're cucks for the bourgeoisie","isChecked":false,"level":1,"score":"0"},{"author":"Nashi-pear","body":"Who's Grandpa Joe?","isChecked":false,"level":1,"score":"0"},{"author":"Son-of-Neleus","body":"I don't hate him.","isChecked":false,"level":1,"score":"-5"},{"author":"TKinfinity","body":"He's a fucking SIMP","isChecked":false,"level":1,"score":"-6"},{"author":"RottonPotatoes","body":"This whole topic is a tired meme.","isChecked":false,"level":1,"score":"-8"},{"author":"cappilla","body":"Well i think it's funny, and all these posts and comments cracked me up. I've been really sad this past week and I needed a good laugh. So thanks guys, Reddit never fails to pick me up when I'm feeling down.","isChecked":false,"level":2,"score":"6"}],"id":"fuv02k","submissionData":{"author":"Wwollof","body":"","score":"514","subreddit":"AskReddit","title":"What are the main reasons people hate Grandpa Joe from Charlie and the chocolate factory?"},"url":"https://www.reddit.com/r/AskReddit/comments/fuv02k/what_are_the_main_reasons_people_hate_grandpa_joe/"}