{"commentsData":[{"author":"neobeguine","body":"Whether to make the cranberry sauce with the lid on or the lid off.  My mother stormed out of my house on Thanksgiving day because I wanted to do what the recipe said, not what she wanted.   I can't remember if that's also the visit where she set a teapot on fire.","isChecked":true,"level":1,"score":"164"},{"author":"paging_dr_green","body":"How","isChecked":false,"level":2,"score":"41"},{"author":"neobeguine","body":"It was one of those small clay teapots with a bamboo handle, and she decided to microwave the whole pot rather than either boiling water in the kettle on the stove or just putting a mug of water with a tea bag in the microwave.   Unfortunately, under it's bamboo wrapping the teapot handle was made of metal.  I think she had it going for a minute and half before the handle burst into flames.","isChecked":false,"level":3,"score":"66"},{"author":"paging_dr_green","body":"Omg that's terrifying.","isChecked":false,"level":4,"score":"15"},{"author":"neobeguine","body":"It wasn't as bad as the time we had to abandon the house with the windows and doors wide open for a while because she decided to \"season\" my husband's wok with the first oil she found that had an \"Asian-looking\" label.  It was chili oil.  She maced my house.","isChecked":false,"level":5,"score":"63"},{"author":"paging_dr_green","body":"Jesus your mom sounds like a walking tornado","isChecked":false,"level":6,"score":"48"},{"author":"neobeguine","body":"This is why I didnt trust her with the cranberry sauce and wanted to just follow the recipe","isChecked":false,"level":7,"score":"43"},{"author":"paging_dr_green","body":"Yeah I feel like that was probably the right move","isChecked":false,"level":8,"score":"30"},{"author":"hertz037","body":"I did that once... except I literally maced the house. I tried to kill a wasp with pepper spray, and then I learned a very valuable lesson.","isChecked":false,"level":6,"score":"18"},{"author":"neobeguine","body":"So this also happened, but that time it was sort of my fault.  I had pepper spray that I carried in my purse for when I needed to walk alone, and I was a little careless about leaving it on the counter when I got home with my keys and stuff.  One day my dog ran past me howling and frantically rubbing his nose and mouth against things as if trying to wipe something off.  10 minutes later, when my eyes and throat started burning and I found my pepper spray canister leaking due to a dog-tooth shaped hole, I figured out why.","isChecked":false,"level":7,"score":"14"},{"author":"hertz037","body":"Oh no! I bet that dog was forever wary of aerosol bottles after that.","isChecked":false,"level":8,"score":"9"},{"author":"Sexybroth","body":"Anyone ever made Cajun-style blackened fish in a cast iron skillet?   \"Use lots of cayenne, I like it hot!\" said my husband.   We could barely breathe as the peppery smoke filled the house with a burning cloud of fiery fumes.","isChecked":false,"level":6,"score":"12"},{"author":"WinterDustDevil","body":"I did this trying to make a blackened steak. Amazing how fast the house filled up with smoke, my neighbor just about called the fire department","isChecked":false,"level":7,"score":"1"},{"author":"ThePeasantKingM","body":"Having your whole house smell of hot peppers is a common occurrence in Mexico.","isChecked":false,"level":6,"score":"3"},{"author":"BonicBeam1","body":"You’ve never set peppers on fire, If you don’t know what they’re talking about. It makes you choke. The air becomes basically impossible to breathe.","isChecked":false,"level":7,"score":"1"},{"author":"ThePeasantKingM","body":"Whenever my grandpa wanted to cook Chiles en Nogada, Chiles Rellenos or Rajas, he literally put chiles into the fire to toast them. In the middle of the night, on a school day.","isChecked":false,"level":8,"score":"1"},{"author":"BonicBeam1","body":"He obviously did it in a controlled environment and didn’t let them go up in flames and create smoke.\n\nEdit: I’m Indian. We know about peppers too lol","isChecked":false,"level":9,"score":"1"},{"author":"StabbyPants","body":"i dunno, i'd probably put in thin sliced pork after that","isChecked":false,"level":6,"score":"2"},{"author":"scifisociety","body":"This acquaintance of mine and I were playing chess. I had him in check and he moved his knight rather than his king. I told him you lose if you do that, you have to move your king. He refused so then i said checkmate and he lost. We began to argue lightly at first then it just got out of control and our friends stepped in and we stopped playing. \n\nHe then became good friends with my group and we don’t speak about that argument. But ever since then there’s been this weird tension no matter how friendly we are to one another. .-. \n\nI wish we had just googled the fucking rules.","isChecked":true,"level":1,"score":"83"},{"author":"VeganVagiVore","body":"Just in case anyone reads this, I think you're allowed to move another piece as long as your king is no longer in check after your move. But in this case the knight wasn't unchecking the kign","isChecked":false,"level":2,"score":"29"},{"author":"Forikorder","body":"its kinda a common sense rule, if your king is in a position where you are going to lose next turn you have to do something to prevent that or you lose","isChecked":false,"level":3,"score":"16"},{"author":"dilqncho","body":"Yes. If you're in check, you can only make moves that  protect your king. That includes moving the king, or movung something else to plcover him from the checking piece","isChecked":false,"level":3,"score":"1"},{"author":"dae_giovanni","body":"I don't understand this.  what was his argument?","isChecked":false,"level":2,"score":"10"},{"author":"scifisociety","body":"I don’t even know. He just said “no, you can’t checkmate me because i still have pieces on the board.” But i told he loses if his king stays there. He refused so i took his king. \n\nIt was so stupid. I don’t even play chess and he’s a cool guy, i should have just let it go. There was no point","isChecked":false,"level":3,"score":"30"},{"author":"dae_giovanni","body":"that is odd and easily resolved in about 4 seconds on google, yet he insisted.  lol","isChecked":false,"level":4,"score":"11"},{"author":"One_Hundred_X","body":"So no way to block the check or over taking the piece causing it?","isChecked":false,"level":4,"score":"1"},{"author":"CrispyChocolate","body":"My sister and I (she was 10, I was 12) got into a huge argument while babysitting our youngest sister, who was just a toddler back then. The fight was literally about what video we would let our sister watch and it got out of hand in no time. \n\nWe were screaming back and forth until my sister stormed out of the room, slamming the door behind her. She did it with such force that one of the small windows in the door scattered. I'm not exaggerating when I say it looked like the effect of an explosion, the entire floor was covered in tiny glass shards. \n\nIt ended with me crying, my sisters crying and a furious mother who got home less than 5 minutes later","isChecked":true,"level":1,"score":"58"},{"author":"Sexybroth","body":"Who got punished?","isChecked":false,"level":2,"score":"14"},{"author":"CrispyChocolate","body":"Both of us, though I can't remember what it was","isChecked":false,"level":3,"score":"15"},{"author":"Sexybroth","body":"The real punishment is having to pay for the window.","isChecked":false,"level":4,"score":"8"},{"author":"beyond_sleepy","body":"Whether Mater in Cars was originally blue or red. My mom swore up and down he was originally red (cause 'tomater') but I was sure he was blue. after like a day of coming back and arguing a few times I sat my happy ass down and watched Cars to find the truth. All in all I was right and he was BLUE and my mom rewarded me with Oreos","isChecked":true,"level":1,"score":"48"},{"author":"mcp662","body":"My mom, sister and I got into a huge argument about what color the carpet in our church was. They swore it was red, I swore it was blue. We went back and forth for something like 30 whole minutes. In fact, some time later we got into an argument about what color the carpet in our OLD church was. I was right both times, hehe","isChecked":false,"level":2,"score":"11"},{"author":"AdvocateSaint","body":"Lawyers who've successfully argued before the Supreme Court have never felt such vindication as yours","isChecked":false,"level":2,"score":"5"},{"author":"beyond_sleepy","body":"Those were the best oreos I've ever had. Ever.","isChecked":false,"level":3,"score":"3"},{"author":"DaveNay","body":"Wait...Mater was *BROWN!*\n\n[https://www.google.com/search?q=cars+mater&sxsrf=ALeKk032CtXo6l42M0HPlOnXUgQODq\\_iqQ:1586053678015&source=lnms&tbm=isch&sa=X&ved=2ahUKEwjqlcqwntDoAhVtB50JHQ7qBogQ\\_AUoAXoECCEQAw&biw=1504&bih=888](https://www.google.com/search?q=cars+mater&sxsrf=ALeKk032CtXo6l42M0HPlOnXUgQODq_iqQ:1586053678015&source=lnms&tbm=isch&sa=X&ved=2ahUKEwjqlcqwntDoAhVtB50JHQ7qBogQ_AUoAXoECCEQAw&biw=1504&bih=888)\n\n*edit:* oh, I get it. What color was he originally before he turned rusty.","isChecked":false,"level":2,"score":"3"},{"author":"pietersite","body":"He said humans were poisonous because you can die from being bitten. I laughed. He got upset that I wasn't taking him seriously. Told him that's venomous, and humans aren't venomous. We argue about the difference. I look it up. I'm right and he tried to convince me I'm wrong because he read it wrong. I broke up with him because he's calling me an idiot while being one. He left for a few minutes before coming back for his phone. He almost got kicked out of the hospital. I let him stay because he was homeless and eventually got over it.","isChecked":true,"level":1,"score":"36"},{"author":"CobbBigBrain","body":"wow this just got more and more sad the more i read it","isChecked":false,"level":2,"score":"14"},{"author":"Priamosish","body":"> Told him that's venomous\n\nI mean... that is an enormously petty correction. \n\n> you can die from being bitten\n\nAnd that one is true also, we carry a fuckton of bacteria in our mouth that has no business in our blood stream.","isChecked":false,"level":2,"score":"7"},{"author":"Dimspork","body":"I don’t think it’s petty at all.\n\nOr maybe it’s because I’m Australian, and knowing the difference is important down here.\n\nEveryone learns as kids - you bite it and die, it’s poisonous. It bites you and you die, it’s venomous.","isChecked":false,"level":3,"score":"17"},{"author":"Sexybroth","body":"What if you bite each other?","isChecked":false,"level":4,"score":"5"},{"author":"caffieneandsarcasm","body":"Kinky","isChecked":false,"level":5,"score":"6"},{"author":"BorderlineSubliminal","body":"Poivenous","isChecked":false,"level":5,"score":"5"},{"author":"pietersite","body":"I said that last sentence and that's where the argument came from\n\nFinally told him \"then alcohol is venomous\" which is actually why he left. (Though to be fair he had to stop me from pulling out my IV & busting out of there... That's how ridiculously heated I got.)","isChecked":false,"level":4,"score":"3"},{"author":"yukimurakumo","body":"And the most important rule \"you bite it and it dies, you're a prick\"","isChecked":false,"level":4,"score":"1"},{"author":"AdvocateSaint","body":"But we don't produce *venom.*","isChecked":false,"level":3,"score":"6"},{"author":"StabbyPants","body":"that isn't venom, it's just a dirty mouth","isChecked":false,"level":3,"score":"5"},{"author":"pietersite","body":"Do we produce venom? >:(","isChecked":false,"level":3,"score":"4"},{"author":"EagleSevenFoxTwo","body":"But getting infected from the bite isn’t the same as an animal introducing venom to you","isChecked":false,"level":3,"score":"1"},{"author":"fattroutboi420","body":"Me and my friend got into a huge fight over phones. She insisted IPhone is the best, and I said I don't care, because my Samsung works perfectly fine and it's all I need. She was going on and on about why IPhones are the best and I just sat there saying I don't care. It was starting to annoy me so I started saying Samsung is the best just to have a little fun and the fight lasted for hours. Waaaaaay longer than it should be.","isChecked":true,"level":1,"score":"61"},{"author":"Stopman","body":"> just to have a little fun\n\nSeems like everyone who gets into a petty argument says that afterwards","isChecked":false,"level":2,"score":"23"},{"author":"zebrucie","body":"I mean, if you're not screaming at your best friend about how a five foot tall snapping turtle can beat a 10ft polar bear in a triathlon, are you even friends?","isChecked":false,"level":3,"score":"9"},{"author":"ralthiel","body":"In my experience, Apple phones are more user friendly for less tech savvy people and Android is better for power users.","isChecked":false,"level":2,"score":"12"},{"author":"drkcloud123","body":"Not necessarily true, I had an Android and Google's interface is the easiest thing ever. I can back up between phones no problem. \n\nTrying to do that on iPhone to an Android and being forced to use itunes, then iCloud  and eventually a third party software on my laptop to do something easily done via Google was a nightmare. I had no idea why it was so hard transferring data between apple and Android phones. /Shudder.","isChecked":false,"level":3,"score":"8"},{"author":"scare_crowe94","body":"Thats true, used to have an android because I loved that sort of stuff. Switched to Apple because I stopped being interested and wanted something easy, great with media etc and I haven't looked back.","isChecked":false,"level":3,"score":"1"},{"author":"hk089911","body":"next time add a little spice to the mix and bring in your mutual friend with a Pixel","isChecked":false,"level":2,"score":"3"},{"author":"A_Math_Debater","body":"OnePlus gang","isChecked":false,"level":3,"score":"5"},{"author":"Clovenstone-Blue","body":"Well, if you want something reliable and not overpriced practically any phone other than the IPhone is the best.","isChecked":false,"level":2,"score":"2"},{"author":"One_Hundred_X","body":"I'll just leave this for you here\n\n[https://www.google.com/search?q=best+phones+of+al+ltime&rlz=1CAQRFK\\_enCA894&oq=best+phones+of+al+ltime&aqs=chrome..69i57.3631j0j1&sourceid=chrome&ie=UTF-8](https://www.google.com/search?q=best+phones+of+al+ltime&rlz=1CAQRFK_enCA894&oq=best+phones+of+al+ltime&aqs=chrome..69i57.3631j0j1&sourceid=chrome&ie=UTF-8)","isChecked":false,"level":3,"score":"0"},{"author":"One_Hundred_X","body":"Both are good, but I like iPhone","isChecked":false,"level":2,"score":"1"},{"author":"VeganVagiVore","body":"I think when I was in high school I almost quit talking to my best friend because of this.\n\nIt was either phones, or cars, or computers. He had awful taste in all 3","isChecked":false,"level":2,"score":"0"},{"author":"A_Math_Debater","body":"Everyone know the best are iPhones, Hummers, and prebuilt bestbuy PC's.","isChecked":false,"level":3,"score":"3"},{"author":"One_Hundred_X","body":"Which were?","isChecked":false,"level":3,"score":"1"},{"author":"paging_dr_green","body":"Is it pronounced Hairy Potter or Harry Potter? \n\nWe threatened to uninvite each other to our respective birthday parties, so you know it was serious.","isChecked":false,"level":1,"score":"54"},{"author":"Anter11MC","body":"Im American and those are pronounced the same for me","isChecked":false,"level":2,"score":"42"},{"author":"SpaceLemming","body":"Same boat had to watch videos on this hairy is the same, Harry has more emphasis on the ha like HA rry.","isChecked":false,"level":3,"score":"11"},{"author":"scared_shitless__","body":"Har har harry potter","isChecked":false,"level":3,"score":"2"},{"author":"Usidore_","body":"I fell out with a friend after I told her that Noel Fielding's name isn't pronounced like \"Noël\" (no-el).","isChecked":false,"level":2,"score":"11"},{"author":"Particular-Pigeon","body":"Wait... how is it pronounced then?","isChecked":false,"level":3,"score":"1"},{"author":"dDRAGONz","body":"Like mole.","isChecked":false,"level":4,"score":"1"},{"author":"cool_minecraft_hax0r","body":"It's brittish so it's probably something like Hewry Pottah","isChecked":false,"level":2,"score":"3"},{"author":"Jimmysbuffet48","body":"British*","isChecked":false,"level":3,"score":"3"},{"author":"LordTish97","body":"It’s chewsday innit","isChecked":false,"level":3,"score":"3"},{"author":"18002738255_","body":"I’m bri ish","isChecked":false,"level":4,"score":"1"},{"author":"EarthMotherFucker","body":"A few days ago.\n\nMy sister faked having COVID for attention and we got into a 30-ish minute argument (pre-my realization) that consisted of me telling her she needs to keep her distance, take precautions, and quarantine herself in her room, and it ended in her getting super defensive and screaming \"I HOPE YOU GET CORONAVIRUS AND I HOPE YOU FUCKING DIE!\"","isChecked":true,"level":1,"score":"54"},{"author":"Ryun2525","body":"Omg, if I ever said that to one of my sisters my mom would slap me so hard I would loose a couple of teeth and I won't be able to say that ever again :'v","isChecked":false,"level":2,"score":"18"},{"author":"interalios12","body":"I got in a very heated debate over whether Glinda from wizard of oz was a witch or princess.","isChecked":false,"level":1,"score":"28"},{"author":"staceyox1","body":"She came down in a fucking bubble dude","isChecked":false,"level":2,"score":"28"},{"author":"genio_del_queso","body":"She wore a crown and came down in a bubble Doug!\n\nOH GROW UP!","isChecked":false,"level":3,"score":"8"},{"author":"Blondie_62","body":"Thats how you can tell she's a witch. When I try and come in a bubble it just ends up popping.","isChecked":false,"level":3,"score":"1"},{"author":"beckyb18","body":"You’re gonna look at me and you’re gonna tell me I’m wrong?!","isChecked":false,"level":2,"score":"19"},{"author":"Sexybroth","body":"Ozma was the princess and Glinda was the good witch.","isChecked":false,"level":2,"score":"3"},{"author":"NeutralityTsar","body":"It's actually really easy to tell the difference. If she weighs the same or less than a duck, she must be a witch!","isChecked":false,"level":2,"score":"3"},{"author":"shestherenow","body":"Were knives involved?","isChecked":false,"level":2,"score":"1"},{"author":"interalios12","body":"Yup","isChecked":false,"level":3,"score":"1"},{"author":"Thinlittlelesbian","body":"She was a good witch. Are you fucking stupid?","isChecked":false,"level":2,"score":"1"},{"author":"cool_minecraft_hax0r","body":"I remember getting angry at my grandma for telling me that 90 was a real number. I was 100% sure that 100 came after 89.","isChecked":true,"level":1,"score":"47"},{"author":"hertz037","body":"I'm 89% sure you were wrong...","isChecked":false,"level":2,"score":"27"},{"author":"Abceedeeznuz","body":"Yours is the first I've seen that isn't \"I'm right, your wrong.\" Admitting you're wrong is so tough to do, but this is so funny!","isChecked":false,"level":2,"score":"8"},{"author":"Chakinz","body":"Holy shit i thought that as a kid and i have no idea why. It was before i figures out how when one number goes past 9 it resets to 0 and the number to left goes up by one. For whatever reason when i was memorizing numbers 1-100 i just forgot about 90-99 somehow","isChecked":false,"level":2,"score":"1"},{"author":"Country-Blumpkin","body":"Had what I thought was a argument for funsies over who would win in a fight, Chucky or Luke Skywalker. He must have taken it a little more seriously cuz dude deadass never spoke to me again.","isChecked":false,"level":1,"score":"20"},{"author":"One_Hundred_X","body":"That seems tough. Who you got?","isChecked":false,"level":2,"score":"1"},{"author":"Country-Blumpkin","body":"Chucky is a noble opponent but Luke got this all day","isChecked":false,"level":3,"score":"1"},{"author":"One_Hundred_X","body":"How so?","isChecked":false,"level":4,"score":"1"},{"author":"Country-Blumpkin","body":"Chucky can't really hide from Luke in order to sneak attack. Luke is going to feel where he is. And Chucky can't just jump him cuz Luke would force grab him or slice him with the saber. \n\nUnless the fight would happen on Myrkr where the Ysalamiri blocked Luke from using the force. Then Chucky has that round. \n\nMy nerd is showing 😂","isChecked":false,"level":5,"score":"4"},{"author":"ExpectoPerineum","body":"Thanksgiving 2018, arguing with the ex over a potato masher. \n\nI talked about needing one for a while but never really pulled the trigger on getting one since money was tight and I'd rarely use a masher except for special occasions (like Thanksgiving). I, naturally, would be the one doing most of the cooking while he \"helped.\" He (who always plays devil's advocate) talked me out of getting one after some arguing, especially since we were living in a temporary place and claimed that we could just get one later when we move.\n\nThanksgiving day rolls up and I'm supposed to cook a bunch of food (vegan ONLY too which kinda stressed me out) and I say we should've gotten the masher. Then he blames me for not getting one (even though he talked me out of it), and took no responsibility over anything. Fight escalated and I end up crying alone in the room and get called all other nasty things\n\nLooking back it was actually not that insignificant of an argument because the real issue was in between the lines and not necessarily the potato masher itself. \n\nThere's a reason he is an ex lol","isChecked":false,"level":1,"score":"14"},{"author":"One_Hundred_X","body":"really?","isChecked":false,"level":2,"score":"2"},{"author":"buggman14","body":"The one and only argument I've had with my (now) wife. We went back and forth for a while when I realized it was a stalemate. Neither of us were going to change our minds. I tried to drop it because I was getting incredibly upset. She kept bringing it up. After the 3rd or 4th time I snapped and threw whatever was in my hand, which happened to be a plate of pizza rolls. Pizza sauce all over the walls. That basically ended the argument and us talking for most of the night. What were we arguing about?\n\nNHL playoff seeding. Yeah. Not my proudest moment. I am very non confrontational, but that along with my life situation at the time set me off for whatever reason.","isChecked":false,"level":1,"score":"15"},{"author":"itisSUNNYinhere","body":"I had broken my leg so was holed up in the bedroom watching Grey's Anatomy for the first time (I think I was on season 2). My husband (who had already watched the entire series) and I started arguing about something stupid and he yelled - \"Oh yeah? Well guess what, George dies!\" At which point I gasped, he gasped, and he realized he had crossed a serious line. Then he quietly apologized and walked out of the room.\n\nGuess what. Four seasons later, George died. You know who wasn't surprised? This girl.","isChecked":false,"level":1,"score":"30"},{"author":"NegativeSoldier","body":"Fuck you, i haven’t even started watching it and now it’s already ruined for me","isChecked":false,"level":2,"score":"7"},{"author":"Thinlittlelesbian","body":"Pssst! George dies!!","isChecked":false,"level":3,"score":"1"},{"author":"Solonys","body":"You divorced his ass as soon as you could, right? Spoilers are worse than murder.\n\n/s for those who can't grok sarcasm.","isChecked":false,"level":2,"score":"2"},{"author":"lazylazyotter","body":"best girl of an anime","isChecked":false,"level":1,"score":"10"},{"author":"BotwLonk","body":"Rem","isChecked":false,"level":2,"score":"4"},{"author":"gliscor885","body":"Who?","isChecked":false,"level":3,"score":"1"},{"author":"ISureDoLikePickles","body":"REM... you know... shiny happy people... losing my religion...","isChecked":false,"level":4,"score":"1"},{"author":"wehosh","body":"The steak knives that broke my dad's marriage.\n\nMy then step mom and I never really got a long and she had a long history of temper and control issues. One night we are having steak for dinner and she passes out bread knives. It then dawns on me that we have perfectly good steak knives in the knife drawer. So I go to grab them. She starts to snap at me and then my step sister intervenes and before she can start a yelling fight. She looks like we just ripped her heart out and throws her food away. She storms off and my dad follows to chew out over being a bitch about fucking steak knives of all things. She comes back _apologizes_ and goes to bed. The next morning I get up the same time she does, and I find the dog is fucking with her cat, so I push the dog away and tell him to fuck off. She then completely blows up on me on how disrespectful I am and how I owe her an apology and this while lecture on how I need to explain myself all at 4 in the morning. She hears my dad get up and storms off to work. I look at my dad and tell him I'm not apologizing. He looks at me and says ya I think it's high time for a divorce, pack your bags and get out of the house before shit gets real. You damn well know she's gonna blame you for this, and you don't wanna be around when the nukes start flying.\n\nAll this over a fucking set of steak knives!","isChecked":true,"level":1,"score":"7"},{"author":"FlaredFancyPants","body":"Good on your dad for getting out of that. So many parents don't and there are fractions in families because blended families are unable to adapt to being together. I hoe it worked out well in the end for you and your dad, step mum sounds crazy.","isChecked":false,"level":2,"score":"3"},{"author":"ISureDoLikePickles","body":"you know it wasn't about the steak knives, right? the steak knives probably was the last straw, but this whole thing was probably inevitable.","isChecked":false,"level":2,"score":"1"},{"author":"WispValve","body":"Whether & was the 27th letter of the alphabet.","isChecked":false,"level":1,"score":"23"},{"author":"hertz037","body":"And per se and","isChecked":false,"level":2,"score":"5"},{"author":"ISureDoLikePickles","body":"ampersand?","isChecked":false,"level":3,"score":"1"},{"author":"pathemar","body":"Don't even get me started on Q being too close to the front of the alphabet with the *normal* letters","isChecked":false,"level":2,"score":"10"},{"author":"Rstepp7","body":"Couldn’t you argue that about any symbol?","isChecked":false,"level":2,"score":"10"},{"author":"hertz037","body":"The ampersand was originally the 27th letter of the alphabet, and that's actually where it gets its name. X, Y, Z, and per se and. The first \"and\" signifying the end of the list, \"per se\" meaning \"by or of itself\", and the last \"and\" being the meaning of the symbol.\n\nAll of that was combined later into \"ampersand\" and the symbol was dropped from the alphabet. I'm not a linguist by any means, but that one is really interesting to me for some strange reason.","isChecked":false,"level":3,"score":"24"},{"author":"WispValve","body":"Finally, a like-minded normal individual.","isChecked":false,"level":4,"score":"1"},{"author":"Firstnamesurname123","body":"You could say a full stop is because it is the first symbol you really learn in reception","isChecked":false,"level":3,"score":"3"},{"author":"bobdole3-2","body":"In order to be the 27th letter of the alphabet, wouldn't it need to be, you know, a *letter*? It's not. If & is a letter, then any symbol that expresses meaning is a letter.","isChecked":false,"level":2,"score":"-2"},{"author":"WispValve","body":"I do find it weird that it was a letter since there were only two words, one of which was an per se. Anyway, History says that was common to include it along with other 26 letters.","isChecked":false,"level":3,"score":"1"},{"author":"MaxGotKidnapped","body":"About who has the right of way. *Oh and by the way,* **they were both arguing about the other person having the right of way**","isChecked":false,"level":1,"score":"8"},{"author":"coachz1212","body":"My friends got into one that I solved fairly quickly. We were all super high just coming in from smoking and a friend had an idea about Hidden Valley Ranch. They were arguing whether it was applicable to still called it \"Hidden Valley\" ranch when we clearly know where they valley it was hidden in. Another friend said that the valley was called \"HIDDEN valley\" just as a cool name. \n\nAfter what was probably a good half hour of them going back and forth, I was getting sick of it. I semi yelled, \"Guys, guys! You can take the ranch out of the hidden valley, but you can't take the hidden valley out of the ranch.\" They both look at me like they both just had the most profound life changing experience. And that was the end of it.","isChecked":false,"level":1,"score":"6"},{"author":"muck_hard","body":"Friends is overrated","isChecked":false,"level":1,"score":"8"},{"author":"Blondie_62","body":"That's just a fact of life.\n\nThe sky is often blue, water isn't wet, and friends is overrated.","isChecked":false,"level":2,"score":"5"},{"author":"CobbBigBrain","body":"one time me and my friend argued about a post he made on his snapchat story. i don’t remember exactly what it was, but it got into religion and stuff and it went on for way longer than it should have","isChecked":false,"level":1,"score":"5"},{"author":"ameliemelo34","body":"At age 3, my cousin (same age) and I had an argument about which direction left was. Facing each other so we were pointing in opposite directions. My dad came, stuck his hand out on the left and did half a turn to show us that we are both right. We accused him of swapping hands at the last second 😂","isChecked":false,"level":1,"score":"5"},{"author":"Keyblades4Real","body":"I refused to have it.  If you're for circumcision, I don't care. If you're against it, I don't care.  This guy acted like he'd be satisfied if you were to castrate him and give him  his foreskin in a super secure vault with thirty thousand combinations.","isChecked":false,"level":1,"score":"11"},{"author":"Priamosish","body":"Well circumcision is frowned upon in most of Europe, actually. It's an act of cosmetic mutilation on a little child that can't say no.","isChecked":false,"level":2,"score":"19"},{"author":"Stopman","body":"BUCKLE UP LADIES AND GENTLEMEN","isChecked":false,"level":3,"score":"13"},{"author":"VeganVagiVore","body":"After this we can have a shitfling about mandatory organ donation!","isChecked":false,"level":4,"score":"1"},{"author":"PoopyPants1961","body":"Pretty sure that trauma is why I am such a raging a-hole with no filter. No, who am I kidding?","isChecked":false,"level":3,"score":"1"},{"author":"Keyblades4Real","body":"Well everyone is entitled to their own opinion.  I see no problem with it. Female \"circumcision\" is mutilation  IMO.","isChecked":false,"level":3,"score":"-5"},{"author":"FiveOhFive91","body":"What's the difference?","isChecked":false,"level":4,"score":"5"},{"author":"Keyblades4Real","body":"Female Circumcision involves the removal of a woman's entire clitoris. It's the equivalent of castration.","isChecked":false,"level":5,"score":"3"},{"author":"JMW007","body":"This is inaccurate.  It is barbaric and horrific and not ok outside of desperate medical need such as an infection, but it is not the removal of the entire clitoris, which extends in 'legs' down either side of the vulva inside the body.  It removes the part that is outside the body.\n\nMale circumcision involves removal of part or all of the foreskin.  They are not, in any way that matters to anyone with a conscience, different.  Both are mutilation of the sexual organs to indulge the parents' selfish, infantile reasons unless medically indicated.","isChecked":false,"level":6,"score":"2"},{"author":"Keyblades4Real","body":"You are free to think so.","isChecked":false,"level":7,"score":"-2"},{"author":"hardsoft","body":"It's not purely cosmetic though.  Less risk of infection, STDs, penile cancer, probably among some others but those are what I remember the doctor mentioning.","isChecked":false,"level":3,"score":"-5"},{"author":"jimmobean","body":"These were a lot more important before the HPV vaccine. Without HPV it’s a much more delicate balance between the baby’s autonomy and any benefits","isChecked":false,"level":4,"score":"5"},{"author":"hardsoft","body":"I can see that for STDs, but infections and related?  I don't know, seems \nlike calling it cosmetic mutelation is a little extreme","isChecked":false,"level":5,"score":"-3"},{"author":"jimmobean","body":"I agree. Mutilation isn't a word I would use","isChecked":false,"level":6,"score":"-2"},{"author":"YourBeaner","body":"There are probably many parts of the body you could cut off and then have one less thing to worry about getting infected.\n\nI think this is such a poor argument for mutilation. It is a functional part, and it is mainly done on a child for very non-sanitary reasons.","isChecked":false,"level":4,"score":"7"},{"author":"VeganVagiVore","body":"Less sensitivity too, right?\n\nPlus if they transition there's less material to work with for a neovagina.\n\nDon't cut something you can't uncut","isChecked":false,"level":4,"score":"3"},{"author":"Marcus_Vapes","body":"His dick is not that valuable.","isChecked":false,"level":2,"score":"1"},{"author":"Sexybroth","body":"Two words:  Stinky dick.","isChecked":false,"level":2,"score":"-5"},{"author":"Retrotreegal","body":"Just wash yourself, bro. Same thing fixes stinky ass.","isChecked":false,"level":3,"score":"4"},{"author":"Redditor_2017","body":"Reading some science fiction discussion forums defending their favorite science fiction franchise.","isChecked":false,"level":1,"score":"5"},{"author":"DrippinNSlippin","body":"Yeah, I'm sorry, your series is good, but it's not really \"science fiction\" it's *more*...  \n\n\n\"Science fantasy\"...","isChecked":false,"level":2,"score":"2"},{"author":"ByzantineBasileus","body":"I do this with Star Wars fans. \n\nNow, Star Trek? That can cause excessively vigorous discussion based on how \"hard\" a person thinks science-fiction should be in order to be categorized as \"science-fiction\".","isChecked":false,"level":3,"score":"1"},{"author":"Chrisetmike","body":"My boys had a heated debate about how many times you can divide a fish cake before it stops being a fish cake. It lasted well over 5 min. and started with a funny quip.","isChecked":false,"level":1,"score":"3"},{"author":"WendyWindfall","body":"Reebok vs. Adidas running shoes. We didn’t speak for several years after.","isChecked":false,"level":1,"score":"4"},{"author":"One_Hundred_X","body":"Both","isChecked":false,"level":2,"score":"1"},{"author":"seanbs89","body":"I misspelled a word on the internet..","isChecked":false,"level":1,"score":"4"},{"author":"100ergoman","body":"Grass or artificial turf?","isChecked":false,"level":1,"score":"4"},{"author":"One_Hundred_X","body":"both","isChecked":false,"level":2,"score":"2"},{"author":"rushaz","body":"PINK!!!!  PURPLE!!!\n\nMy wife and I arguing over if Klingon blood is which color","isChecked":false,"level":1,"score":"5"},{"author":"NanoChainedChromium","body":"Its pink for chrissakes! Bright pink!","isChecked":false,"level":2,"score":"1"},{"author":"FauxMermaid","body":"tl;dr - friend took offence to being told to shut up and tried to murder me.\n\nGo back about 4 years, me and my then-bestfriend were celebrating me leaving a shit job we both worked at. We're drinking after my last shift, some of his other friends that I've met but am not that familiar with come, everyone seems to be having an alright time.\nSo either I was talking and he interrupted me or he was talking some absolute bullshit, I can't remember exactly, but I said something like \"Oh shut the fuck up\". \n\nNext thing I know my friend comes at me with a broken bottle trying to kill me, screaming some real nonsense and trying to get me with this jagged bit of glass. I manage to control the situation by giving him a quick jab and get the hell out of there. \n\nCalled him a few days later and he was beyond pissed that I had hit him, no explanation or apology for trying to stab me. Never spoke again.","isChecked":false,"level":1,"score":"4"},{"author":"One_Hundred_X","body":"whoa","isChecked":false,"level":2,"score":"2"},{"author":"WhiskeyTangOhF","body":"The difference between a haircut and a hairstyle.","isChecked":false,"level":1,"score":"4"},{"author":"keysrose","body":"Had an argument with my boyfriend about how often a person should go #2 🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️","isChecked":false,"level":1,"score":"9"},{"author":"IronMaidan","body":"Anywhere between 3 times a day and once every 3 days","isChecked":false,"level":2,"score":"9"},{"author":"rainelle95","body":"I poop more often than that on most days, but I'm lactose intolerant and refuse to stop eating cheese.","isChecked":false,"level":3,"score":"8"},{"author":"VeganVagiVore","body":"Once a day is good. Twice occasionally isn't bad.","isChecked":false,"level":2,"score":"1"},{"author":"keysrose","body":"That’s what I was trying to explain and this man said every other day 🤦🏽‍♀️ I think he mighta been fucking with me though","isChecked":false,"level":3,"score":"0"},{"author":"rachelleeann17","body":"I poop like once a week, it isn’t unreasonable of him to say every other day. cut your man some slack haha","isChecked":false,"level":4,"score":"4"},{"author":"twelve-lights","body":"It started with a cliff bar...","isChecked":false,"level":1,"score":"6"},{"author":"Sexybroth","body":"Whether or not I lost my husband's set of metric wrenches.   He swears they were in his toolbox and I must have done something with them.   However, I haven't used any wrenches (metric or standard) in over a year, and I started crying because he was falsely accusing me.","isChecked":false,"level":1,"score":"5"},{"author":"dae_giovanni","body":"was this recently?  did the wrenches ever turn up?","isChecked":false,"level":2,"score":"3"},{"author":"Sexybroth","body":"This is still going on!   He stormed off to the hardware store to buy more wrenches so he could install a new battery in the [hellcat.](https://imgur.com/aSr5IHn)   He returned home with his new set of overpriced wrenches only to discover that he couldn't install the battery because his hands are too big.  He apologized to me for being a fuckmunch, but only so I would use my small female hands to reach down through the narrow space in the engine compartment, line up the battery bolts and tighten them.  \n\nTo tighten the bolts, I needed a socket wrench and an extension.   The metric wrenches didn't fit, and I resisted the urge to question his competency in thinking they were the right tool for the job.   \n\nHe just left in the hellcat to go wash it.   The new argument is about whether or not it's stupid to not sweep/ShopVac the garage before parking a nice clean car in it.   I refuse to argue, I moved the  [bales of ha](https://imgur.com/aSr5IHn)y outside the garage so he can't pull the car in until I move them.   He's going to pitch a fit about having to wait a few minutes for me to finish vacuuming up the leftover hay.   I say, if I don't vacuum, the nice clean car won't stay clean if parked in a dirty garage.","isChecked":false,"level":3,"score":"2"},{"author":"dae_giovanni","body":"thank you so much for this update!! \n\nnice car... and it seems like you guys are really enjoying this quarantine, eh?  hahah!","isChecked":false,"level":4,"score":"0"},{"author":"Klown1327","body":"Was in the car with 2 of my friends, I made a comment about being a \"cunning linguist\" my other friend was like \"i see what you're saying\" my other friend didn't get it at first and we explained that \"cunning linguist\" sounds like \"cunnilingus\" she said she got it, then I asked if she knew what cunnilingus was. This particular friend is, on the outside, very sweet and innocent but in reality is pretty damn wild. She said she did in fact know what cunnilingus was, and we asked her to explain. She said she didnt want to, we asked why, she spoke up and said \"BECAUSE I DONT WANNA\" so we responded even louder \"SAY IT!\" we went back and forth, yelling \"SAY IT!!\" and \"I DONT WANNA!\" for about a minute before she screamed \"IT MEANS YOU LICK-A THE PUSSY!!!\" my other friend and I about died laughing, and \"it means you lick-a the pussy\" is now an inside joke with us.","isChecked":false,"level":1,"score":"5"},{"author":"FarTooFewCharacters","body":"I had a really heated argument with my dad whether I could put two pairs of shoes in front of the shoe rack or if I had to put them into it.\nIt was really pointless and I still put my shoes where I had them but at that time it felt like the world and I ran to my grandma to vent about the whole thing for over an hour....","isChecked":false,"level":1,"score":"3"},{"author":"Sexybroth","body":"Too many shoes cause too many arguments.","isChecked":false,"level":2,"score":"2"},{"author":"FiddyKitties","body":"I got into a very heated argument with my sister over whether a single-use water bottle sitting on our table was hers or mine. I was holding a water bottle in my hand, but she wouldn't budge that the bottle on the table was mine. We woke up everyone in the house with our yelling. She said \"you forgetful fuck, if parents knew you were this useless, they wouldn't leave their kids with you.\" It's one of the few actual arguements I've had with her, but without a doubt the most ridiculous.","isChecked":false,"level":1,"score":"3"},{"author":"ashtar123","body":"I remember my brother and mom fighting over if a glass was clean or not","isChecked":false,"level":1,"score":"3"},{"author":"Toothlessdovahkin","body":"Whether it was Elmo or Elbow with my sister when we were 4 and 3. I'm talking a 20 minute yelling match.  I was wrong.","isChecked":false,"level":1,"score":"3"},{"author":"-Dark_Artist-","body":"I've gotten into an argument once with my little brother about the importance of putting your paycheck into savings and such. You see, he likes to boast about how he's gonna move out and live on his own. Admirable, but he's been working the same $10/hr job for the past 7 months. What does he do with the money? Gets a brand new iPhone 11 with all the bells and whistles as well as a smart watch that is its own separate line, buys multiple material things, and complains about how he never has any money. With that 10/hr job working at full time, he at best make $1,200 per month with the taxes taken out, yet he somehow can't put any of that shit to the side so he can eventually \"move out\". I brought this to his attention, but he has the mental capacity of a middle schooler and would lash out at me during any attempt on my end. I honestly don't know how I put up with him.","isChecked":false,"level":1,"score":"3"},{"author":"dogsdogsjudy","body":"One time me, my sister, and my cousin were drunk talking about if dragons ever existed, it was the 4th of July so we were pretty gone. My older brother was nodding in and out (also drunk) at the table, when all of a sudden he perks up and gets so nasty and says “AS MUCH AS I WANT DRAGONS TO BE REAL THEY ARENT SO STOP FUCKING TALKING ABOUT THEM!” And we tried telling him we were just shooting the shit but he continued to get irreversibly angry and ultimately we changed the subject.","isChecked":false,"level":1,"score":"3"},{"author":"Captain-Ravioli837","body":"In a school group project, My partners were arguing weather or not the picture at the front of the book had a tomato or apple.\n\n\n\nThis was supposed to be a group project about space\nNot fruits","isChecked":false,"level":1,"score":"3"},{"author":"foxofok","body":"Wiping front to back or back to front.","isChecked":false,"level":1,"score":"3"},{"author":"swest320","body":"I don't think there should be any debate to this lol","isChecked":false,"level":2,"score":"12"},{"author":"rachelleeann17","body":"For women, back to front drags bacteria into your vagina which is not fun for anyone involved. If you ever have a daughter and have to changer her diaper, always wipe her front to back!","isChecked":false,"level":2,"score":"5"},{"author":"IiASHLEYiI","body":"For women, it's better to wipe front to back. Doing the reverse can lead to yeast infections.","isChecked":false,"level":2,"score":"4"},{"author":"Blondie_62","body":"It just depends on where you go in from.","isChecked":false,"level":2,"score":"1"},{"author":"bazzlebubs","body":"The only fight I’ve ever had with my best friend of 10+ years was a disagreement over the The Secret World of Arrietty. I was upset that the Disney release featured some cheesy original song with a Disney channel actress. She proceeded to defend Disney which was enough to get me heated. Really weird, specific, and super dumb argument. I left the lunch table in tears and ate lunch in my bathroom after our fight. In hindsight not really an appropriate reaction lol","isChecked":false,"level":1,"score":"3"},{"author":"FrunkenDuckIG","body":"How much to tip the waiter.","isChecked":false,"level":1,"score":"2"},{"author":"_StarScreamer_","body":"My friend doesn’t get time lines in movies, for example - Venom. She thought he already met spiderman since spiderman 3. I had to explain that it was a different time line to her many times and it got to the point she didn’t talk to me for a week","isChecked":false,"level":1,"score":"2"},{"author":"TwoMiddleFingersUp","body":"My fiancé regularly puts things on the top of the fridge. Just out of habit from when the kids were younger and used to get into everything. It’s unnecessary now but she still does it. Every now and then it gets too full of shit and shit starts falling off the top of the fridge. One day I was hanging pictures and she put the hammer and nails on top of the fridge before I got around to putting them back in the garage. I didn’t do it immediately because the Cadillac leaves no room to get around it and I’d have to open the garage to get around the far side to the tool box and just didn’t feel like it. Anyway, not long after the nails went up there they spilled. All over the top of the fridge all mixed in with that shit. We picked up what we could but surely there would be a few we missed in that mess, and we did. For several days after that we’d find a nail here and there on the floor. Finally she lost her temper and started bitching at me over it. The way I saw it it was her fault so I blew up back and we had a terrible fight in the kitchen over a little nail on the floor.","isChecked":false,"level":1,"score":"2"},{"author":"Nevertrustafish","body":"I accidentally discovered not to mix my new med with alcohol, got trashed off of mimosas at brunch, and picked a fight with my husband over whether 12hr time or 24hr time is more popular worldwide. I was really pro 12 hr time because analog clocks worldwide use that system and remember yelling at him that the average person isn't gonna say let's meet at 1300 for lunch, no matter where they are from.","isChecked":false,"level":1,"score":"2"},{"author":"lolreallyno4","body":"Answer: 24hr time when written, 12hr when verbal","isChecked":false,"level":2,"score":"1"},{"author":"starr_stitches","body":"Any argument any parent has ever had with a child","isChecked":false,"level":1,"score":"2"},{"author":"SarcasticAsshole2004","body":"I once argued with a friend about why the phrase \"open secret\" wasn't idiotic. (He thought it was) and we hung up the phone on each other","isChecked":false,"level":1,"score":"2"},{"author":"1000tinyraccoons","body":"when my best friend and i were younger we got into an argument because she couldn't tell i was doing a southern accent and i didn't talk to her for a solid 20 minutes. i told her i was mad at her by writing it down on a piece of paper and i spelled accent wrong...we still joke about it","isChecked":false,"level":1,"score":"2"},{"author":"WillfulBiscuit","body":"My friends and I fought bitterly for hours over whether the fan in our apartment spun clockwise or counterclockwise.","isChecked":false,"level":1,"score":"2"},{"author":"mcp662","body":"Just tonight my family and I were arguing over whether ducks paddling is \"swimming\" or not. There were many comparisons going on, involving sailboats, ships, canoes, rowboats, propeller boats, and so on. It got pretty intense.\n\nI think we've been in quarantine for too long.","isChecked":false,"level":1,"score":"2"},{"author":"trollingtrollstroll","body":"I got into an argument with my best friends sister in high school about whether or not chickens could fly (before smart phones). Lol I lost my best friend cuz it got so heated","isChecked":false,"level":1,"score":"2"},{"author":"xtheboard","body":"Is water wet","isChecked":false,"level":1,"score":"2"},{"author":"Heuristic-Mind","body":"Not me, but I witnessed one between two work colleagues.\n\nThe two guys were getting red faced and up in each others faces about how old a car has to to be to be considered a Vintage Car.\n\nIt got to the point where the Manager had to step in and intervene.","isChecked":false,"level":1,"score":"2"},{"author":"cansussmaneat","body":"My sister and I got into a huge fight because we were both on ellipticals at the gym and they showed our heart rates were over 100 bpm. My sister said the machines were broken because heart rates can't go over 100. I said I thought that was wrong, but she wanted to switch ellipticals. So we switched and, sure enough, our heart rates are still over 100. She says those readers are broken, too.\n\nThis was before smart phones. By the time we got back to the house and I could Google and show her she was wrong, the fight had devolved so far from that topic, it didn't matter and she didn't care.","isChecked":false,"level":1,"score":"2"},{"author":"sheepyaqua","body":"Whether blue from blues clues was a boy or a girl. I insisted blue was a boy and my best friend said no shes a girl. \nThis argument lasted 3 years and we screamed at each other everytime it came up.","isChecked":false,"level":1,"score":"2"},{"author":"Lets_Call_It_Wit","body":"My brother’s birthday is the day before mine, though is is four (well, almost four) years younger than me.\n\nWhen he was four (about to turn five) and I was 8 (about to turn 9), he was certain, and proudly proclaiming, that for one day he was going to be older than me. I spent hours explaining, first patiently with props that I would line up for years, and then angrily, that he was wrong. I cared far too deeply about this and he was as certain as only a little kid can be, so the day ended with both of us in tears screaming at each other.","isChecked":false,"level":1,"score":"2"},{"author":"meepbotl","body":"is a poptart a sandwich?","isChecked":false,"level":1,"score":"3"},{"author":"black_flag_4ever","body":"No. It’s a filled pastry.","isChecked":false,"level":2,"score":"7"},{"author":"neobeguine","body":"It's covered in pastry crust, not bread.  Clearly, its a shitty pie.","isChecked":false,"level":2,"score":"2"},{"author":"Deedoodleday","body":"It's a hand pie.","isChecked":false,"level":2,"score":"2"},{"author":"Sexybroth","body":"Is that like a finger pie?","isChecked":false,"level":3,"score":"2"},{"author":"Deedoodleday","body":"Except bigger.","isChecked":false,"level":4,"score":"1"},{"author":"bobdole3-2","body":"It is if you're an advocate of Radical Sandwich Anarchy: https://flowingdata.com/2017/05/02/sandwich-alignment-chart/","isChecked":false,"level":2,"score":"2"},{"author":"seyEycipS","body":"no it's a sweet ravioli","isChecked":false,"level":2,"score":"1"},{"author":"MindYourOwnBiscuits-","body":"Is a hot dog a sandwich?","isChecked":false,"level":2,"score":"1"},{"author":"CookeyMaddison","body":"Is a hamburger a sandwich","isChecked":false,"level":1,"score":"1"},{"author":"chinesesamuri","body":"I once argued for an hour with my best friend over if The Devil Went Down To Georgia is a country song. He swore it wasn't and I asked others if it was or wasn't","isChecked":false,"level":1,"score":"1"},{"author":"Diocletion-Jones","body":"Whether the Stormcloaks or the Imperials were doing the right thing in Skyrim.","isChecked":false,"level":1,"score":"1"},{"author":"to_the_second_power","body":"I think the imperials , as they decided to save the lives of the people instead of rising to power","isChecked":false,"level":2,"score":"1"},{"author":"Stonecleaver","body":"That’s actually a tricky one. My main character was a Nord Paladin, so it was a very difficult choice on who to side with. \n\nI eventually settled on Imperial, for what it’s worth.","isChecked":false,"level":2,"score":"1"},{"author":"kleptokandi","body":"i argued with 2 friends about when a music video was released, i dont talk to one of them anymore and the other messaged me a couple hours later when she found out that i was right\n\nto clarify: it was constant arguments that made me stop talking to that one friends not just this one","isChecked":false,"level":1,"score":"1"},{"author":"thecrunkness","body":"Coworker and I had an argument over if Pringle were fried or baked. Turns out both.","isChecked":false,"level":1,"score":"1"},{"author":"Sassymacaroni7408","body":"Some kids incmy 5th grade class were arguing wether it was pronounced maruchAn or marUchan","isChecked":false,"level":1,"score":"1"},{"author":"thunderfart_99","body":"The other day some guy debated me on Reddit replying to my comment about the UK pub chain Wetherspoon's. He misinterpreted my comment and thought that the UK government wouldn't deliver on its promise to pay 80% of wages to non-essential workers, then tried to call me out when I said they hadn't. I\n\nnever meant to say that the government wouldn't refuse to pay the workers 80%, its just the first payments had not come in yet. Either way, I think he just misinterpreted what I said completely, or I had just worded it poorly, but yeah, it blew up a bit. The only reason I kept replying to him because he had a decent post history. Normally I don't reply to people if they're trolls or just complete assholes judging by their post history.\n\nI tried to assure him that the UK government will pay non-essential workers 80% of their wages, but he wasn't having it. He tried to say that I was getting emotional in the argument and that I should handle my emotions better, all just because I downvoted him (he was being an asshole by this point).\n\nIronically, he was complaining about getting downvoted (he was around -3 or -4 in his first comment) not once but twice, so I didn't take his comment seriously at all. Plus when somebody gets personal in an argument with me, I just walk away. Looking back though I think it was just a insignificant misunderstanding, as judging by his post history he wasn't from the UK.","isChecked":false,"level":1,"score":"1"},{"author":"GenKun1","body":"Me and 3 of my friends were playing a game called paranoid. One person asks another person something about the two people and the person being asked the question then has to pick someone. Whoevers picked has to land a coin on heads and asks what the question was. In this case it was who is better at sports. I picked someone let's say they're S. S flipped the coin and it landed on heads. I revealed the question. Let's call the other person A. A got annoyed and said that I had said that she was bad at sports when I hadn't I just said S was slightly better at sports but I didn't have much to base it on. She was mad at me for ages. I got annoyed at her. Later on, we had badminton in Pe. A beat S and A said to me that she was good at sports. I said that I had never said that she was bad at sports. This went on for the whole day and we eventually resolved it. Sometimes she brings it up and it annoys me. It was a game you're not meant to take it to heart.","isChecked":false,"level":1,"score":"1"},{"author":"Mortisha718","body":"Subtitles... I got into a fight over subtitles a few years ago with a friend,we were watching a show&the guy was basically torturing the woman(witch)for an answer of who the other witch was or who she was working with(some shit like that) anyway the woman witch then whispers into his ear&had the subtitles on the whole time so at this part she leans into him&whispers in his ear,it said something like “whispers inadvertently” something like that. So I’m like I wonder who’s name she said? Did she say the truth? Do you think she said her name? And he said she didn’t say anything... I said she just whispered to him&said a name.... he ended up getting rude&said she didn’t say anything I dunno what the Hell your watching then I got aggravated&said you don’t know how subtitles fucking work,what do you think she whispered shhhhshhhhshhh she whispered a fucking name&we went on&on about it&think we were pissed for hours and btw she whispered the wrong name","isChecked":false,"level":1,"score":"1"},{"author":"blue-n-yellow_panda","body":"Whether or not poptarts are able to be toasted, had to show her the box with the toaster on it","isChecked":false,"level":1,"score":"1"},{"author":"Vegan-Kirk","body":"Pickup basketball with my 2 brothers and my Dad not too long ago. We play 2 vs 2.\n\nMy brother was playing defense on my other brother as he dribbled down the baseline and went out of bounds (while dribbling the ball in bounds) to get away from my other brother who was guarding him.\n\n\"Turnover! We say, You went out of bounds!\" My father - one of those dudes that is stubborn to the point of blindly arguing for the wrong side says \"No he wasn't touching the ball while he was out of bounds, it was in the air!\" \n\nWe proceeded to argue about how you simply cannot dribble the ball while out of bounds for 15 minutes or so until we just gave up. He wouldn't even agree to let us shoot for the ball.\n\nPretty funny honestly, you don't see LeBron dribbling out of bounds to get around defenders on the baseline.","isChecked":false,"level":1,"score":"1"},{"author":"10xBaggers","body":"With my gf over an unflushed shit","isChecked":false,"level":1,"score":"1"},{"author":"AffectionateBeyond9","body":"Son’s dad got mad at me for buying him some shoes, after he whined demanding me to buy him some. It was truly awful.","isChecked":false,"level":1,"score":"1"},{"author":"jumaineclumunt","body":"My Dad not letting me plug my phone in to leave it to charge on a table next to him on Christmas day. He literally have no reason. It was so bizarre.","isChecked":false,"level":1,"score":"1"},{"author":"STACHEISTHECASH","body":"I remember once me and a friend argued about what was better: chicken nuggets vs chicken strips","isChecked":false,"level":1,"score":"1"},{"author":"PLEASE_DONT_HIT_ME","body":"Some dude fought me in a Petco cause apparently I took his parking space.","isChecked":false,"level":1,"score":"1"},{"author":"lmpod","body":"One time I was in a kids back yard with some friends and my crush the kid trys to star a fight with all of us because he is mad everyone backs off except me and my crush. She ends up getting hit and I instantly take him down he fights back but didnt stand a chance we are both light people but I'm athletic he was scrawny in the end we left while still yelling at him.","isChecked":false,"level":1,"score":"1"},{"author":"Paragon-Hearts","body":"Trying to convince an ex that in order to make changes in a relationship, we need to discuss what we both would like changed. \n\nApparently the correct answer was “bottling up every little issue and sharing said issues with everyone except the person you are dating”","isChecked":false,"level":1,"score":"1"},{"author":"nothingfancyjustme1","body":"I once has an argument with an ex boyfriend about whether or not Dave Grohl was the drummer in Nirvana. He refused to accept that I was right ( Even when showing pictures of him with the rest of the band). I packed my stuff and moved 250 miles away the next day. I figured if he was that ignorant he wasn't worth it and more dumb arguments would surely happen frequently in the future.","isChecked":false,"level":1,"score":"1"},{"author":"One_Hundred_X","body":"Someone is trying to fight me right now on Reddit because I saw a pic of a stream in Rochester and stated that if the sediment clears, obviously it'd look better and but I never said there's anything wrong with it.","isChecked":false,"level":1,"score":"1"},{"author":"DrippinNSlippin","body":"I once got to listen to my friends fight over whether a jacket should be on the hat stand if it's been there for more than a month because if it's not being used, it's just decorative & should be put away.\n\nThey fought about that for over an hour.\n\nNext day they fought about whether a plate should be in the sink the next morning. For over an hour.\n\nThe entire time they were saying shit to each other like \"This is important, we need to communicate healthily if we're going to live together\" all the while I'm thinking this is the most ineffective communication I have ever seen in my life.\n\nNaturally, both times ended with them still feeling the same way but emotionally exhausted but they thought it was \"healthy communication\" because I don't fucking know.","isChecked":false,"level":1,"score":"1"},{"author":"SpaceLemming","body":"Time travel, we were only dating at the time but I’m on the team that an inciting event has to occur to cause a loop while my wife defends that the loop occurs because it always has because of said loop. 3 hours we fought and have settled on disagreeing.\n\nSecond was about Adam/Atom ant, somehow we went for too long arguing his attire without mentioning being a musician or a cartoon. It wasn’t until she said “look all I know is he dressed like a cowboy” and I responded with “maybe in a episode but he always wore a little sweater with an A on it” and things clicked when she asked “what do you mean ‘in an episode?’”","isChecked":false,"level":1,"score":"1"},{"author":"Illsleepinaminute","body":"I sang, “oh what a feeling, when we’re dancing on the ceiling”. He interrupted to tell me that was stupid, you can’t dance in a ceiling. The proper way is “dancing on a feeling”\n\nLegit argued for way longer that it would have taken us to google. \n\nAte dinner mad. I still can’t believe we had a fight about that","isChecked":false,"level":1,"score":"1"},{"author":"vickyswaggo","body":"Setup of distillation columns. We had to separate propane, propene, and propadiene. Propane and propene are closer in vapor pressure than either are to propadiene (It is harder to separate propane and propene from each other than it is to separate either from propadiene).\n\n&#x200B;\n\nMy logic was to have our first column separate out the propadiene, then have the second column separate the propane and propene from each other. In this scenario, the second column could be fine tuned for  this specific separation and wouldn't have to deal with massive flows. We'd also have a high yield of propadiene.\n\nMy friend's logic was to have the first column separate propene out, then have the second column separate the propane from the propadiene. In this scenario, the propene stream isn't contaminated with propadiene, only with trace amount of propane. The second column can do a very easy separation of propane and propadiene.\n\nWe argued for like 30 minutes. The professor was like \"omg, nobody cares, their vapor pressures aren't that far apart, just run it in Aspen\"\n\nThat being said, *I was right*. My scenario is cheaper because our second column can be skinnier (albeit a tiny bit taller), and I also got acceptable purities in my streams. My friend got amazing purities, but his columns were enormous and he required like 1.5x the energy mine did.","isChecked":false,"level":1,"score":"1"},{"author":"Str33twise84","body":"Whether a flake snow was like a combination of a flake and a twirl... tense and unrelenting all night long","isChecked":false,"level":1,"score":"1"},{"author":"QueenSkunky","body":"I pronounce the word “gerbil” as “jer-bul”. My mother got PISSED and told me it’s pronounced “Gur-bull”. She was legitimately enraged, I still can’t figure it out. She yelled for at least an hour about how stupid I was, and how there’s no WAY I was so stupid that I didn’t know how to pronounce gerbil and I was clearly messing with her which makes me an awful child. Throughout the day I had family members coming up to me awkwardly like “oh man, you can’t pronounce gerbil? Everyone KNOWS it’s gur-bull!” I know as a fact my mother set them on me and they came after me to get on her good side. Over the pronunciation of gerbil. To this day, five years later, if I suggest something or try to correct something I’m met with “yeah, but you couldn’t pronounce gerbil so who gives a shit what you think.”\n\nGod I can’t wait to move out. \n\n\nFun fact, we were at a pet store a few years after this and I was looking at the small animals. They happened to have a gerbil, and one of the employees came over and asked “do you want to pet the gerbil (jer-bul)? She’s really sweet!”\n\nMom went red in the face and haughtily replied, “No, we wouldn’t like to pet the GURBULL, thank you. We don’t need any more pets, especially not a GURBULL.”\n\nThat poor employee looked so tired. Mom accused me of “setting her up”. Good times.","isChecked":false,"level":1,"score":"1"},{"author":"Feral-forest-gremlin","body":"I have never heard anyone pronouns it any way besides jer bul and I would probably get mad if I overheard her being so loud and rude in a pet store over it","isChecked":false,"level":2,"score":"1"},{"author":"MulliganMG","body":"Is 1000 island the same as Russian \n\nAlso, what counts as “Calligraphy”","isChecked":false,"level":1,"score":"1"},{"author":"TheKong54","body":"this ones tough... by nature im just not very argumentative, in my mind if im gonna spend time and energy roasting you, it better be something roast worthy.... with that said people around me love to try and argue with me about damn near anything\n\nwith pretty much an endless library in my mind... one that's sticking out was I was driving home one afternoon and called my mom to see if I could get her anything from the grocery store (I was stopping at anyway) and drop off on the way....\n\nshe said cake (or maybe brownie) mix and get the one that said \"9x9\" pan size... I forgot what I grabbed but it was a wrong pan size... upon presenting the box of baking sugar to my mom... almost immediately she asks me \"when am I gonna fucking grow up and blah blah blah\" I honestly forget what growing up had to do with brownie mix... so I calmly opened the box, took out the bag, and punted that shit all over her back porch... then said something like \"now you got zero by zero brownies!!\" then left\n\nthis was NEVER spoken of since","isChecked":false,"level":1,"score":"1"},{"author":"MamaMoosicorn","body":"Whether or not to wrap my dd's birthday present.\n\nOther dd had a birthday 2 weeks prior and got a present that wasn’t wrapable. This dd was getting a present that could be wrapped. I wanted to wrap it. Dh didn’t want to because it “wasn’t fair”. It ended up with him storming out and me giving in.","isChecked":false,"level":1,"score":"1"},{"author":"Northman67","body":"When I was a teenager my friend and I got in a rager about which was the largest river in the world. I said it was the Amazon he said it was the Nile. We even bet money which never got dished out. this was before the days of the internet so eventually we looked it up and it turns out that the Nile is longer but the Amazon has more volume.","isChecked":false,"level":1,"score":"1"},{"author":"KenKaneki94","body":"Literally had some dude argue with me over a table being moved. Devolved into him calling me a spoiled brat and me telling him that he was just jealous my parents love me and enjoy being around me. I felt not one drop of remorse afterwards.","isChecked":false,"level":1,"score":"1"},{"author":"WhyIsLifeAPotato","body":"Whether or not UPS trucks were brown or black.","isChecked":false,"level":1,"score":"1"},{"author":"Jimmy-the-Clown","body":"Every single one I had with my ex 😎","isChecked":false,"level":1,"score":"1"},{"author":"wbotis","body":"My freshman year of college, my girlfriend made me a mix cd from songs she downloaded off of Limewire. One of them was “I’m Too Sexy” by Right Said Fred, but it was labeled as being by MC Hammer. I pointed this out to her, and it caused a fight to rough, we didn’t speak for a week.","isChecked":false,"level":1,"score":"1"},{"author":"cajunshit","body":"Argument with my dad ,at 2A.M when i woke up for a drink, about whether the chocolate or milk goes first...","isChecked":false,"level":1,"score":"1"},{"author":"psiloryben","body":"My old roommate and I would argue for *real* about Smash.  \n\nWe're best friends and we don't hold any hard feelings, but we won't play Smash because we know how it's gonna go.","isChecked":false,"level":1,"score":"1"},{"author":"honeybunsdagreat","body":"Me and my friend have lots of these while playing online with each other that always get blown way out of proportion, I’ll list the ones I remember:\n\nWe were playing some game where I had to spam a button over and over and I commented on how I wasn’t sure if he had always been able to hear it when I spammed buttons. He said he had always been able to hear it and had told me about it before. I said he hadn’t and asked for when it had happened. He said he couldn’t possibly remember, but then, after more screaming, he came up with a specific date and time. I called bullshit and it just got worse from there.\n\nI was playing online with him again and said he had to go do something and left for about half an hour, muting his mic. I turned on some music and started singing along. He came back earlier than I thought he would and didn’t started listening in. I finished up and he unmuted and said that he thought I was a “lovely singer”. I got mad that he had been listening to me without my knowledge and he said anyone would have because I didn’t normally sing. I thought he acted really creepily and he thought that anyone would have done the same in his situation. \n\nThis one is probably the stupidest one. I was reading through some subreddit and saw a post that mentioned “granny panties”. I read it out to him and he asked whether or not I myself was familiar with granny panties. I said I wasn’t, as I am not an owner of any granny panties. He asked if I was being serious and I said yeah, why, do you have a secret stash of your own. He got angry, called me a retard, and asked me how I could possibly not know what granny panties were. I said I know what they are, I’ve just never had any myself. He got angry that I interpreted his question like that and I got mad that he called me retarded for something so stupid. \n\nWe’re still good friends and I can’t wait to get in another stupid ass argument.","isChecked":false,"level":1,"score":"1"},{"author":"lordsnackenonchips","body":"Whether playstation controllers are better than xbox controllers (AND THEY ARE) becuase of AA batteries or charge cord, over all you save more money","isChecked":false,"level":1,"score":"1"},{"author":"vanishingpals","body":"i (f) had a two-hour long debate with a classmate (m) over whether all male teachers keep some sort of hardware in their classroom. my argument was that it's not true and that's lowkey sexist, and his argument was that it's true. by the end of the two-hour block, everyone in the class was listening. 5 minutes before the bell rang, our teacher (m) stood up from his desk, walked to his closet at the back of room, and pulled out a hammer and a screwdriver. (if he had done that in the first place, we could've fixed the wobbly desk and moved on, goddammit.)","isChecked":false,"level":1,"score":"1"},{"author":"ThePeasantKingM","body":"I don't remember the details, but an Ecuadorian friend was arguing with me, a Mexican born and raised, about Mexican cuisine.","isChecked":false,"level":1,"score":"1"},{"author":"Krom27","body":"That Trump isn't that bad","isChecked":false,"level":1,"score":"1"},{"author":"RedJackOfClubs","body":"All of them? I can't think of a single time arguing was ever worth it.","isChecked":false,"level":1,"score":"1"},{"author":"goodannoying","body":"my sister and i got in a very heated, physical fight over a chicken tender that we both wanted to eat. it got so bad we were punching and kicking each other, and even through things at each other. \n\ngenuinely one of the worst fights we’ve ever had all over a chicken tender neither of us ending up eating, because one of us threw it on the ground and stomped on it.","isChecked":false,"level":1,"score":"1"},{"author":"speculates","body":"How many people are in the band LMFAO.","isChecked":false,"level":1,"score":"1"},{"author":"jimdandy19","body":"Whether or not ear candling is a legit thing to do.","isChecked":false,"level":1,"score":"1"},{"author":"oager2001","body":"That is Canadian bacon on a egg mcfuffin not ham.. Also that ferel cats can live in barrow alaska outside in winter. I even called barrow animal control they hung up on me.","isChecked":false,"level":1,"score":"1"},{"author":"dis690640450cc","body":"One time I had really convinced myself that Geena Davis and Kelly LeBrock were the same person. I bet twenty dollars I didn’t have that Geena Davis was in the movie Weird science after arguing with my friend. I thought there was no possible way he could be right because he couldn’t tell me LeBrock’s name, and he thought Geena Davis was Julia Roberts.","isChecked":false,"level":1,"score":"1"},{"author":"99999999699999999","body":"The difference between aqua and teal, their brightness and the green/blue percentages of both","isChecked":false,"level":1,"score":"1"},{"author":"PolarTaki","body":"This was an argument over Snapchat. I jokingly posted on my story something about Capricorn men being toxic and Capricorn women being goddesses. He screenshot it and posted it on his story passive aggressively saying Capricorn women were just as, if not, more toxic (Because I am a Capricorn female). We went back and forth as we dug into each other’s birth chart and it gradually got more violent and personal. It went from talking about each other’s birth charts to digging in on each other about each other’s personal issues and ex-boyfriends publicly. We’re not friends anymore. 7+ year “best” friendship ruined.","isChecked":false,"level":1,"score":"1"},{"author":"ExplodedParrot","body":"Whether making a law banning moustaches makes you involved with a moustache. This will take some explaining but me and my dad were talking about 3 people, 2 had moustaches the other was Alexander the Great. My dad mentioned that he banned his soldiers from having facial hair and I said \"so all 3 have something to do with a moustache\". Cue nearly 20 minutes of arguing whether Alexander's law constitutes an involvement with moustaches.","isChecked":false,"level":1,"score":"1"},{"author":"SoberHermit","body":"My friend and I argued for at least 10 minutes about who wrote Piano Man. This was before smart phones and he didn't have internet at his house. We both stuck to our guns, never conceded, and decided to just burn another one down over the whole thing.","isChecked":false,"level":1,"score":"1"},{"author":"saunaflower","body":"The first time I watched Inception was with my boyfriend and we had a major disagreement on if he was still in a dream or not at the end of the movie","isChecked":false,"level":1,"score":"1"},{"author":"friedpickle_engineer","body":"I was on a bus trip into the middle of nowhere Australia with a bunch of classmates and no wi-fi. I ended up getting into an hour long argument with a guy over whether nauseous was pronounced like \"nosh-us\" or \"naus-ee-us\". I said it could be pronounced both ways and he said it could only be pronounced as \"naus-ee-us\". We got onto a whole other debate over whether nauseous was even a real word (he claimed it wasn't and the only true word for feeling sick was \"nauseated\"). Didn't get super heated, but the argument did go on for a really long time lol.","isChecked":false,"level":1,"score":"1"},{"author":"maki_0","body":"When I was in high school, I had a friend who pronounced tiramisu like \"turr-muh-soo.\" It irritated me so much that I went around and asked all of my friends how to pronounce tiramisu. Half of them had no clue, 1/4 of the people in our school said it \"turr-ah-muh-soo\" so similar but not exactly like her, and 1/4 said it like the actual Italian pronunciation.\n\nNeither of us were satisfied, so I went to ask my internet friends. All of them said it correctly so I went to tell her, and after that she never talked to me again.","isChecked":false,"level":1,"score":"1"},{"author":"MissMetalSix","body":"There are only a few days in my life so far that I don’t like thinking about at all. One of them was the morning that my mom went extremely out of her way to insult and humiliate me after finding out that I ran out of mascara before going to take our updated passport photos. I just screamed at her to stop but she wouldn’t shut up. If it weren’t for the bad quality of the final picture, you’d be be able to see the tears on my face.","isChecked":false,"level":1,"score":"1"},{"author":"ir_blues","body":"I got this job on a constuction site in a different state, they needed more people quick so i got my best friend in there too. We shared a tiny appartement for some weeks.\n\nThe debate if a bicycle needs more break power on the front or the rear wheel led to heated debates, lots of yelling and then not talking at all for a few days.  \n\nWe couldn't check, that was before the internet (well, before mobile phones) and also, there was no bicycle anywhere around to check.","isChecked":false,"level":1,"score":"1"},{"author":"Mediocre-Clementine","body":"Light pollution. I used this term to refer to man-made lights interfering with the ability to see the stars— my fiancé REFUSED to accept that term because “you can’t call it pollution if it doesn’t actually cause harm to anything”. I vividly remember screaming at him from the drivers seat on the way to the grocery store because he was being unreasonable because ‘light pollution’ is 100% the correct term. \n\nSince he’s too stubborn we had to compromise with the term ‘light interference’ and to this day it’s the dumbest heated arguments we’ve ever had. I still maintain that I’m right tho aha","isChecked":false,"level":1,"score":"1"},{"author":"ExhaustedPolyFriend","body":"One of the first fights my SO and I had was over him putting bread I'm my ear.\n\nSetting the scene: I worked 6-2 shifts so in the afternoons I was pretty tired and would sometimes nap before he got home. So I was resting in bed and he came home and 4 or whatever and was eating a piece of bread (as you do). \n\nSo he thought that a fun way to bug me would be to come into the bedroom and put the tip of bread into my ear a little. I got very offended, probably overreacted but I was just in no mood. And he then proceeded to get offended by my tone when I told him to fuck off.\n\nThen I got mad because he was upset by something that could have been avoided if he'd simply NOT put bread in my ear.\n\nWe parted ways, cooled down, and made up. But we were both pretty angry for a while. It's one of our more memorable fights, we're still together. \"The incident\" was almost 4 years ago. We don't fight often, but when we do... Oh man. \n\nMost recently, we had a fight because I didn't know who his french teacher was.","isChecked":false,"level":1,"score":"1"},{"author":"ameyetheass","body":"If we should cook the sauce separate from the spaghetti or add it after we drained the water.","isChecked":false,"level":1,"score":"1"},{"author":"Kjorteo","body":"I ended up having a near total meltdown over whether Double Dragon III: The Sacred Stones (NES) was considered by the public at large to be a good game.\n\nTo clarify: I love that game.  I know the arcade version has issues but the NES version is great.  But... well.  There are games that I love because they are legitimately high-quality, critically acclaimed all-time classics--your Super Metroids and Mario 64s and whatnot.  On the other hand, there are games that I love because they're honestly kind of janky and ridiculous, but maybe I grew up with them and have a nostalgic soft spot, or there's just something endearing about them, I don't know.  It's like an Academy award-winning timeless masterpiece versus your favorite cult classic from B-movie night with your friends; you greatly enjoy and will unironically defend them both, they're both great and you love them, but... deep down, you know.\n\nExcept that I *didn't* know.  I always thought Double Dragon III was an acclaimed quality game adored by the masses, and then friend made an offhand remark putting it in the \"kusoge that I like anyway because I'm me and my tastes are just kind of like that\" pile, and I had an existential crisis akin to being told I was adopted.","isChecked":false,"level":1,"score":"1"},{"author":"doc_moses","body":"My brother didnt believe me when I told him that New York was named after Yorktown. He thought they just named it New York for no reason. He couldnt except it.","isChecked":false,"level":1,"score":"1"},{"author":"ktran31","body":"This was a couple years back, I asked my girlfriend from high school for some cash during lunch to get some food from the cafeteria, I decided on getting mac and cheese and an apple juice. This is when my girlfriend freaks. She got upset that I didn’t get something that we both liked like mash potatoes and starts giving me attitude. I started getting irritated and remembered a classmate of mine owed me some cash and I demanded he give me the money so I can get this girl some mash potatoes to shut her up. I ended up getting the mash potatoes, gave it to her, and sat on the other side farthest away from her at the table.\n\nIt just made things worse.\n\nShe then got up, slid the mash potatoes towards me and stormed off. At this point I was so heated, everyone there was looking at me knowing I was about to explode, and I did. I threw the apple juice on the floor causing it to explode and TRIED to whip the Mac and cheese and potatoes in the garbage (I completely missed and made a mess on the wall). And went upstairs to confront her.\n\nI eventually found her at our locker (we shared lockers) and started freaking out. It got nasty to the point where teachers who had class near our lockers had to stop teaching and tell us to relax. You could literally hear us screaming from hall to hall. She slapped me across my face in front of everyone and stormed off, and I just sat down on the floor thinking what just happened, then one of my classmates went up to me and asked if everything was okay, that’s when I just completely broke down and just got up and went home. \n\nWe eventually cleared the air and made up, she’s still my girlfriend and I love her so much, it was just high school and we were young and always finding ways to pick fights, to this day she always gets embarrassed and kisses me sorry when I bring it up to tease her.","isChecked":false,"level":1,"score":"1"},{"author":"malomia","body":"I dated someone with some anger issues and it drove him INSANE that I would look something up when I didn’t know the answer. I didn’t think that was unreasonable. He, however, was adamant  that I “just wonder about it and try to come up with possible answers on [my] own.” That was so absurd to me. Of course I already thought about it and came up with some ideas, but now I want to know, like...how solar flares actually impact Earth, because I’m probably not going to come up with that answer in an afternoon. I refused to let him win those, but jeez, what a trivial thing to turn purple over.","isChecked":false,"level":1,"score":"1"},{"author":"Redditer48634","body":"Who gets to use the biiger beanbag a few days back. Don't ask.","isChecked":false,"level":1,"score":"1"},{"author":"Bellamybells","body":"She hit me in the head with a canoe paddle and blamed me for it","isChecked":false,"level":1,"score":"1"},{"author":"Screechowl45","body":"Whether black was an intense colour or not","isChecked":false,"level":1,"score":"1"},{"author":"BatWithAGun","body":"In undergrad, my roommates and I were watching the Lizzie McGuire Movie. Me and one other roommate are both stubborn and have good memories for insignificant details. She casually mentioned the room number of Lizzie's hotel room (I don't remember why). Well, she was definitely wrong, and I had to point out it was actually Room [X], not Room [Y]. We both insisted we were right and actually rewound the movie to check. Turns out it was a continuity error and we were both technically correct - two different room numbers are shown for the same room at different points in the movie. Biggest waste of 10 minutes of my life.","isChecked":false,"level":1,"score":"1"},{"author":"badjumanji","body":"My dad and I got into the worst argument we have ever had because he said the main ingredient in Tylenol was “tylemine.” I told him that tylemine is not even a word and that it was acetaminophen and he lost his shit because I was “Just trying to make him feel stupid.” He also said that acetaminophen sounded like a made up word.\n\nMy dad and I have a great relationship but that argument ended with tears. OVER A FAKE WORD. We also had this type of argument because he insisted that the lead singer of Rascal Flatts is a woman.","isChecked":false,"level":1,"score":"1"},{"author":"thisisnotdan","body":"[This one](https://www.reddit.com/r/todayilearned/comments/10e21i/til_that_dropping_molten_glass_into_cold_water/c6cs9wn/?context=8) is one of my favorites (you can skip the top comment if you don't wanna read it all).","isChecked":false,"level":1,"score":"1"},{"author":"MindYourOwnBiscuits-","body":"Whether or not a paper towel roll has 2 holes or 1. I am in the firm 2 hole party but my husband is a firm believer that it's one hole. We then went into a lengthy discussion and brought in lots of different people to get there opinions on different objects. How many holes does a shirt have? What about a pipe with a T joint? By the end of it we were all very upset and disgusted with the people not on our side.","isChecked":false,"level":1,"score":"1"},{"author":"A-R-R-O","body":"Since this whole thing is happening, my friend (who I had borrowed a game from) asked for me to put it on my porch and he would pick it up, after that, I went out into the woods to be alone and draw, which was about a 30 minute walk away, one of them had moved it, and when I told them to put it back, they continued to say “just come back and do it” why can’t you just do a simple thing instead of being lazy? I don’t understand anymore","isChecked":false,"level":1,"score":"1"},{"author":"kalazaoo","body":"Okay so I had recently got some news shoes from the internet ( I really liked those shoes and was very excited when I got them ). \n\n\nSo I was out with my best friend( like super best friend at the time we were legit 24/7 hanging together ) walking when he noticed my new shoe's colour and he was like , hey man what did you go and buy orange shoes for?\nAnd I explain to him that my shoes werent orange, they were in fact red, so we went back and forth with this conversation  and both of us being stubborn we ended up shouting and cursing at each other heavily canceling our plans and just going out separately while having 0 contact for the rest of the day.\n\n\nOh and the colour we were arguing about was in fact crimson red.","isChecked":false,"level":1,"score":"1"},{"author":"LiaLovesCookies","body":"Jokingly asked my dad why he stole the chips I bought for my sister, which somehow started a whole argument between the entire family. Fuck those Takis dude","isChecked":false,"level":1,"score":"1"},{"author":"Justin_92","body":"The other day me and my wife were on day x of quarantine and she suggests something to watch to which I reply that I don’t really want to watch that. She huffily says fine so I tell her “no go back we can watch it. This is your time anyways, I’m technically supposed to be at work right now.” She continuously refuses until I threaten to get up, unplug my Xbox, and throw it off the balcony. She laughed and called my bluff so I yanked it from the cubby and sent her sailing. This is not my normal response to anything, let alone something so trivial but I think maybe nicotine withdrawal played a role? Idk but it kind of concerns me now that I read it typed out. I think I need help...","isChecked":false,"level":1,"score":"1"},{"author":"Evonaut","body":"Had a fight about who would win: a scorpion VS an armadillo. \n\nThis really got heated with friends, and it became one of those fights you kept bringing up no matter how long it had been. Like we’d ask new friends to get more on each others side. We even started adding variants to the scenario : favoring environments, the animals teaming-up with others on some gang shit (the crab, lobster, scorpion trio was the most aesthetically pleasing one), if they were blood thirsty, intelligent, etc.","isChecked":false,"level":1,"score":"1"},{"author":"sohamjaiswal10","body":"Between me and my friends: Which pronunciation to use while saying buffet in our general discussions. We still have not come to a conclusion.","isChecked":false,"level":1,"score":"1"},{"author":"kat7459","body":"Whether the driver or passenger gets to decide the radio station. Preceded to get into a button-pushing battle over our favorite preset. I almost broke up with my bf over this shit","isChecked":false,"level":1,"score":"1"},{"author":"ImperialSupplies","body":"Imagine knowingly dating a Narcissist and active drug addict. Pretty much every conversation we had was a useless heated argument.","isChecked":false,"level":1,"score":"1"},{"author":"rhett342","body":"When I was in high school my dad wanted to argue about curfew to e for me.  I wanted to be home at 10:30 and he was dead set on arguing about it because he wanted me home at 10:30.\n\nNope, no typos there either.","isChecked":false,"level":1,"score":"1"},{"author":"souper-succeth","body":"Arguing with some kid about what time period the Incredibles takes place in. I said 70s while he said 50s. It took up the entire period until I looked it up later and it said it took place in the 60s. It got really heated tho.","isChecked":false,"level":1,"score":"1"},{"author":"EHXKOR","body":"Literally today. A customer at work insisted that she could collect $100 in points on lottery tickets even when her total was $1 (she had won 99 from her previous set and used it to buy more). We do not do points for lottery tickets at all but of course because she’s a bloody entitled boomer she believes she is right and I, the one who has been doing this job for 2 years, am wrong. When she didn’t get her way she just began throwing petty insults, treating me like I’m an incompetent child, and of course threatening to bitch to corporate. She even talked down to the other staff on shift with me when they took my side. God I wish I could have beaten her blue but I don’t got the balls for something like that.","isChecked":false,"level":1,"score":"1"},{"author":"LordBadgerFlaps","body":"Massive argument with my sister because I said people with gigantism felt more pain, she said it was premature babies who felt more pain.","isChecked":false,"level":1,"score":"1"},{"author":"WankSpanksoff","body":"Full on shouting match over whether or not onions photosynthesized","isChecked":false,"level":1,"score":"1"},{"author":"farawyn86","body":"2 days ago. My mother told me face masks are now required for everybody when going out. Linked me an article that said it was required for all workers who interact with the public and that it's *recommended* for the general public. We got into a heated debate over if I had to wear a mask or not.\n\nAt no point did I say I wouldn't wear a mask or anything, but we were being so pedantic about the wording that the argument ended with: \"Well fine, then catch the disease and die!\" \"Love you too, Mom.\"","isChecked":false,"level":1,"score":"1"},{"author":"TheZeldaniac","body":"I told my friend that white chocolate was invented by the 8th grand wizard of the KKK after they refused to eat dark chocolate. Somehow that went from a joke to an argument","isChecked":false,"level":1,"score":"1"},{"author":"RayAnselmo","body":"Me and a friend argued for a half-hour about what city was the real hub for the Rocky Mountain region. I advocated for Denver, him for Phoenix. Neither convinced the other.\n\nBut seriously, it's Denver.","isChecked":false,"level":1,"score":"1"},{"author":"IdentityUnknown__","body":"Not me but I was at a friends place for drinks and a T-Pain song comes on and these two guys start arguing the lyrics like one is singing \"apple bttom jeans, boots with the spur\" and the other guys saying \"no its actually boots with the fur\". The dispute esculated and within 10 minutes they were fist fighting and the evening was topped off with neighbours calling the cops, one guy breaking a pool cue over the other guys head and both of them getting arrested in the middle of the road in front of a crowd of concerned neighbours.","isChecked":false,"level":1,"score":"1"},{"author":"Chakinz","body":"Wether brown colored eggs are called red eggs. I swear they are but its such a stupid thing to argue about that i couldn’t find any information about it ever since the argument  happened two years ago","isChecked":false,"level":1,"score":"1"},{"author":"ghostkill14","body":"When I had to yell my mom to shut up in the nicest way possible because I had to get into a meeting with a certain elective at my school that she agreed to take me to but tried to say we dont have to go and they will accept it but in reality what they will do is completely deny my application.","isChecked":false,"level":1,"score":"1"},{"author":"itsallalittleblurry","body":"“If you’d stop mumbling, I could understand what you’re saying!”                                                                        “If you weren’t deaf, you could understand what I’m saying!”","isChecked":false,"level":1,"score":"1"},{"author":"Katofdoom1","body":"I had a massive argument with my friend once about veganism, with lots of photos research and aggressive points over messenger and i ended it with \"get off my back, I DONT CARE\". We didnt talk for the next couple days. Its okay now though","isChecked":false,"level":1,"score":"1"},{"author":"ghostkill14","body":"When me and my sister got in an argument over the used to be shared pet bearded dragon because she wouldn't do anything with the bearded dragon and still claimed that it also belonged to her.","isChecked":false,"level":1,"score":"1"},{"author":"yebehet","body":"When I was 5, I met a distant cousin named Trinity. I was baffled because there was a girl in my kindergarten class also named Trinity and I didn’t believe my distant cousin’s name was the same as my classmate. I refused to believe it and told her that her name doesn’t belong to her because I already knew one Trinity already. I got so mad that I started crying and told on her to my mom but I obviously got a talk about how some people have the same name 🤷🏻‍♀️","isChecked":false,"level":1,"score":"1"},{"author":"insicknificant","body":"This just happened a few days ago, but yeah. So I live with my sister, her fiance lives with us and does not pay rent whilst her and I do. She has always disliked my boyfriend because he smokes weed, but anyways. He stayed with me for a few days while my sister was staying with my parents. I told her he was staying with me and she immediately got mad and said I had to take him home and if he stayed again she would kick me out. I'm really confused at this point and trying to get answers out of her but she never really has facts to back up her arguments, she just always thinks she's right. Basically she called him and I names and I demanded to know why she was so against him staying with me, and she said some bull like she's afraid he's going to steal from her and he doesn't respect her property. I've known this dude for almost 3 years, been dating for 1, and she's known him almost as long as me, and she has literally no reason to say that stuff, (he's never been rude to her, never disrespected her, never stolen anything in his life)  tbh it really upset me and we are not talking now, if I didn't live with her I would cut contact altogether. To make it worse my mom (she's very religious and gives me constant shit for staying the night with my bf and vise versa) told me I should listen to her because she's family! But no matter what I say I am always wrong with them.  Sorry for the long post I'm just very frustrated and upset.","isChecked":false,"level":1,"score":"1"},{"author":"TwoSnapsMack","body":"Older brother neglected to invite me to watch a movie while everyone else in the family went to the theater. Everyone in my immediate family apologized to me while he refused to acknowledge his neglect, despite me telling him that I really wanted to see said movie (it was the Joker) the night before.","isChecked":false,"level":1,"score":"1"},{"author":"TrueSmiter","body":"I'm taking some pills know, remind me to let you know in a year lol.","isChecked":false,"level":1,"score":"1"},{"author":"TapirandSara","body":"I was about to go to the movies with my (now ex) girlfriend but just needed to shower so we could take off. We had plenty of time before the movie started and I shower in under 10 minutes anyway. She casually suggested I forego the shower but I politely refused. She pushed back, nicely at first, but became more insistent with my continuous refusals. This continued for some time and we eventually end up arguing quite heatedly about why I felt the need to shower before we go out like it’s some great mystery. She even yelled “who are you trying to impress?!!” at one point. The fact that I just want to be clean was apparently lost on her. We argued for muuuuuch longer than it would have taken me to shower. I eventually just walked away and showered because why the hell wouldn’t I? She was pissed because she didn’t get her way and my opinion of her sunk even more. \n\nI later found out that she would sometimes go 2-3 days without showering so maybe that had something to do with it. Surprisingly we are no longer together.","isChecked":false,"level":1,"score":"1"},{"author":"fleurdecerise","body":"It was about the right way to draw a pattern. It went so far that he rose his hand and I thought he is gonna punch me. Even though he never turn violent, but in that moment I was really scared.","isChecked":false,"level":1,"score":"1"},{"author":"k4t0y4i","body":"Whether or not to buy games physically or digitally. We both eventually agreed that it depends on the context","isChecked":false,"level":1,"score":"1"},{"author":"RoundaboutFlare","body":" [https://www.youtube.com/watch?v=CUOD8kuPnNg](https://www.youtube.com/watch?v=CUOD8kuPnNg)","isChecked":false,"level":1,"score":"1"},{"author":"Unique-Ball","body":"The proper way to cut open baked potatoes ended with yelling.","isChecked":false,"level":1,"score":"1"},{"author":"meepbotl","body":"I got into an argument with my mom as to whether you should screw the cap off a bottle or screw the bottle from under the cap. She thought the latter was absolutely sacrilegous but I see nothing wrong with it.","isChecked":false,"level":1,"score":"1"},{"author":"TRKrexel","body":"Might be a little odd but whatever lol","isChecked":false,"level":2,"score":"2"},{"author":"stgiga","body":"Arguing with my dad over a lost paper","isChecked":false,"level":1,"score":"1"},{"author":"ThePeasantKingM","body":"Are you my dad? He had an argument with my grandpa over a certain document my grandpa was adamant was printed in green paper, when no official document is printed in such kind of paper.","isChecked":false,"level":2,"score":"1"},{"author":"stgiga","body":"I'm a nonbinary 17 year old with ADHD, so no.","isChecked":false,"level":3,"score":"1"},{"author":"MaxLovesPizzaRolls","body":"It was between me and my family on the best way to cook pizza rolls, with them insisting that cooking them in the microwave like i do is disgusting, and that the oven was better. then i refuted, saying that the oven dries them out, and makes them hard. This was a long argument spanning over multiple days, until they realised that they could never convince me to put them int the oven,","isChecked":false,"level":1,"score":"1"},{"author":"HeadOverHeels337","body":"Oven takes too long, i just want my pizza rolls damn it","isChecked":false,"level":2,"score":"2"},{"author":"VeganVagiVore","body":"There's a mac & cheese brand I like, that comes frozen.\n\nYou can either zap it with the science oven for 5 minutes, or put it in the regular algae / coal oven for _50_ minutes.\n\nI wonder what the fuck it tastes like after cooking 10 times longer than it needs to. And whether the plastic serving dish survives","isChecked":false,"level":3,"score":"1"},{"author":"MaxLovesPizzaRolls","body":"EXACTLY bro, that's what I'm saying.","isChecked":false,"level":3,"score":"1"},{"author":"TreesToo","body":"Best way is in an air fryer.","isChecked":false,"level":2,"score":"2"},{"author":"One_Hundred_X","body":"Your fam was right","isChecked":false,"level":2,"score":"1"},{"author":"Hellfire110","body":"Me and my ex argued over each others taste in music over text. She listens to (c)rap and I listen to power metal. Honestly I don't miss that bitch at all.","isChecked":false,"level":1,"score":"1"},{"author":"JabTrill","body":"I've gotten into very heated arguments about if a hotdog is a sandwich","isChecked":false,"level":1,"score":"1"},{"author":"SFBushPig","body":"Insisted my sister NOT have an abortion, but wouldn’t commit to taking it and raising it, like WTF?   Put up or shut up....","isChecked":false,"level":1,"score":"1"},{"author":"Ni__ers","body":"Anything on Reddit, really. None of this shit matters but I love pissing off the typical redditor.","isChecked":false,"level":1,"score":"1"},{"author":"None","body":"[deleted]","isChecked":false,"level":1,"score":"-2"},{"author":"hertz037","body":">she freaked, broke loads of my shit and stormed out slamming every door on the way.\n\nWow, that was quite the display of toxic masculinity she put on there.","isChecked":false,"level":2,"score":"1"},{"author":"spliffwizard","body":"It was out of character for her tbf she just had a batshit moment, funny after though.","isChecked":false,"level":3,"score":"1"},{"author":"VeganVagiVore","body":"ESH","isChecked":false,"level":2,"score":"1"},{"author":"eatMYcookieCRUMBS","body":"That if I drive up to a stranger on the street and threw cum on them and drive away, they will never catch me.  My brother and friend insist that they could find and kill someone who did that.  There's no way.","isChecked":false,"level":1,"score":"0"},{"author":"ameliemelo34","body":"I absolutely love \"granny bags\" (trolley bags). Last year when I went into university I used to carry all my groceries in a backpack and always overestimated what I could carry. My back hurt a lot, I had to leave my bag down every 20m because it was too heavy. The cleaning lady (I love this woman) was worried about me and told me to get one. I got a boyfriend around the same time. Once we were about to go get groceries and I took that bag out. \"You're not taking this.\" I got really mad, why not? \"It looks absolutely ridiculous\". We had a huge (half joking) shouting match over it for one hour, fighting for the bag. He insisted he would carry it all, I insisted I didn't want his back to get bad too. In the end after one hour I broke down crying (he wasn't expecting that) and he let me take it with us. He never let me take it with us when we go shopping ever again though, but I get by with just a remark when I go shopping on my own and take it. It's almost a running joke between us","isChecked":false,"level":1,"score":"0"}],"id":"fv1w6x","submissionData":{"author":"aspiringyou","body":"","score":"158","subreddit":"AskReddit","title":"What is the most insignificant heated argument you've ever had?"},"url":"https://www.reddit.com/r/AskReddit/comments/fv1w6x/what_is_the_most_insignificant_heated_argument/"}