{"commentsData":[{"author":"1spikejr","body":"Egypt and Ethiopia are close to going to war due to Ethiopia building a dam on the Nile River. Ethiopia is diverting some water and limiting water flow to Egypt. The Ethiopian government is refusing to honor previous agreements made that detail the rate at which they will fill the lake behind their dam and they refuse to negotiate any further with the Egyptians.","isChecked":true,"level":1,"score":"15359"},{"author":"J-Harfagri","body":"Does Ethiopia have the military strength to take on Egypt? I don’t know much about Ethiopian military but Egypt gets over a billion dollars a year in military aid from the USA and have the largest standing army on the continent?\n\nEdit: wow this got a lot of attention. To clarify I was talking hypothetically. As some good commenters have pointed out an actual ground conflict between the two seems unlikely as Egypt would have to either get the permission of Sudan and S. Sudan to move troops through their nations or would have to invade them as well. \n\nThanks for all the great responses!","isChecked":false,"level":2,"score":"4050"},{"author":"bloth-hundur","body":"Nah, Egypt is second strongest arab nation\n\n\nedit: its arab nation not arabic \n\ni gotta stop scrolling reddit after 2am","isChecked":false,"level":3,"score":"2560"},{"author":"Dunkaroosarecool","body":"It depends on the type of war though. Ethiopia has wild geography, an invasion would by no means be easy. It sounds as if the Egyptian army would have to be the aggressor in this scenario. Egypt definitely has the stronger military, but it would be a Tough war to effectively“win”.","isChecked":false,"level":4,"score":"1927"},{"author":"messup000","body":"Why wouldn't Egypt just blow up the dam?","isChecked":false,"level":5,"score":"1271"},{"author":"woubeeee","body":"Ethiopia’s ally (Sudan, a nation situated between the two countries), won’t let that happen. Sudan supports the dam, without the dam they face huge floods followed by very low water, they want the water to be stable all year round. Sudan has publicly admitted they want the dam now. \n\nEgypt doesn’t have the logistic resources or numbers to run a multi-day campaign over 1,500 miles of hostile territory.\n\nEthiopia has high-tech military machinery that’s advanced enough to repulse any land or air-missile attack imposed by Egyptian military. If Egypt’s military forces tampered with the dam heavily funded by China and Italy, Ethiopia could easily retaliate very harshly by blowing up their Aswan dam, washing 95% of Egypt into the sea and putting Cairo underwater... \n\nAnd trust me, the west won’t sit back and watch a predominantly Christian country take a beaten by a Muslim one. \n\nEgypt= Muslim country\n\nEthiopia= predominantly Orthodox Christian, with an ancient Ethiopian Jew population that has significant ties backed and supported by Israel.","isChecked":false,"level":6,"score":"2624"},{"author":"BadSmash4","body":"Wow geopolitics are so fucking intricate. It blows my mind how well versed some people are, because that's one area in which I'm pretty clueless","isChecked":false,"level":7,"score":"1265"},{"author":"geofizic","body":"The Ethiopian military has an annual budget of $330 million. Egypt has more than 10 times that. Not to mention the recent shopping spree the Egyptian military has been on, RAFALE fighters, German Subs etc. In addition to the +200 F-16 that are operated by Egypt. On the over hand, Ethiopia only has 14 Su-27s and some Mid range Chinese SAMs. No where near enough to deny access to a determined aggressor,\n\nWithout a doubt Egypt has a complete military advantage over Ethiopia. This is without considering the close support they will probably receive from the Riyadh, Abu Dhabi, and Khartoum axes.","isChecked":false,"level":7,"score":"300"},{"author":"ks501","body":"That's it, I'm re-installing Civ. Thanks a lot.","isChecked":false,"level":8,"score":"63"},{"author":"geofizic","body":"Good use of quarantine time.","isChecked":false,"level":9,"score":"28"},{"author":"rpkusuma","body":"Egypt's biggest asset is the Suez Canal. People underestimate how important it is. All Egypt needs to do is refuse to let Ethiopian ships from passing. That's their biggest peaceful option. Ethiopia would get wrecked by Egypt. I'm sure the Arab League would back them up","isChecked":false,"level":2,"score":"26"},{"author":"nightwing2000","body":"But most of the ships don't belong to Ethiopia. If Egypt stopped letting, say, Chinese or Greek ships through because they had cargo from there, the world would be up in arms over restraint of trade.","isChecked":false,"level":3,"score":"26"},{"author":"-rwsr-xr-x","body":"The fast-tracking of a silent bill through the Senate to dismantle encryption, in the name of protecting the children from exploitation on the Internet. \n\nWhile everyone is trying to stay home, healthy and worry about the next weeks and months of their lives, they're pushing this one through during all the SARS-CoV-2 distraction. \n\nIt even comes with the specious naming of the \"EARN-IT Act\". \n\n* https://www.techdirt.com/articles/20200313/12014744094/epic-offers-support-earn-it-act-thinks-it-can-separate-undermining-section-230-undermining-encryption.shtml\n* https://www.wired.com/story/earn-it-act-sneak-attack-on-encryption/\n* https://reason.com/2020/03/18/the-earn-it-act-is-the-new-fosta/\n* https://www.theverge.com/interface/2020/3/12/21174815/earn-it-act-encryption-killer-lindsay-graham-match-group\n* https://bitcoinmagazine.com/articles/earn-it-the-us-anti-encryption-bill-that-threatens-private-speech-online\n* https://www.eff.org/deeplinks/2020/03/earn-it-bill-governments-not-so-secret-plan-scan-every-message-online\n\nThey're trying to get this railroaded through quickly before anyone has a chance to notice, and we can't roll it back. \n\nThe main issue with this proposed bill, is that it actually does nothing whatsoever to protect or prevent child exploitation on the Internet, and dismantling encryption across a broad range of products, while threatening companies with significant fees and fines for non-compliance, is fear-mongering.","isChecked":false,"level":1,"score":"2481"},{"author":"100uSeRnAmE","body":"If anyone wants to stop the EARN IT ACT you can sign here.we need at least 100,000 by April 16th\n\n[https://petitions.whitehouse.gov/petition/reject-earn-it-act-s-3398-which-threatens-free-speech-encryption-privacy-and-nations-cybersecurity](https://petitions.whitehouse.gov/petition/reject-earn-it-act-s-3398-which-threatens-free-speech-encryption-privacy-and-nations-cybersecurity)","isChecked":false,"level":2,"score":"326"},{"author":"TackleToast","body":"Do these things actually do anything? Genuine question","isChecked":false,"level":3,"score":"44"},{"author":"yloswg678","body":"Nope, just makes internet people feel better. Need 1mil+ and media attention to do anything","isChecked":false,"level":4,"score":"59"},{"author":"aiollywood","body":"Scientists found the first ever living animal - a parasite - that doesn't need oxygen to survive\nThis was in February\n\nLink here http://www.sciencealert.com/this-is-the-first-known-animal-that-doesn-t-need-oxygen-to-survive\n\nMore here (need subscription) but interesting abstract\nhttps://www.pnas.org/content/117/10/5358\n\n\n\"Our discovery confirms that adaptation to an anaerobic environment is not unique to single-celled eukaryotes, but has also evolved in a multicellular, parasitic animal. Hence, H. salminicola provides an opportunity for understanding the evolutionary transition from an aerobic to an exclusive anaerobic metabolism.\"","isChecked":false,"level":1,"score":"517"},{"author":"IANCONNERS","body":"When I suggested that extraterrestrial life could exist on a planet without oxygen due to them having different needs than human life my year 9 science teacher suggested I was stupid and that all life needs oxygen to survive , who’s the stupid one now peter.","isChecked":false,"level":2,"score":"37"},{"author":"S3aStruckSp3ll","body":"CRISPR was just successfully injected into a live patient to treat genetically-caused blindness. [Sauce](https://www.npr.org/2020/03/18/817811768/yep-they-injected-crispr-into-an-eyeball)","isChecked":false,"level":1,"score":"17551"},{"author":"MrHanSolo","body":"> Alex Salmon\n\nWoah that's awesome!","isChecked":false,"level":2,"score":"2497"},{"author":"recumbent_mike","body":"Much easier for him to tell which direction is upstream now.","isChecked":false,"level":3,"score":"1887"},{"author":"GTSBurner","body":"The scale of this discovery is huge","isChecked":false,"level":4,"score":"156"},{"author":"stuthebody","body":"The migration to this bio-tech will go swimmingly","isChecked":false,"level":5,"score":"41"},{"author":"Bar1no","body":"This whole situation is fintastic!","isChecked":false,"level":6,"score":"27"},{"author":"Jabullz","body":"CRISPR is both a blessing and horribly terrifying.\n\nEdit: As per usual, [Exurb1a](https://youtu.be/n__42UNIhvU) comes in handy to give levity to a heavy subject while giving great information. If you'd like to know the skinny on Genetic Alteration some of the science and ethics behind it, please give it a watch.","isChecked":false,"level":2,"score":"234"},{"author":"ThrowRA123qaz","body":"Pardon my lack of knowledge, but for those of us uneducated folks what's CRISPR? And how is it doing this.","isChecked":false,"level":3,"score":"92"},{"author":"loforten","body":"Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR - pronounced “crisper”) utilizes the Cas9 enzyme and a plasmid in order to “cut” DNA and insert the sequence of nucleic acids that you desire. In essence, one can select which parts of DNA that are undesirable and replace them with something else that is synthesized in a lab. Some ethical questions that arise are long-term implications of experimentation with humans, as they are unknown. This is a very brief review of it from a biochemistry undergraduate’s perspective. Pardon any mistakes.","isChecked":false,"level":4,"score":"52"},{"author":"Altec2001","body":"Basically genetic modification. It's good bc it can treat gwnetic diseases like said above, but it can be horrifying as it can lead to terrible things ie designer babies","isChecked":false,"level":4,"score":"148"},{"author":"Makeitifyoubelieve","body":"Real Life Create-A-Character","isChecked":false,"level":5,"score":"60"},{"author":"marissamars95","body":"The ozone layer is getting better","isChecked":true,"level":1,"score":"7069"},{"author":"animefan0903","body":"This is the first positive news i have read in this threat","isChecked":false,"level":2,"score":"1871"},{"author":"bossbozo","body":"It's been getting better and better for years. Since the ban of cfc's to be precise. This would not be news even without CoVid19.   \n   \nImportant side note: the ozone layer has nothing to do with the greenhouse gases layer. \n  \n To quickly distinguish between the two, the ozone layer filters out harmful UV rays, and is necessary for life as we know to exist on earth, this was being destroyed by cfc's however since the ban of, it has been slowly replenishing;   \nthe greenhouse gases layer is mainly made of CO2, the one of the main products of combustion (aka burning), thickening this layer causes global warming (averagewise) which causes climate change, erratic weather patterns, and extreme weather events. This layer is still getting thicker","isChecked":false,"level":3,"score":"219"},{"author":"haluura","body":"The earthquake in Zagreb.","isChecked":true,"level":1,"score":"3678"},{"author":"hoogar33","body":"Can't go outside because coronavirus. Can't stay inside because earthquake. That was a fun day.","isChecked":true,"level":2,"score":"327"},{"author":"fgebgruhg","body":"Don’t leave the doorframe!","isChecked":false,"level":3,"score":"26"},{"author":"None","body":"[deleted]","isChecked":false,"level":2,"score":"65"},{"author":"tilenb","body":"It's very likely that the Corona quarantine helped the death toll to be lower than it would be in usual circumstances. There was a church where the ceiling fell off almost entirely and it being on Sunday morning it would likely already start to fill up with people then...","isChecked":false,"level":3,"score":"197"},{"author":"tah_infity_n_beyarnd","body":"It did. From what I understand from my friends living there, Zagreb was shut down as of that morning basically, so most people were at home.","isChecked":false,"level":4,"score":"64"},{"author":"iidnats_34","body":"It also knocked out a bunch of hospitals, right in the middle of corona.","isChecked":false,"level":3,"score":"87"},{"author":"Linda_Prkic_","body":"A 15 year old girl died.","isChecked":false,"level":3,"score":"59"},{"author":"super_hoommen","body":"The nearly 2 year long Ebola outbreak in the DRC has ended. The last patient to be treated has survived!","isChecked":false,"level":1,"score":"44256"},{"author":"lemon_cello","body":"Wow! I was worried about this a couple of months ago but then the-pandemic-that-must-not-be-named took over my attention and I forgot about it.\n\nIncredibly brave people fighting ebola. Such a scary disease.","isChecked":false,"level":2,"score":"6781"},{"author":"super_hoommen","body":"Yeah, the people that get out there to treat patients are some of the world’s biggest heroes. I can’t imagine how scary is must be to be living in a place with an Ebola outbreak going on. Thank God it’s all over now. That was the last bit of positive news I got before all this started happening.","isChecked":false,"level":3,"score":"1759"},{"author":"saltywench77","body":"Ebola is insanely scary with an incredibly high fatality rate","isChecked":false,"level":4,"score":"89"},{"author":"Mistress-Dolly","body":"Earn It bill, it seeks to end encryption in the USA. It would be a huge hit to online free speech","isChecked":true,"level":1,"score":"15598"},{"author":"SurveyorMorpurgo","body":"If the bill only ends encryption in the USA, how does it work when Americans interact with encrypted sites registered to other parts of the world?","isChecked":false,"level":2,"score":"2825"},{"author":"notdevnotops","body":"Because they can't technically \"ban\" encryption. They could probably force app store owners (Google, Apple) to not allow apps that use it, but they cannot \"ban\" the technology.","isChecked":false,"level":3,"score":"2044"},{"author":"SurveyorMorpurgo","body":"Thanks for replying mate but how can they force companies to stop using it but not ban the technology? \nGenuinely trying to understand how this would work.","isChecked":false,"level":4,"score":"669"},{"author":"Estagon","body":"An example mentioned is that the government will no longer grant Section 230 protections to companies using end-to-end encryptions in the U.S.","isChecked":false,"level":5,"score":"392"},{"author":"SurveyorMorpurgo","body":"That's wild, will it likely pass?","isChecked":false,"level":6,"score":"97"},{"author":"BeginByLettingGo","body":"Everybody is focused on something else right now, too much to properly contest the bill.\n\nAlmost makes you think about the government's response to the crisis.","isChecked":false,"level":7,"score":"284"},{"author":"SurveyorMorpurgo","body":"Shady bastards, genuinely concerned about how the US government is handling the crisis.","isChecked":false,"level":8,"score":"189"},{"author":"BrokenDogLeg7","body":"Never let a good crisis go to waste.","isChecked":false,"level":9,"score":"155"},{"author":"chic_luke","body":"I truly have no sympathy for them. Taking advantage of thousands of deaths being the primary problem right now to pass a law nobody wants makes you truly a scum human being. I know if I did something like this I couldn't look at the mirror again without vomiting.","isChecked":false,"level":9,"score":"49"},{"author":"Kenzafunx","body":"But.... everyone’s at home with massive amounts of time to read up on it and protest. Shouldn’t be too hard to get a movement going, no?","isChecked":false,"level":8,"score":"28"},{"author":"Mastahamma","body":"\"Comply with our rules or you will not be allowed to do business here.\" Kinda like how the EU did it. So a firm that wants to use encryption can keep on doing it, they'll just not be allowed to operate in the US and to do business with American users. If they do, they'll probably get massive fines and possibly be blocked by American ISPs","isChecked":false,"level":5,"score":"29"},{"author":"ImNotRacistBuuuut","body":"It would also obliterate our ability to work from home.\n\nAbsolutely ridiculous that the government is encouraging businesses to equip their employees with the ability to do their job from home quarantine, then in the same week, block access to their company's network.\n\nWhat are they expecting us to do? Put our company secrets and confidential communications in a publicly accessible domain? Are they fucking insane?","isChecked":false,"level":2,"score":"103"},{"author":"Jakob_the_Great","body":"Not insane... well, yes insane, but also completely clueless when it comes to technology","isChecked":false,"level":3,"score":"32"},{"author":"glossyrevenge","body":"The former king of Spain and his Swiss accounts","isChecked":true,"level":1,"score":"32336"},{"author":"minuteman_d","body":"Wow. That is crazy. Seems like it's the perfect time to get away with whatever you want.","isChecked":false,"level":2,"score":"12116"},{"author":"SkyFall___","body":"Friend of mine works in accounting and he said his company is planning on seeing a massive spike in fraud with all the bankruptcies expected to occur. People tryna sneak under the radar so to speak","isChecked":false,"level":3,"score":"8918"},{"author":"Stalking_Goat","body":"Not sure it's trying to sneak under the radar versus the jig being up. Like if I embezzled a million dollars and things are going well with the company, I can cover it up; the accounts have a million dollars less than what management thinks, but the business keeps operating. Suddenly a crisis hits, the company needs to spend that million, and there's no way I can conceal that it isn't there. Boom, fraud detected.","isChecked":false,"level":4,"score":"3919"},{"author":"WayneKrane","body":"This is what happened to a previous boss of mine. He wasn’t letting us write off uncollectible invoices (usually duplicate invoices) so it looked like a lot of money was owed to us. Then a downturn hit and the board wanted to borrow against the large accounts receivable balance but couldn’t because the bank did an audit which showed those invoices are all uncollectible.\n\nI had to quit the job because he kept trying to get me (the accountant) to say those invoices were collectible but I simply wouldn’t because I knew they weren’t. If I’d of known why he wanted me to lie I would have gone above him but I thought he was just an idiot.","isChecked":false,"level":5,"score":"2174"},{"author":"CyclicPerpetuity","body":"Similar thing happened to me; company had cash flow problems and was under a lot of pressure from the board/creditors to improve sales. Well, turns out that SOP was to make duplicate or outright fraudulent invoices and defraud our customers by taking their money, knowing damn well it would be *at least* 12-18 months until these people received what they had paid for. Of course we weren't allowed to disclose this to customers, as the only goal was to make the sell, collect payment, and inflate the sells numbers. We also weren't allowed to enter RMA's into our inventory system so the fraudulent sales stayed on the books.\n\nI knew some shady shit was going on so, being curious, I actually went to the warehouse to check the inventory and a lot of boxes were stuffed with paper. No actual products, just empty boxes so that the company could make it look as if they actually had inventory if anyone came snooping around.\n\nI then asked who the fuck does the auditing around here and was told that this company didn't allow outside audits and had **never** conducted an internal audit of inventory; turns out no one ever conducted an audit because accounting and upper management were all in on this bullshit.\n\nI promptly quit when I noticed someone in the sales department (most likely my manager) was using my credentials after I had left work to generate fraudulent invoices.","isChecked":false,"level":6,"score":"40"},{"author":"yakshack","body":"I went to business school and this was one of the first things my Finance professor told us - if a company is doing well on paper and stockholders are happy,  that's when you look for the fraud.","isChecked":false,"level":5,"score":"33"},{"author":"Daktush","body":"In Spain here - tldr\n\nThis originated in 2001-2 when Saudi Arabia donated 100 mill to the King, and there was suspicion of it being a bribe related to construction of high speed rail there (suspected by Spanish intelligence services)\n\nIt went to tribunals but tribunals ruled there was no evidence it was a bribe\n\nSince then the king abdicated (2014), new evidence came up (that tied past king to a company offshore), and it's gone to trial again (Past wife of Juan Carlos brought evidence forth in a divorce case then in appeared in a newspaper).\n\nFor what it's worth Felipe (the current king) has renounced his inheritance (~~unsure if~~ all of it ~~or just the 100 mill from that company~~) and made it so the old king does not get paid anymore by taxpayer money (paid close to 200k yearly before)\n\n&nbsp;\n\nE: Juan Carlos's lawyers defend the 100mill was a gift without any \"Quid pro Quo\" - because of course they do\n\nE2: Checked a couple sources, Felipe renounced to all his inheritance from his father","isChecked":false,"level":3,"score":"42"},{"author":"jaiman","body":"And the fact that through those accounts he received 100M€ from Saudi Arabia and that he's being sued in the UK for threatening his ex-lover all the while Spanish Courts refuse to open an investigation.","isChecked":false,"level":2,"score":"1757"},{"author":"BurtMacklinUSOB","body":"Don't you mean \"Spanish courts refuse to open an inquisition.\"","isChecked":false,"level":3,"score":"572"},{"author":"adamthinks","body":"The one time a Spanish Inquisition was expected, and they didn't come through.","isChecked":false,"level":4,"score":"311"},{"author":"RLucas3000","body":"No one expects there to be no Spanish Inquisition","isChecked":false,"level":5,"score":"39"},{"author":"Rubenazo1999","body":"Spanish here,  never knew that.  Thanks,  another reason why we dont need a king in Spain.","isChecked":false,"level":3,"score":"35"},{"author":"naomicambellwalk","body":"Can you tell us more about this?","isChecked":false,"level":2,"score":"99"},{"author":"Astrom4","body":"He took a bribe from saudi arabia when spain was building a trainline from meca to medina","isChecked":false,"level":3,"score":"117"},{"author":"dkysh","body":"Bribe, bribe... he has been acting as a comission agent since he became a king. Instead of working for the country he has been working for the highest bidder.","isChecked":false,"level":4,"score":"40"},{"author":"Emily_Postal","body":"So money laundering through his former mistress? Yikes.","isChecked":false,"level":2,"score":"32"},{"author":"slightly2spooked","body":"I heard he’s jamming with Moxy Früvous\n\n(Thank you for the silver. I will use it to give every new baby a chocolate eclair.)","isChecked":false,"level":2,"score":"27"},{"author":"seattlefoodie","body":"One of the main routes into downtown Seattle, the West Seattle Bridge, was closed yesterday because cracks in support beams made it structurally unsound. It will take several months to fix and will not reopen until it's done. This would normally *destroy* the entire Seattle commute, but it happened right now so it's barely even a blip on the local news.","isChecked":true,"level":1,"score":"25722"},{"author":"Lefkowicz","body":"Real talk, this was probably the best possible time for this to happen.","isChecked":false,"level":2,"score":"12102"},{"author":"D-Briq","body":"Real talk, they likely knew about this for a long time, and were waiting to find a time to close it.","isChecked":false,"level":3,"score":"9668"},{"author":"SoldierofVol","body":"My new favorite conspiracy theory is that covid-19 was created by the municipal transportation authority in Seattle.","isChecked":false,"level":4,"score":"11581"},{"author":"yodelocity","body":"Don't be ridiculous. The government actually created Covid-19 to keep people inside while they change the batteries on all the birds.","isChecked":false,"level":5,"score":"7689"},{"author":"soapbutt","body":"And work on fixing the Wyoming facade. /r/wyomingisntreal","isChecked":false,"level":6,"score":"952"},{"author":"happywithsushi","body":"I mean, I've never been to Wyoming.","isChecked":false,"level":7,"score":"316"},{"author":"CondemnedSaucer","body":"None of us have, you can’t go anywhere that doesn’t exist","isChecked":false,"level":8,"score":"717"},{"author":"Thassodar","body":"What is a Wyoming, exactly?","isChecked":false,"level":9,"score":"36"},{"author":"Quachyyy","body":"This is such a stupid theory. Everyone and their moms shouldn't believe this because we all know that B.I.R.D.S. drones (Battle Intelligent Radar Detecting Surveillence drones) are solar powered since they're in the sky and are closer to the sun. That's why superman is so strong.","isChecked":false,"level":6,"score":"51"},{"author":"pick_happiness","body":"“All of the birds died in 1986 due to Reagan killing them and replacing them with spies that are now watching us. The birds work for the bourgeoisie”","isChecked":false,"level":6,"score":"32"},{"author":"tiny_robons","body":"*birdgeoisie","isChecked":false,"level":7,"score":"37"},{"author":"dekrant","body":"Dammit, SDOT teaming up with the Gates Foundation to release COVID-19 to pay back a personal favor to the Gates family.","isChecked":false,"level":5,"score":"98"},{"author":"tdogg241","body":"Ding ding ding!  The cracks had been monitored since 2014 and a repair plan was already developed.  The vastly reduced traffic volumes make this perfect timing to fast-track a project that already has funding and can keep crews busy for a while.","isChecked":false,"level":4,"score":"45"},{"author":"Sovereign2142","body":"This is the best time to do a lot of infrastructure maintenance.","isChecked":false,"level":3,"score":"79"},{"author":"DaisyHotCakes","body":"Are people there taking the virus seriously and staying home? Feel like I haven’t heard anything about how you were doing out there.","isChecked":false,"level":2,"score":"70"},{"author":"earthwulf","body":"Other than groceries and deliveries, I haven't seen many people out. People are still going for walks/jogs, but we're giving each other massive space.","isChecked":false,"level":3,"score":"112"},{"author":"Alauren2","body":"The lack of traffic in all of western Washington made the pandemic real for me. Driving on the freeway I-5 at 4pm on Monday going the actual speed limit was shocking. Almost all of I-5 in western WA is congested as hell all Monday from like 1pm till 8pm.","isChecked":false,"level":2,"score":"38"},{"author":"hollahalla","body":"The \"Nth Room\" sex crime case in Korea. Please read about it if you can. It's absolutely horrifying.\n\nEdit: Wow did not expect this many responses. First time I've ever received so many replies. I see that some of you want to know more details so I will leave a link to a blog post that someone posted on Naver. It's detailed summary of what it's all about. But, PLEASE do not read if you can't handle graphic content. It's very violent and sexual content, and I don't want to trigger anyone. Read with a strong heart.\n\n[Nth Room Naver Blog Post](https://blog.naver.com/nomorenthroom/221782222359)","isChecked":false,"level":1,"score":"5009"},{"author":"crabbyclementine","body":"Victims including middle school students? I don't think I want to look into this any more than that :( those poor girls.","isChecked":false,"level":2,"score":"1523"},{"author":"hollahalla","body":"Yes. Currently, the youngest known case is 9 years old.","isChecked":false,"level":3,"score":"878"},{"author":"uju_rabbit","body":"Nine!? I heard eleven, but in either case holy shit. I’m an elementary school teacher here and I’m so worried for my students. There’s apparently at least one male elementary school teacher involved with those chat rooms and I wouldn’t be surprised if there’s more. Those kinds of people cannot be around kids","isChecked":false,"level":4,"score":"186"},{"author":"apinkparfait","body":"South Korea uses lunar calendar to ages, so is possible that both are the same girl - eleven in SK and 9 for everybody else. Is heartbreaking nonetheless.","isChecked":false,"level":5,"score":"52"},{"author":"sapio42","body":"Not really super important for the topic at hand but it's not lunar calendar for ages, it's just that everyone is 1 when they are born and they grow an year older every year January 1st!","isChecked":false,"level":6,"score":"40"},{"author":"kelsday84","body":"I have a nine year old girl. That makes me want to vomit.","isChecked":false,"level":4,"score":"217"},{"author":"Zeitgeistalt","body":"Why can’t ISIS find these guys instead of peaceful worshippers","isChecked":false,"level":5,"score":"102"},{"author":"DSJ0ne0f0ne","body":"The fact that there were like 260,000 people participating in that is the worst part.... 260 thousand....","isChecked":false,"level":2,"score":"1534"},{"author":"cyan_singularity","body":"Someone said that was the number of views where as the actual number of people was 10k to 30k. That's still hellish and I still want to do something about it but I do prefer factual numbers even when it's messed up stuff. I don't want to lose more faith in my fellow man","isChecked":false,"level":3,"score":"425"},{"author":"JBSquared","body":"Yep. IIRC either one piece of content had 260k total views or there was 260k views across all the content shared. Total views, not unique views.","isChecked":false,"level":4,"score":"60"},{"author":"coffever","body":"A very eerie detail I read in one article is how in search engines popular in South Korea such as Naver, there was a sudden peak in people browsing how to delete the type of account required to join to rooms without leaving any tracks.. Sorry for my language but some people are fucking disgusting pigs","isChecked":false,"level":3,"score":"47"},{"author":"hollahalla","body":"Yeah it's terrifying looking at how many members are involved..","isChecked":false,"level":3,"score":"296"},{"author":"Thorne_Oz","body":"It's \"only\" really 10-30k users, 260k is the number of views that some of the media shared in it had iirc, but that includes re-views from the same people.","isChecked":false,"level":4,"score":"328"},{"author":"MrCringeKidYT","body":"For anyone's information sake, he (probably) put the quotation marks there to show that 10-30k is still way too many poeple. Because, it is.","isChecked":false,"level":5,"score":"37"},{"author":"CountVP","body":"Im trying to but every fucking article assumes i already know the story to begin with. Most articles are \"celebrity reacts\" and \"suspect caught\" with a brief resumé\n\nEdit: when i made this comment there wasn't so much information avaiable. Please stop showering me with links. Im already aware of the situation.","isChecked":false,"level":2,"score":"381"},{"author":"Clarkey7163","body":"[I found an article about it](https://www.edtimes.in/what-is-the-nth-room-case-of-south-korea-where-70-women-including-minors-were-sexually-abused-and-blackmailed/)\n\nTldr basically there was an online chat room with ~30k members and people in those rooms were sharing some apparently fucked up stuff. \n\n> “In a horrifying turn of events, it has been revealed that more than 70 women, many of them being minor girls, were involved in a huge sexual abuse ring where they were being blackmailed in to sending videos of themselves performing grotesque sexual acts and self harm.”","isChecked":false,"level":3,"score":"508"},{"author":"allidois_nguyen","body":"Here's an article that briefly describes it: https://4w.pub/south-korean-nth-room-chats-are-keeping-girls-in-sexual-slavery/","isChecked":false,"level":3,"score":"96"},{"author":"offyougo_spitspot","body":"\"Some of these acts included cutting off a nipple, having sex with one’s brother, carving of the word “slave” or the pimp’s name with a knife in the skin, putting scissors into the vagina, eating feces, and even getting raped by assigned people. At least one of the victims has already committed suicide.\"\n\n WHAT\n\nthen it continues to say if the girl refuses, they reveal their personal identities so people can go find them and rape them. \n\nbrb I need some eye bleach after that","isChecked":false,"level":4,"score":"143"},{"author":"QiuK","body":"\"as footage of violent rape is expensive to sell\"... I'm 22 years old and I just learned that this was a luxury item. it doesn't make sense to me that people pay for things like that","isChecked":false,"level":4,"score":"67"},{"author":"dysistheawesome","body":"It's really horrible stuff. Like seriously, nightmares are made of some of the things that these inhuman assholes forced young girls to do to themselves. The \"man\" man is apparently still yet to be identified or caught though they have some leads. Seriously scary stuff.","isChecked":false,"level":3,"score":"69"},{"author":"cafediaries","body":"They've already caught the \"guru\" (PhD or baksa in Korean), a 25-year old suspect named Jubin Jo (this bastard screwing up his youth in prison). Still, people are petitioning to reveal the 20~30k people who are in the chatroom because they are partaking in this crime.","isChecked":false,"level":4,"score":"108"},{"author":"Fireheart360","body":"Thanks - there are now 10,000 people I hope swallow a bag of nails. The level of depravity humans seem to regularly fall to is awful","isChecked":false,"level":2,"score":"62"},{"author":"make_love_to_potato","body":"https://qz.com/1824137/koreas-nth-room-telegram-sex-crime-scandal-resonates-in-china/\n\nSince no one linked it.","isChecked":false,"level":2,"score":"31"},{"author":"DuckArchon","body":"If this turned out *not* to be a thing in the US already, I would be very surprised.  \"Pedophile politicians supporting a national sex abuse industry\" is apparently in vogue these days.","isChecked":false,"level":2,"score":"26"},{"author":"seargentangua","body":"Brexit. I almost miss it.","isChecked":true,"level":1,"score":"8168"},{"author":"whatdidyousayto_me","body":"I do miss it. It never affected me, but I loved hearing British people yelling at each other when I turned on npr, and the whole thing just sounded really cool. Brexit was with me through 3 different homes, and two different countries.","isChecked":false,"level":2,"score":"3250"},{"author":"itsnachikethahere","body":"I am indian, and I can confirm that the British take ages to leave.","isChecked":false,"level":3,"score":"193"},{"author":"queenemmathe1st","body":"This comment is too funny to be hidden this far down","isChecked":false,"level":4,"score":"34"},{"author":"VietInTheTrees","body":"Wait did they finally do it? It’s been going on for so long I’ve fallen out of the loop","isChecked":false,"level":2,"score":"57"},{"author":"Stooby2","body":"Well yes, but no. We have officially left, but there is one year under current EU regs, etc as new trade deals and all the rest of it are thrashed out. I'd guess that will be extended now.","isChecked":false,"level":3,"score":"99"},{"author":"osprey81","body":"We’re right now in a one year “transitional” period, where our future terms with the EU need to be ironed out, otherwise we properly leave in Jan 2021 trading only on WTO rules (bad idea). Of course, the transitional period could be extended, but Boris has maintained he won’t extend it. He did however, say he would “rather die in a ditch” instead of extending the leave date past Oct 31st 2019, and yet he’s still alive...","isChecked":false,"level":3,"score":"52"},{"author":"Andromeda321","body":"Astronomer here!  We might have a bright naked eye comet next month in the northern hemisphere- our first since 1997! [ Comet C/2019 Atlas Y4 is brightening really quickly](https://astronomy.com/news/observing/2020/03/comet-atlas-may-soon-be-visible-to-the-naked-eye), and by May might be one of the brightest things in the night sky!\n\nI mean, comets are notoriously tricky to predict in brightness, as it might just break apart as it gets closer to the sun.  But it's really exciting to think about, albeit no one has heard about it because of the pandemic (though granted, doesn't a pandemic need a bright comet?).\n\nEdit: you might be able to get it in binoculars right now, or at least have fun trying!  [Here](https://heavens-above.com/comet.aspx?cid=C%2F2019%20Y4&lat=50&lng=15&loc=%C4%8CR&alt=270&tz=CET) is a star chart for it.\n\nAnd yes, the last bright northern hemisphere \"Great Comet\" was Hale-Bopp, which was up for about a year to the naked eye.  If you were a southern hemisphere resident in 2006, however, you probably remember Comet McNaught.\n\nEdit 2: because many are asking, that bright “star” in the evening sky is actually Venus! It’s around its peak brightness and height *right now* and you should go take a look if your social distancing allows it! Might as well take a break from Netflix and look at a whole ‘nother planet. :)\n\nEdit 3: no there is no chance of the comet hitting us or affecting life on Earth beyond potentially getting bright.","isChecked":false,"level":1,"score":"20153"},{"author":"friedens4tt","body":"You know what? I'm really excited for this - thank you for that information!","isChecked":false,"level":2,"score":"2480"},{"author":"zebreau","body":"Dude me too and I've never been this hyped over a comet.\n\nThis will be the first time I've seen one apart from meteors.","isChecked":false,"level":3,"score":"53"},{"author":"friedens4tt","body":"How cool for you!\n\nI remember being really small, like 4-6 years old, and the Halley-comet was really hyped up then.\n\nMe, dreaming of being an astronaut one day, really enjoyed staying outdoors with my parents for it - it was a beautiful, unique experience and has acted as a memory that fuels my interest in anything related.\n\nI really wish you a nice comet-viewing and good health :)","isChecked":false,"level":4,"score":"34"},{"author":"Escalus_Hamaya","body":"Glad to see you’re still hanging around. Thank you for all you do.","isChecked":false,"level":2,"score":"239"},{"author":"Andromeda321","body":"Sure thing!  Stay safe!","isChecked":false,"level":3,"score":"51"},{"author":"saltyseahag_99","body":"Thanks for this! Probably a dumb question, but where do comets come from? Where are they going?","isChecked":false,"level":2,"score":"43"},{"author":"Andromeda321","body":"Not dumb at all!  It's thought they come from the [Oort Cloud](https://en.wikipedia.org/wiki/Oort_cloud), which is far past Pluto.  No one has seen it, but when you trace the orbits of comets they almost all go on a long loop that goes out there, so it's thought there are a ton of comets out there and a little gravitational nudge is all one needs to start its orbit inward.","isChecked":false,"level":3,"score":"86"},{"author":"Got_ist_tots","body":"Space. And space.","isChecked":false,"level":3,"score":"30"},{"author":"fight-me-grrm","body":"They’re just vibin","isChecked":false,"level":3,"score":"50"},{"author":"crappenheimers","body":"Jesus had to scroll down for an hour to find some good news. Thanks for letting us know!","isChecked":false,"level":2,"score":"66"},{"author":"ruhonisana","body":"AGHHH! More Apocolyptic symbols!","isChecked":false,"level":2,"score":"64"},{"author":"SealClubbedSandwich","body":"Hey, I hope this is okay to ask here, I dont come across an astronomer every day lol.\n\nSo the last few days I have noticed a really bright planet rising in the west after sunset. Skystracker says it's Venus, but I have never seen it so bright! Might it be due to reduced pollution? I live in a large city in the US.","isChecked":false,"level":2,"score":"28"},{"author":"Andromeda321","body":"Nope, it's definitely Venus!  It's actually at peak brightness right now- you may have not seen it before because it has a multi-year cycle and doesn't often get this high and bright.","isChecked":false,"level":3,"score":"40"},{"author":"wespoint7","body":"Comet Sighted","isChecked":false,"level":2,"score":"24"},{"author":"Angie_MJ","body":"I would hope the locusts plaguing East Africa, the Middle East, and the Indian subcontinent. It’s describing some swarms as being the size of New York, and they are eating their harvest, threatening widespread famine. I think without Coronavirus we would mobilize to try to control this population the way we did for Zika carrying mosquitos in the America’s.\n\nEdit: [this NPR article](https://www.npr.org/2020/02/21/807483297/why-are-swarms-of-locusts-wreaking-havoc-in-east-africa) describes how in 2018 an unfortunate series of cyclones from the Indian Ocean hit an extremely remote area of the Arabian Peninsula known as the \"Empty Quarter.\" This produced extraordinary rain and gave them what they needed to breed. Because a second cyclone hit occurred during their breeding cycle, instead of drying out and having most of their population die out in the desert, the population exploded. In favorable conditions they can multiply by 400X their population every 6 months. Then they mass migrated. \n\nAlso for clarity, a swarm was identified as 3 times the size of NYC.","isChecked":false,"level":1,"score":"28684"},{"author":"hatesnack","body":"I swear I remember hearing about some group readying up like 200k ducks to go fight the locusts. Cause 1 duck can eat like 150 locusts a day or something. I'll have to find a source.\n\nEdit: no idea how accurate this is but it's from march 2nd. https://www.google.com/amp/s/www.express.co.uk/news/world/1245489/locust-plague-pakistan-africa-locust-swarm-attack-ducks-Xinjiang/amp","isChecked":false,"level":2,"score":"2305"},{"author":"ThornOfQueens","body":"I've heard this story before. Next we're going to hear about a the enormous swarm of ducks that's taking over Africa and India. Then someone's going to suggest deploying 200,000 badgers to eat the ducks. This could go on a while.","isChecked":false,"level":3,"score":"2704"},{"author":"hatesnack","body":"Not to promote the devastation of a region or anything, but I'd be semi interested in the cartoon antics part of that all.","isChecked":false,"level":4,"score":"850"},{"author":"IFedTheCat","body":">> 200,000 badgers \n\n> I'd be semi interested in the cartoon antics part of that all\n\n\"[Badger, badger, badger...](https://www.youtube.com/watch?v=EIyixC9NsLI)\"","isChecked":false,"level":5,"score":"42"},{"author":"Apokolyptyk","body":"There was an old lady who swallowed a spider...","isChecked":false,"level":4,"score":"28"},{"author":"gappingdouble","body":"Plagues, wild fires, locust . I know things like this happen but definitely getting some apocalypse vibes","isChecked":false,"level":2,"score":"11424"},{"author":"Tvayumat","body":"Don't forget the major earthquakes.","isChecked":false,"level":3,"score":"5584"},{"author":"None","body":"[deleted]","isChecked":false,"level":4,"score":"5672"},{"author":"aummahgerd","body":"They’re all in bomb shelters cut off from the world.","isChecked":false,"level":5,"score":"2365"},{"author":"Fluffee2025","body":"You're highly mistaken. They're still there making those same cries, but their drowned out in the news by the pandemic.","isChecked":false,"level":5,"score":"381"},{"author":"only1ammo","body":"As the story goes, the Antichrist will be loved by the false prophets. He will come as their savior and take up the crown before the end comes... So they won't see him coming. Televangelist seem like the ripe fruit to be picked and used by someone like that.","isChecked":false,"level":5,"score":"78"},{"author":"dbcaliman","body":"Good Omens was a whole lot more fun to watch than live through.","isChecked":false,"level":4,"score":"59"},{"author":"dedwards20","body":"As someone interested in spirituality and ancient philosophies I just want to offer a different take on this whole thing. The modern take on the apocalypse is \"everything goes to shit\" which is not what the original definition meant. The word apocalypse literally means \"unveiling\", and I think that even though we are seeing a quick short term decline, after these trials are over we could very well see humanity rebound from the suffering and leave this age of confusion, hypocrisy, lies, anger, and authoritarianism, and enter an age of truth, love, light, compassion, and understanding.  \n\nAfter the black plague, Europe saw the death of feudalism and the birth of a free peasantry, and eventually the renaissance. Very good things can happen after very hard and painful things have happened. This has shown to be the case countless times in history. And this will not be anywhere near that bad as far as disease outbreaks go. If it's any consolation, I'm saying this as a person with a degree in biology. I'm not trying to spout superstition, but to instead spread an outlook that I feel is extremely valuable in today's day and age.","isChecked":false,"level":3,"score":"399"},{"author":"ASingularFrenchFry","body":"this made me feel better so thank you","isChecked":false,"level":4,"score":"31"},{"author":"Eli_quo","body":"I thought you were joking. This is unreal. What’s next, frogs? Lice?","isChecked":false,"level":2,"score":"1046"},{"author":"rytis","body":"I was walking in the late evening along a storm drainage lake near my house.  The ground was covered with thousands of small frogs.  So I suggest anyone who's a first born buy some mutton and smear the blood over your door. Or if you have kids.","isChecked":false,"level":3,"score":"561"},{"author":"Herbivorians","body":"Passover's coming up soon, too.","isChecked":false,"level":4,"score":"204"},{"author":"Sell200AprilAt142","body":"if anyone's got any Hebrews working for them for the sake of your firstborn let them go on paid leave","isChecked":false,"level":5,"score":"42"},{"author":"Pandiferous_Panda","body":"Um, just one horseman at a time please","isChecked":false,"level":2,"score":"3803"},{"author":"greenflame239","body":"That's not how the apocalypse works","isChecked":false,"level":3,"score":"1781"},{"author":"i_Got_Rocks","body":"If all the Karens of the world would just mob up to talk to End-Times' manager, that'd be great...","isChecked":false,"level":4,"score":"74"},{"author":"ObedientCabbage","body":"I'd like to say the [EARN IT](https://www.theverge.com/interface/2020/3/12/21174815/earn-it-act-encryption-killer-lindsay-graham-match-group) act, but shit like this doesn't tend to make the news.","isChecked":false,"level":1,"score":"18011"},{"author":"Azariah98","body":"EARN IT is only on the table because of COVID-19. There’s no way they would try this if we weren’t distracted.","isChecked":false,"level":2,"score":"6796"},{"author":"ObedientCabbage","body":"That's a fair point of view.  Maybe another good /r/AskReddit thread could be what are people trying to sneak by with all of our attention elsewhere.","isChecked":false,"level":3,"score":"2431"},{"author":"TheOneCABAL","body":"California regularly passes tax increases on Friday afternoons especially before 3 day weekends","isChecked":false,"level":4,"score":"500"},{"author":"rychaud","body":"Dumping bad news on Friday afternoon is a time-honored tradition unfortunately.","isChecked":false,"level":5,"score":"96"},{"author":"teflong","body":"It's amazing to me... the simple fact that this is impossible to implement.  But that's not enough to stop them.  It's one of the most disruptive acts I have ever seen.  Bunch of old dumb people making rules without even remotely understanding the implications.","isChecked":false,"level":2,"score":"2341"},{"author":"Azuenz","body":"Right, as soon as someone like Apple or Amazon gets hacked and loses millions or billions from a leaked iPhone schematic or something, this law would would stricken down immediately with a huge settlement from the government. This not only fucks smaller companies and users, but will also throw away millions of tax dollars. All because some old fucks don't know how the internet works.","isChecked":false,"level":3,"score":"1503"},{"author":"DriedMiniFigs","body":"Apple and Amazon might just pack up and move to greener pastures if this passes, I’d think.\n\nThat, or split their US operations from International operations. Either way they have powerful lobbyists and deep pockets.","isChecked":false,"level":4,"score":"596"},{"author":"-Vayra-","body":"> That, or split their US operations from International operations.\n\nThey might be forced to or face EU sanctions due to GDPR. Everything they do relating to the EU would have to be completely and utterly separate from the encryptionless US business or they'd be facing continuous GDPR breaches at up to 4% of *global revenue* each.","isChecked":false,"level":5,"score":"91"},{"author":"SapirWhorfHypothesis","body":"Wait, if their lobbyists are so deep-pocketed, why is this even up for debate? Who’s sponsoring the movement *pro*-bill?","isChecked":false,"level":5,"score":"26"},{"author":"green_bin_coon","body":"Also banking the entire banking industry depends on very robust encryption else you have to air gap everything.\n\nIts not the 60’s every penny is thru the internet","isChecked":false,"level":4,"score":"57"},{"author":"CraftyFellow_","body":"Online banking and online commerce.\n\nPeople aren't gonna be buying shit online if there is no security.","isChecked":false,"level":5,"score":"30"},{"author":"ObedientCabbage","body":"I thought the same about when they were trying to make changes to cookie policies and back when COPPA was passed: \"This can't happen, it just doesn't work the way they would expect it to\".  But here we are.  /shrug","isChecked":false,"level":3,"score":"238"},{"author":"BeastMasterJ","body":"Yeah but this is one open source program hosted in a country that still gives a shit away from being unenforceable.","isChecked":false,"level":4,"score":"35"},{"author":"poorpplfcker","body":">EARN IT\n\nHere's a [link](https://www.congress.gov/bill/116th-congress/senate-bill/3398?q=%7B%22search%22%3A%5B%22earn+it%22%5D%7D&r=1&s=1) to what is going on with it, so you can keep track, and read the original source (aka. the bill itself).\n\ntl;dr - It hasn't gone anywhere. Yet. It was introduced on the 5th of March, and hearings were held for it on the 11th.\n\nSponsors are 6 Democrats and 5 Republicans.\n\ni.e., NOW is a great time to call/write your senators and representatives to voice your disapproval. Maybe write to the White House itself too, because The Donald probably wants his re-election.\n\nHot take - I think it'll go exactly nowhere. The moneyed interests (big tech) will not let this happen. Their armies of lobbyists are probably already threatening congressmen as we speak. It's bad for corporations.","isChecked":false,"level":2,"score":"38"},{"author":"FishdZX","body":"Am I the only one who sees EARN IT as the obvious follow up to the death of net neutrality? \"Oh we can take *this* and nobody can stop us? Well, let's take it a step further!\"","isChecked":true,"level":2,"score":"466"},{"author":"MaddiKate","body":"The Lori Vallow/Chad Daybell case is still alive and well...","isChecked":false,"level":1,"score":"8908"},{"author":"Portarossa","body":"If anyone's interested in this, I wrote [a longass comment](https://www.reddit.com/r/OutOfTheLoop/comments/f4cw3s/what_is_going_on_with_the_idaho_parents_with/fhpmdrq/) for /r/OutOfTheLoop when it was first breaking that should take you up to about mid-February:\n\nThis is one of those stories that's going to get bigger as more details come out. As with any story like this, there's a veritable smorgasbord of information, misinformation, speculation and finger-pointing, but... well, it's not looking good. It's still in progress, but if you're expecting a happy ending, this probably isn't the story for you.\n\nWhat we *do* know is that two children, 17-year-old Tylee Ryan and 7-year-old Joshua 'JJ' Vallow haven't been seen since September 2019. Tylee is the child of Lori Vallow and her (third) husband, Joseph Ryan; JJ was adopted by Lori and her (fourth) husband, Charles Vallow, at a young age. (JJ Vallow is the grandson of Charles Vallow's sister, Kay Woodcock; Charles Vallow is JJ's adoptive father, but also his great-uncle. [The family trees on this one are *complex*.](https://s3-assets.eastidahonews.com/wp-content/uploads/2020/02/03133658/missing-kids-family-02-20.jpg))\n\nBy all accounts, the marriage was a relatively happy one until a couple of years ago, when -- according to Charles Vallow's brother-in-law, Larry Woodcock -- suspicions arose that Lori was having an affair with a man named Chad Daybell. Daybell is a Latter Day Saints author of religious-themed books, including ['dozens of books on apocalyptic events and near-death experiences'](https://usatoday.com/story/news/nation/2020/02/12/lori-vallow-chad-daybell-religion-missing-idaho-kids-mom-cult/4721695002/). By all accounts, [Lori became increasingly fixated on religion during this time](https://www.fox10phoenix.com/news/documents-lori-vallow-claims-she-was-god-preparing-for-second-coming-of-christ), becoming obsessed with the idea that there would be a second coming in July 2020 and that she was going to be one of a special 144,000 (the latter of which [is in line with LDS teachings that there will be a group of 'high priests' raised to spread the gospel at the End Times](https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/77.11?lang=eng); according to court documents, Charles noted that Lori claimed to be a 'translated being who cannot taste death sent by god to lead the 144,000 into the Millennium.'). This led to suspicions that Lori was in a cult. (Lori Vallow and Chad Daybell worked on a podcast for which the production company, Preparing a People, [has released a statement](https://www.preparingapeople.com/) clarifying that they are *not*, in fact, a cult, merely a religious materials production company. That said, they also included the line 'We formally are notifying all Media and individuals to Cease and Desist from mentioning the Preparing a People Event Brand, or our Media company in any negative connection with Chad or Lori Daybell, or their case' -- so to reiterate, that's **the Preparing a People Event Brand, the alleged cult and *definitely* employers of Lori Vallow and Chad Daybell, who are wanted in connection with the disappearance of two children and potentially the murder of three other people.** You can't just threaten strangers to keep your dirty laundry secret, you guys. That's not how the internet works.)\n\nIn February 2019, Charles Vallow [sought a divorce from his wife](https://kutv.com/news/nation-world/case-of-2-missing-kids-grows-to-include-deaths-cult-rumors), as well as a protection order after she -- allegedly, according to his sister -- threatened him with violence if he got in her way. Charles Vallow was shot and killed by Lori Vallow's brother, Alex Cox, in July of 2019. (Before that, Vallow had switched the beneficiary of a $1 million life insurance policy from Lori to his sister Kay, JJ's grandmother. According to Vallow's former lawyer, Steven Ellsworth, Charles had warned him about a perceived danger to his life; Ellsworth reported Charles as saying, ['I'm afraid I'm gonna be killed, and I know who's gonna do it. [...] I'm telling you, Steve, so that if something happens to me, I wanna make sure you let everyone know that something happens, I'm killed, that it's my wife Lori and her brother, Alex Cox.'](https://www.fox10phoenix.com/news/source-charles-vallow-removed-lori-vallow-as-1m-life-insurance-beneficiary-in-2019))\n\nCox claimed that it was a case of self-defence, after Vallow attacked him, but the case was never conclusively settled. Shortly after Vallow's death, Lori removed JJ from a school that specialised in the care of autistic children, [claiming that she had found a new job in California and would be moving JJ there.](https://www.fox10phoenix.com/news/private-school-officials-say-lori-vallow-withdrew-her-son-after-lying-about-charles-vallows-death)\n\nSo far, all of this has taken place in Arizona. Rather than moving to California, Lori moves the kids to [Rexburg, Idaho](https://en.wikipedia.org/wiki/Rexburg,_Idaho) in August -- where Chad Daybell is located and, it's worth noting, a town that's estimated to be 95% Mormon -- and enrolls JJ and Tylee into school. That's pretty much the last time they're seen.\n\nNow, while this is going on, Chad Daybell is married to his wife, Tammy -- with whom he's been together since 1990, and founded a religious materials publishing company which put out his writings. In October 2019, Tammy Daybell claimed that a masked man [shot at her with 'a paintball gun'](https://www.eastidahonews.com/2019/12/tammy-daybell-reported-a-masked-man-shot-at-her-with-a-paintball-gun-10-days-before-her-suspicious-death/); as she put it: 'I had gotten home and parked in our front driveway. As I was getting stuff out of the back seat, a guy wearing a ski mask was suddenly standing by the back of my car with a paintball gun. He shot at me several times, although I don’t think it was loaded. I yelled for Chad and he ran off around the back of my house.'\n\nTen days after this, Tammy Daybell died of what was assumed to be natural causes. She was buried shortly afterwards, without an autopsy. The police *did* attend the scene but apparently didn't find anything unusual; per Fremont County Sheriff Len Humphries: 'My deputies responded and, as we do with most unattended deaths, they took pictures, they looked it over and contacted our detectives. The detectives had a few questions, they satisfied those, got the information they needed and didn’t see anything that alarmed them. [...] [To my knowledge, he [Daybell] was responding like anybody would whose spouse had just passed away. That’s why the deputies didn’t suspect anything suspicious.'](https://www.eastidahonews.com/2020/01/sheriff-details-what-happened-when-deputies-responded-to-tammy-daybells-death-as-lori-daybells-son-makes-a-passionate-plea-to-his-mother/)\n\nShortly after this -- within weeks -- Lori Vallow and Chad Daybell get married in Kaui, Hawaii. The kids are nowhere to be seen; Tylee allegedly [sent a text to a friend](https://www.postregister.com/news/local/new-texts-show-last-known-contact-from-tylee-ryan-s/article_773770ec-1ba1-5bcf-b037-c778719abb30.html) on October 25th, but that's the last of any sort of contact (and even that isn't necessarily accurate). The Daybells were subject to a welfare check on JJ in November (after family members complained they hadn't seen or heard from him in months), but when the police arrived, the Daybells claimed that JJ was with relatives in Arizona; when they checked up on the story, they found he hadn't stayed with the people the Daybells claimed. When this information comes in, police go to have a talk with the Daybells... and they've gone. Vanished.\n\nThis takes us to November 27th, 2019. Convinced that there's something suspicious going on, police start to take a closer look at Tammy Daybell's death, and her body is exhumed on December 11th so that toxicology tests can be performed. (The results are still pending.) On December 12th, Alex Cox -- Lori's brother, and the man who killed Charles Vallow -- [was found dead in a house in Arizona](https://www.fox10phoenix.com/news/details-surrounding-death-of-lori-vallows-brother-emerge) belonging to [a woman he had married in Vegas two weeks earlier](https://www.fox10phoenix.com/news/marriage-license-shows-lori-vallows-brother-got-married-2-weeks-before-his-death); the cause of death is unknown, and -- again -- toxicology reports are still pending.)\n\nAnd that's *mostly* where the story sits right now. The Daybells turned up in Hawaii and are refusing to answer questions, and there have been numerous appeals from the Woodcocks asking for information about the kids; the Woodcocks filed for guardianship, which is still pending. Lori Daybell was delivered papers informing her that she was legally required to produce JJ and Tylee to the Idaho Department of Health and Welfare or Rexburg Police Department in five days -- a deadline which passed on January 30th. Police in Hawaii have been investigating the Daybells, but at the time of writing no arrests have been made.\n\nThe reason this is getting national attention now is because of a *Dateline* special entitled *Where Are the Children?*, which aired on February 14th. Given the Daybells' continued refusal -- or inability -- to produce Tylee and JJ, you can expect there to be developments on this story in the coming days. This isn't one that's likely to just go away.\n\nLori Vallow [was arrested in Hawaii on February 20th](https://eu.usatoday.com/story/news/nation/2020/02/20/lori-vallow-mom-missing-idaho-children-arrested-hawaii/4820242002/) on two felony counts of desertion and nonsupport of dependent children, resisting or obstructing officers, criminal solicitation to commit a crime and contempt of court. Chad Daybell was not arrested.","isChecked":false,"level":2,"score":"4916"},{"author":"MysticBaguette","body":"Thank you for the lengthy write up, which actually explains more than just \"convoluted case, look it up\" others have been commenting without providing any links.","isChecked":false,"level":3,"score":"1423"},{"author":"DICK-FUCK-PUSSY-SUCK","body":"After her arrest, bail was set at $1 Million. She's got the 10% needed for up-front costs to bond out but none of the bail bondsmen want to accept their money to come post bail on her behalf. \n\nOne of the bail bondsmen (bondswoman*) said she would post bail if Lori showed some tiny proof of life for the kids. Needless to say, bail was never posted and she's still locked up. \n\nI have A LOT of sympathy for criminals and inmates. I've been arrested numerous times, served time in Federal prison, and have met a lot of people along the way. A lot of these people have made simple mistakes, were part of nonviolent/victimless crimes/have severe mental health issues. \n\nBut I've got no sympathy for someone like Lori. Kids are innocent and there's no reason for anything like this to ever happen. Whenever I hear about her case I sometimes wish women's prisons were as violent as men's prisons can be.","isChecked":false,"level":3,"score":"521"},{"author":"murrrrface","body":"I really appeciate your insight as someone whos been on that side of the bars. I hope you are in a good place :)","isChecked":false,"level":4,"score":"99"},{"author":"DICK-FUCK-PUSSY-SUCK","body":"Much better of a place than I was in the past. Thank you for your kind words, stranger.","isChecked":false,"level":5,"score":"85"},{"author":"PM_ME_A_STRAYCAT","body":"Just wanted to piggyback off your awesome and informative comment with some helpful links.\n\nA well known YouTubed, Bailey Sarian also did a really good and informative video using pictures, so it’s easy to follow. If anyone is still confused after OPs comment, this video might help:\n\nhttps://youtu.be/X-GuonthUgY\n\nAnd please visit us over at r/lorivallow \n\nThanks everyone for your support! The more people who know about the case, the better!","isChecked":false,"level":3,"score":"65"},{"author":"TVaddictpanda","body":"This sounds like it’s gonna be on Netflix","isChecked":false,"level":3,"score":"35"},{"author":"SmarkieMark","body":"An that she bought her wedding ring with Charles Vallow's amazon account 17 days before Tammy Daybell's death.","isChecked":false,"level":3,"score":"26"},{"author":"step_back_girl","body":"Still actively following this one, and was my response to the first time this question was asked.\n\nDid you see she reportedly thought the kids were Zombies?","isChecked":false,"level":2,"score":"2050"},{"author":"Cute_hawaii_couple","body":"Jeez. She was here on kauai hiding out for a while. But everyone on the island was rude to them because we didn't want them.here. \"where is the kids\" they'd get asked everywhere they went. I haven't been keeping up since they left kauai though. Have they found the kids at all or at least what happened to them?","isChecked":false,"level":3,"score":"924"},{"author":"step_back_girl","body":"They have not. She is in jail, though, and the local bondsmen are refusing to assist her with her $1M bail. No one will come to them on her behalf, and it's a larger bond than they see in the area. There is also speculation she has not been able to prove she and her husband have assets to cover the remaining 90% of bail. One bondsperson said she told Lori if she can give proof of life of the children, she would be willing to post for her. But she couldn't, or didn't.\n\nSome people from Kauai sent JJ's grandmother and grandfather leis (I'm not sure what they were made from, but I think that was symbolic?) to show their support, and they wore them to her first trial after she was extradited.","isChecked":false,"level":4,"score":"863"},{"author":"Danielf929","body":"Mad question out of the blue here, are all bonds in America 10% of what bail is set at? I was watching something recently where bail was set at 12k but they only put forward 1,200. \n\nIf so, why not just set the bail to whatever 10% is instead of these wild numbers you sometimes see.","isChecked":false,"level":5,"score":"48"},{"author":"arathesouthernelf","body":"If you dont show up to court, you owe the other 90%. Generally people get a bail bond (because they cannot afford to pay their full bail in cash). In that case you put forward 10% and the bail bond (basically a loan) garuntees the other 90% and if you skip youre on the hook. So as this thread states, if you have no assets (or no one with assets to cosign), a bail bondsman wont front the other 90% to get you out of jail.","isChecked":false,"level":6,"score":"91"},{"author":"Danielf929","body":"That actually makes a tonne of sense, thanks a lot for the explanation, I had always thought the bail had to be paid in full until very recently when I discovered 10% (in a certain state at least) was all that was required to be released.","isChecked":false,"level":7,"score":"30"},{"author":"alsoaprettybigdeal","body":"This is what bounty hunters do. They go arrest the perp who skipped bail so the bondsman isn’t on the hook for the remaining 90%.","isChecked":false,"level":8,"score":"42"},{"author":"honey_bear27","body":"If someone doesn’t have enough cash to post bail, then they are typically allowed to find a bondsman to help.  A bondsman decides the percentage and usually charges 10-15% of the bail amount before they would pay the full amount.\n\nSo if you have a $10,000.00 bond and can’t pay it.  I would charge you $1,000.00.  Once I am paid, I would go to the clerk’s office and pay the full $10,000.00 bond.  I am also taking a risk, because I am telling the court that I will be responsible for you showing up to court. When your case is disposed, then I get my $10,000.00 back plus I keep $1,000.00 you paid me. \n\nHowever, if you skip town and go on the run, I have to bring you back to court or risk losing the $10,000.00 I gave to the court.  I then hire a bounty hunter and will pay them to find you and bring you back.  Once you are caught, I get my money back if the judge hasn’t yet ordered the bond to be forfeited.\n\nSide note. You cannot pay your own bond but you can give someone the funds to pay it for you.\n\nThis is overly simplified and varies state by state, but I hope it helps!","isChecked":false,"level":6,"score":"38"},{"author":"gemini1568","body":"This whole case infuriated me.","isChecked":false,"level":2,"score":"121"},{"author":"ComicWriter2020","body":"I hate to ask, but what happened?","isChecked":false,"level":3,"score":"115"},{"author":"MrPapaya22","body":"Woman married a guy whose wife died like a month prior.  Important to note here that this new guy is a member of a religious cult. Woman’s ex also died, although unrelated. Her kids, ages like 7 and 17, haven’t been heard from since September and authorities wanted to know why, so when they went to ask her, she basically disappeared. Her and her new husband wound up in Hawaii about a month ago. Woman won’t tell authorities where the kids/their bodies are. As of yesterday, news came out that she believed her kids were possessed by spirits or were zombies or something.","isChecked":false,"level":4,"score":"433"},{"author":"WeldNchick89","body":"His wife died 2 weeks prior to her marrying him, her husband was killed in “self-defense” by her brother in July of last year, I think. \n\nThis article is pretty interesting and is only an hour old. \n\nhttps://www.google.com/amp/s/www.deseret.com/platform/amp/u-s-world/2020/3/25/21194350/lori-vallow-daybell-case-chad-daybell-ring-amazon","isChecked":false,"level":5,"score":"226"},{"author":"WhenYouGonnaLearn","body":"Who the fuck is Cox? That came out of nowhere with no explanation. Now I'm just more confused lol","isChecked":false,"level":6,"score":"66"},{"author":"DeadDollKitty","body":"Cox is her brother who died under mysterious circumstances.","isChecked":false,"level":7,"score":"60"},{"author":"luvcartel","body":"You know what they say, when everybody around somebody dies in unexplained ways....","isChecked":false,"level":8,"score":"46"},{"author":"AlienBlueManGroup","body":"here’s a good video describing everything from the beginning, the story is so crazy that the uploader had to physically bring out a board of photos with names labeled just to make it easier to follow along https://youtu.be/X-GuonthUgY","isChecked":false,"level":7,"score":"42"},{"author":"ohtoooodles","body":"And also isn’t the brother dead now? *all totally unrelated though*","isChecked":false,"level":6,"score":"32"},{"author":"diamondmines2","body":"I cannot believe I haven’t heard about this. This is an astonishing story. I really hope those kids turn up ok","isChecked":false,"level":5,"score":"42"},{"author":"hellomynameis_satan","body":"Hope all you want, a little optimism never hurt anybody, but pretty sure we’re well past that point by now","isChecked":false,"level":6,"score":"25"},{"author":"TheReinsofFullnight","body":"Still following this one. So sad about the Gannon Stauch case, I was following that one pretty closely since it was a kid in my friends neighborhood.","isChecked":false,"level":2,"score":"30"},{"author":"PugGrumbles","body":"I half wonder if she didn't shove that poor girl into one of the geysers in Yellowstone. We're still getting decent coverage here in Boise, but I can imagine not elsewhere.","isChecked":false,"level":2,"score":"27"},{"author":"MaddiKate","body":"That's likely it. There's got to be a good reason why the FBI is asking for information about that Yellowstone trip with Tylee.","isChecked":false,"level":3,"score":"27"},{"author":"ohtoooodles","body":"Related: Evelyn Boswell’s remains were found and her mother remains in jail on false reporting charges, but still no charges in the death. Hopefully they’re working hard to build a solid case.","isChecked":false,"level":2,"score":"25"},{"author":"DeadpoolCroatia","body":"Earthquake in Zagreb 3 days ago.\nCorona and earthquake damage are 2 news in the news","isChecked":false,"level":1,"score":"968"},{"author":"PabloXPicasso","body":"That PG&E was responsible for the California fires, and plead guilty to manslaughter of 84 people.  Only two days ago, and already slid off the front page.    https://www.cnn.com/2020/03/23/us/pge-guilty-camp-fire-california/index.html","isChecked":false,"level":1,"score":"464"},{"author":"PM_ME_YOUR_BURDENS","body":"Probably the Oil Price war actually. \n\nSaudi Arabia is trying to force the Russians into cutting production since they won't play ball with OPEC+, and US Shale might pay the price as we need high cost for this entire industry to function.","isChecked":true,"level":1,"score":"25901"},{"author":"moms-sphaghetti","body":"I work in the oil industry.  This is huge right now.  Its honestly just about the same as the coronavirus for us. \nHours getting cuts people losing their jobs etc. All due to oil price and not coronavirus.\nUS Shale IS paying the price.   Even without the virus, it would kill our economy. \nYes, it did start before coronavirus, but the impact happened at the same time.","isChecked":false,"level":2,"score":"1661"},{"author":"FLakIsBack","body":"The reason oil price cratered was because OPEC+ had an emergency meeting after demand fell in China due to the virus. At the meeting, Putin and MBS had a dick measuring contest, and now they're both losing money producing as much as they can to fuck with each other. \n\nThis can't last forever, but might last long enough for US shale, Canadian tar sands, and other world-wide producers to go bankrupt. \n\nThis is amazing for China though. Going to boost their recovery.","isChecked":false,"level":3,"score":"890"},{"author":"lurkinmcdurkin","body":"I'd argue right now that if covid wasn't happening - neither would the oil price war. They can only drop the price of oil super cheap because demand dropped through the floor.","isChecked":false,"level":2,"score":"7079"},{"author":"PITCHFORK_MAGNET","body":"It probably wouldn't have happened, you're right. The additional cuts stemmed from the declining oil demand due to the virus. Had there been no virus, oil demand would most likely have adhered to projections, and cuts would have remained stagnant. Something Russia probably would have agreed to.\n\nEdit: In response to the people saying the price war started before COVID 19 really took off, that's *technically* incorrect. China was already heavily impacted, and the cuts were in response to the reduced demand from that country specifically.  Everything that happened afterwards was icing on the cake. \n\nFor reference to just how much China alone fuels the oil industry - the last major boom was -in large part- because of China's industrial revolution (as depicted on this graph:  [https://www.stlouisfed.org/\\~/media/Publications/Regional-Economist/2016/April/lead\\_fig2.jpg?la=en](https://www.stlouisfed.org/~/media/Publications/Regional-Economist/2016/April/lead_fig2.jpg?la=en) ). Without China's massive industry bustling per the norm and growing at anticipated rates, things can start to crumble quickly.","isChecked":false,"level":3,"score":"1159"},{"author":"5319767819","body":"Didn't the thing started before the coronavirus became the crisis it is right now, though?","isChecked":false,"level":3,"score":"779"},{"author":"whiskeyneat13","body":"Yes, but the reason the Saudis were trying to get the Russians to cut production was because of decreased demand resulting from coronavirus and its impact on industry.","isChecked":false,"level":4,"score":"535"},{"author":"Thutmose123","body":"Prince Andrew trying to defend his ass..","isChecked":true,"level":1,"score":"341"},{"author":"FunnyMiss","body":"Right? It’s gross. And he’s being protected by way more people than he should be.","isChecked":false,"level":2,"score":"33"},{"author":"CaffeinatedLiquid","body":"Bill Gates leaving Microsoft","isChecked":false,"level":1,"score":"4388"},{"author":"persondude27","body":"Woah. [Bill Gates left Microsoft 12 days ago](https://www.cnbc.com/2020/03/13/bill-gates-leaves-microsoft-board.html).\n\nI don't think it changes much - he was on the board, not running daily operations. I doubt they would ignore him if he made a suggestion, though.","isChecked":false,"level":2,"score":"2295"},{"author":"hellodeveloper","body":"Yeah not at all. The company will be perfectly fine without him, and I'm certain they will always listen if he comes back. If anything, it shows he feels the company is in great hands and that he can walk away.","isChecked":false,"level":3,"score":"861"},{"author":"thepopulargirl","body":"That Putin CHANGED his country’s constitution so he can be president until 2036.","isChecked":true,"level":1,"score":"25107"},{"author":"Gorbash38","body":"I think we've all known for awhile that dude's going to leave power in a casket and not a moment sooner.","isChecked":false,"level":2,"score":"12518"},{"author":"Bionic_Ferir","body":"i mean he could go the north korea route having him as supream leader for ever and the person running the country just be like the prime minister","isChecked":false,"level":3,"score":"2694"},{"author":"Cherklov","body":"For some reason Russia likes maintaining the illusion that they're still a democracy. Probably because *certain other world leader(s?)* still continue to fall for it.","isChecked":false,"level":4,"score":"1297"},{"author":"wishthane","body":"Even North Korea pretends to be a democracy.  No, seriously, it's in their name and they hold elections. They even have multiple parties.","isChecked":false,"level":5,"score":"667"},{"author":"Cherklov","body":"Yeah, but the rest of the world doesn't treat NK like they're a legitimate democracy. Trump congratulated Putin on his electoral \"win\" 2 years ago, despite so many experts telling him not to.","isChecked":false,"level":6,"score":"219"},{"author":"WafflesAndMarbles","body":"To be fair there really hasn't been a many times in Russian history when they weren't a borderline or straight up dictatorship and or authoritarian regime. Business as usual for them.","isChecked":false,"level":3,"score":"38"},{"author":"bonjothecrab","body":"To be honest I'm not so much afraid of Putin being in power longer, I'm more afraid of when he finally kicks the bucket and leaves a power vacuum behind. I'm not a fan of the man myself but he's better than a warmonger arrising and creating the cold war part 2","isChecked":false,"level":2,"score":"1579"},{"author":"Otis_-","body":"There is actualy public vote about it in Russia that has been postponed becouse of corona","isChecked":false,"level":2,"score":"98"},{"author":"user_dan","body":"The insider trading scandal in congress.","isChecked":true,"level":1,"score":"8435"},{"author":"Brn44","body":"Yes, but wasn't this precipitated by Covid-19?  Or is there another scandal I'm not aware of?","isChecked":false,"level":2,"score":"677"},{"author":"DavidlikesPeace","body":"This and the oil 'war' are both reactions to the coronavirus. \n\nTo clarify.. Neither would've been likely to occur at this precise time in the virus' absence, but the underlying issue would've likely occurred later on.","isChecked":false,"level":3,"score":"86"},{"author":"Breezel123","body":"Yeah one of the senators in question actually voted against a bill in 2012 that banned insider trading on the basis of confidential information while in office. He was one of three to vote against it. He knew he would one day want to use information he gets in office for his own financial gain. Scumbag.","isChecked":false,"level":4,"score":"46"},{"author":"TannedCroissant","body":"Its fucking disgraceful.  Politicians shouldn't be allowed to own stock.  I mean this is blatant but it makes you wonder how many more subtle buy and sells were done on privy information.\n\nEdit:  A few people talking about blind trusts, that’s probably better than not owning stocks.  Assuming they don’t get to choose when to buy and sell?","isChecked":false,"level":2,"score":"2665"},{"author":"texas_bad_place","body":"They should probably have to have a blind trust","isChecked":false,"level":3,"score":"449"},{"author":"mmellok","body":"ISIS bombs Sikh place of worship in Afghanistan\n\nEdit: thank you for the awards \nEdit2: for everyone mentioning my previous edit, I am Sikh myself so it touches my heart that so many people care about this. I'm not trying to be insensitive","isChecked":true,"level":1,"score":"23058"},{"author":"soulrexer","body":"\n- Afghan officials say 25 were killed and \neight more are wounded in an attack on the Sikh temple in the nation's capital.\n\n- It appears multiple gunmen stormed the temple complex while there were approximately 150 people inside\n\n- A Sikh who took cover says the militants went room to room, shooting and throwing hand grenades.\n\n- The Islamic State organization has claimed responsibility","isChecked":false,"level":2,"score":"4161"},{"author":"Not_a_real_ghost","body":"Fucking assholes are at it again.","isChecked":false,"level":3,"score":"1887"},{"author":"Sir_Mitchell15","body":"Did they ever stop? Or did the media just stop covering it?","isChecked":false,"level":4,"score":"377"},{"author":"rrsn","body":"Well, their activities were down because they were busy fighting the coalition and then they were busy being on the run. I don’t know if anyone thought they were done for good, though. I remember the media warning when the Caliphate was defeated that they’d probably regroup eventually.","isChecked":false,"level":5,"score":"97"},{"author":"Risley","body":"Here’s hoping theses a Hell bc those perpetrators just punched their ticket.","isChecked":false,"level":4,"score":"50"},{"author":"absurdlyinconvenient","body":"aw man, bombing the Sikhs? I know it's ISIS, but c'mon guys","isChecked":false,"level":2,"score":"10328"},{"author":"MrPrius","body":"Most Sikhs are literally the nicest people. They have being kind built in to the religion and have rocking beards and turbans\n\nedit: ok so not *all* Sikhs are nice. that's a given. stop being so angry please","isChecked":false,"level":3,"score":"7535"},{"author":"nastrals","body":"My old boss was a secret alcoholic sadly also a Sikh, he used to hide tiny whisky bottles (from his family) under his turban, he was a genuinely sound guy, and a good boss too.","isChecked":false,"level":4,"score":"2211"},{"author":"prezzz","body":"So he was a Sikhret alcoholic...?","isChecked":false,"level":5,"score":"4842"},{"author":"regmaster","body":"That joke was disturban.","isChecked":false,"level":6,"score":"2832"},{"author":"MajorTomsHelmet","body":"I hate you both...\n\n(Thank you, I needed a laugh)","isChecked":false,"level":7,"score":"49"},{"author":"Graigori","body":"/r/angryupvote","isChecked":false,"level":8,"score":"29"},{"author":"JDudzzz","body":"Weinstein, the bill congress is trying to push through to end encryption, voter suppression...the list could go on","isChecked":true,"level":1,"score":"3675"},{"author":"invaderpixel","body":"Even Weinstein getting coronavirus barely seemed to be a blip on the news radar.","isChecked":false,"level":2,"score":"953"},{"author":"redlinezo6","body":"/r/conspiracy  thinks he doesn't have it and he is going to \"die\" and get a bunch of plastic surgery and escape to europe or something.....","isChecked":false,"level":3,"score":"46"},{"author":"Aikano9","body":"Hope he survives so he can rot in jail instead of getting the easy way out","isChecked":false,"level":3,"score":"95"},{"author":"Rockytriton","body":"because nobody believes it.  In a few weeks we'll hear that he died from it.  yeah fucking right...","isChecked":false,"level":3,"score":"178"},{"author":"SnacKEaT","body":"Weinstein was confirmed to have the coronavirus, were you talking about that or his sentencing?","isChecked":false,"level":2,"score":"242"},{"author":"ArguesAboutAllThings","body":"I definitely heard about his sentencing.","isChecked":false,"level":3,"score":"25"},{"author":"Wiki_pedo","body":"Weinstein was in the news...for testing positive for coronavirus ;)","isChecked":false,"level":2,"score":"31"},{"author":"123dream321","body":"Nth room case in Korea. Telegram porno sexual slavery ring with 74 victims including underage girls. The telegram groups has estimated at least 10 to 30 thousands subscribers. \n\nThe “nth room” perpetrators are accused of luring victims, including minors, into sending sexually explicit photos and videos. In some cases, this escalated to using blackmail to force victims into increasingly violent acts, including sexual assault\n\nAbsolutely disgusting. I'm surprised that this news didn't get bigger internationally\n\nEdit :Reporters at Kookmin Ilbo observed about 25,000 users across 30 such chat rooms.","isChecked":true,"level":1,"score":"21802"},{"author":"PolarLight","body":"One of the guys in charge of the rooms has had his identity revealed and the rest (one other main guy and the people who participated) are being investigated as of right now. \n\nReports are saying that a few high profile celebrities, professors and athletes are some of the 260k involved in the viewing and/or distributing of the illegal contents. Which is unsurprising considering the \"entrance fee\" to access these rooms were between $300 to $1500. \n\nHope justice is served and served well. Korean law is known to be very forgiving for sex crimes, so I hope things change with this.\n\nEdit: [Here is an article you can read to get more information](https://m-en.yna.co.kr/view/AEN20200323002900315)\n\n[#Two with one of the victims](https://www.koreaboo.com/news/victim-telegram-nth-room-case-speaks-horrors-faced-middle-school-student/)\n\n[Another in depth article ](https://qz.com/1824130/korea-shocked-by-telegram-chat-room-sexual-abuse-scandal/)\n\nEdit 2: It's been recently reported that one of the youngest victim include one as young as 9 years old, 11 years old and also an underage female idol/singer.","isChecked":false,"level":2,"score":"6163"},{"author":"sugarcat203","body":"Article 1 for the lazy\n\n\"SEOUL, March 23 (Yonhap) -- More than 2 million people have signed an online petition as of Monday demanding the government unveil the identity of a man who allegedly ran a group chat room where photos and videos of violent sex acts, involving underaged victims, were distributed.\n\nAt least 74 victims are known to have been exploited in the so-called Nth room case, in which a man surnamed Cho allegedly lured victims into taking naked photos and later threatened and exploited them into more gruesome sex acts.\n\nCho, who used the nickname \"baksa,\" which means \"doctor\" or \"guru\" in Korean, is accused of distributing the videos in a group chat room on the messaging service Telegram, where at least 10,000 users are suspected of paying Cho to watch the videos.\n\nPolice have so far tracked down 124 people in relation to the case, including Cho and 17 others who have been formally detained. The user who is suspected of first creating the chat room, however, still remains at large.","isChecked":false,"level":3,"score":"1374"},{"author":"princessducky21","body":"If any of you read further articles and translated statements from the prosecution, you’ll understand exactly how messed up the sex acts these women and girls were forced to perform. \nBody mutilations like >!slicing off their nipples, gang rape, forced to eat scat, mental and physical torture of all kinds !< stuff you read about when you look up deep web torture cam stories. \n\nCho and the others should be executed. Time shouldn’t even be wasted on them keeping them alive. That asshole couldn’t even muster a half assed apology when asked for a statement, instead thanking prosecutors for stopping him. His face is completely without remorse. People like this have no redeemable value for human society.","isChecked":false,"level":4,"score":"78"},{"author":"itsthecoop","body":"wtf?! and here is was thinking that it was \"normal\" sex acts (which would obviously still be horrible. but ... I guess ... not as horrible, after reading that?!)","isChecked":false,"level":5,"score":"26"},{"author":"princessducky21","body":"Not just this. It was revealed recently he took $4 million  for a contract killing to murder a mother and child. \n\nHe also threatened and extorted journalists by hacking into their personal information and sending frequent death threats to them and their families. \n\nWarning: the following involves threats of sexual violence, descriptions of sexual violence, etc. \n\nThe following is an example of a threat sent to a victim by one of the 13 perpetrators.\n\n“Hello, seems like you’re still alive? I sent a USB drive to your school, but judging from the way you act, it seems like you still haven’t fully gotten my message yet. I’m sure I’ve said this clearly before. If you don’t listen to me, I will f*ck up your life. Reply to this message as soon as you received it. If you don’t then I’m gonna send your father videos of you masturbating with a dildo in the bathroom, along with the sex slavery contract that you word. I’m also going to share all of your videos on Twitter’ ‘Don’t ever think you can get out of this, I won’t be saying this twice. I’m going to send something to your house. I hope you’ll live with this fear for the rest of your life”","isChecked":false,"level":6,"score":"36"},{"author":"starlightshower","body":"What frightens me even more than just the crime happening in itself is that the reaction from the public is \"mixed\". Of course many are horrified and want further investigation, but some have little to no sympathy to the victims as some \"willingly posted nudes online\" and therefore gave the criminals a way to blackmail them. There's also a comparison to another case where a male celebrity had a video of him masturbating leaked, and many publicly gave him the cold shoulder saying things like \"there was no reason to make something like that\". In Korea there is still a lot of victim blaming in cases of sexual abuse, revenge porn, and other crimes which to me is just heartbreaking, especially considering the ages of some of the victims in this case.","isChecked":false,"level":4,"score":"98"},{"author":"methylenebluestains","body":"So it's Epstein and his blackmail material friends all over again? What is it with the rich creeping on kids?","isChecked":false,"level":3,"score":"27"},{"author":"PorQueNoTuMama","body":"260k is wrong. That's the total accounts across all rooms. Only a small number of rooms were involved and accounts belonged to multiple rooms. We're likely dealing with around 10-30k *people*.\n\nSee the [discussion](https://old.reddit.com/r/korea/comments/fnh87h/journalism_talk_js_deep_dive_into_the_telegram/) I was having with another korean based on a journalistic deep dive looking to strip the sensationalism from the topic.","isChecked":false,"level":3,"score":"26"},{"author":"Eddy699","body":"Saw it on bbc news top stories this morning, then was quickly pushed down the order","isChecked":false,"level":2,"score":"480"},{"author":"Cantmakeaspell","body":"Well that’s just messed up...  Big fan of that app too.","isChecked":false,"level":2,"score":"438"},{"author":"123dream321","body":"The part about 260k member messed me up. Just how many people had came across the telegram groups but did not sound any alarm.","isChecked":false,"level":3,"score":"695"},{"author":"HCM35","body":"That number is wrong, the suspected number by the police is 10k - 30k. \n\n260k was made by adding the total number of views (I think it was views but I may be wrong) without accounting for the fact that most would be from the same people.","isChecked":false,"level":4,"score":"163"},{"author":"goldenCapitalist","body":"Thank you. The article said 10K members, wanted to see if anyone could clarify the discrepancy of OP and the article.","isChecked":false,"level":5,"score":"24"},{"author":"PM_ME_THICC_GIRLS","body":"How do you even come across telegram groups?","isChecked":false,"level":4,"score":"277"},{"author":"phasers_to_stun","body":"The locusts in Africa. Well probably not in American news. But it's still pretty big news imo.","isChecked":true,"level":1,"score":"15224"},{"author":"TheEternalCity101","body":"Its hitting Pakistan too, and China is prepping to send 700,000 ducks to stop the locusts. Easy to control, and one duck can eat 200 locusts a day","isChecked":false,"level":2,"score":"3928"},{"author":"ThinkPan","body":"D U C K F O R C E","isChecked":false,"level":3,"score":"3534"},{"author":"big_axolotl","body":"Woo WOO","isChecked":false,"level":4,"score":"949"},{"author":"ImSomebodyNow","body":"Danger lurks behind you!","isChecked":false,"level":5,"score":"46"},{"author":"infinitystarfish","body":"There’s a stranger out to find you","isChecked":false,"level":6,"score":"28"},{"author":"rochford77","body":"Flying V, bitch. It’s knuckle puck time.","isChecked":false,"level":4,"score":"27"},{"author":"DragonStangFlyer122","body":"Then when the ducks are too invasive we send in snakes to eat the ducks. And when the snakes take over we send in gorillas to take care of the snakes. Then we just wait for winter for the gorillas to freeze.\n\n[https://www.youtube.com/watch?v=P9yruQM1ggc](https://www.youtube.com/watch?v=P9yruQM1ggc)","isChecked":false,"level":3,"score":"1148"},{"author":"crazyzthephd","body":"And finally, send in the locusts to eat the rotting corpses in the spring thaw","isChecked":false,"level":4,"score":"446"},{"author":"fusfeimyol","body":"Boy do I love the food chain","isChecked":false,"level":5,"score":"47"},{"author":"lmirise","body":"But... we could just eat the ducks.","isChecked":false,"level":4,"score":"26"},{"author":"ChocolateBunny","body":"I need to see the source for this.","isChecked":false,"level":3,"score":"79"},{"author":"TheEternalCity101","body":"https://www.bbc.com/news/world-asia-china-51658145","isChecked":false,"level":4,"score":"102"},{"author":"randomuser1657","body":"Jesus, I'm not religious but having 2 of the horsemen kicking around is pretty fucked.","isChecked":false,"level":2,"score":"9552"},{"author":"ilikebigpps","body":"3* as there are  wars going on right now\n\nOkay I should have mentioned that I also count in economic wars.","isChecked":false,"level":3,"score":"4561"},{"author":"nerdyfanboy1","body":"It's all 4. Death is everywhere as well","isChecked":false,"level":4,"score":"3841"},{"author":"ueriah","body":"I always felt Death was kind of a shitty horseman of the Apocalypse.\n\nI mean the other three kill you, in a predictable way. You either starve to death or fight until death or get sick and die. So is Death the horseman of like car accidents?","isChecked":false,"level":5,"score":"3353"},{"author":"myusernamehere1","body":"There are three that cause death, and one that is death","isChecked":false,"level":6,"score":"1363"},{"author":"ueriah","body":"So if you slip in the shower, get into a car accident, or get eaten by a lion, you get the same horseman?\n\nHe’s gotta be busy af","isChecked":false,"level":7,"score":"1168"},{"author":"KazDragon","body":"Ah yes, Pestilence, ~~Plague~~War, Famine and Misadventure.\n\n(Edit: His Royal Plagulence has indeed been doing his squats.)","isChecked":false,"level":8,"score":"768"},{"author":"ueriah","body":"Pestilence must have not skipped leg day to get a double shout out.","isChecked":false,"level":9,"score":"263"},{"author":"SuspiciouslyElven","body":"Pestilence,War,Famine, and worksite accidents due to non-compliance with OSHA standards.","isChecked":false,"level":9,"score":"31"},{"author":"IffySaiso","body":"Well in that case I can think of no thing better than being forced to be real close to my most loved ones 24/7 for the foreseeable future","isChecked":false,"level":5,"score":"49"},{"author":"OldManScary","body":"There has never been less armed, organized conflict around the world than there is right now.","isChecked":false,"level":4,"score":"194"},{"author":"FaultySky","body":"I kid you not, but 2 days ago I had a really shitty dream where that entire qoute about the rider on a pale hours kept repeating itself while dreaming the most fucked up scenarios nd I woke up in cold sweats.\n\nI'm not even religious but that one messed me up for a day or so.","isChecked":false,"level":3,"score":"244"},{"author":"felesroo","body":"Fun fact!\n\nThe fourth horseman, who rides a Pale (khloros) horse, is the only horseman given a name: Thanatos -- Death.\n\nAnother Fun Fact! : The translation of the horse's color is typically \"pale\" but in the sense of \"ashen, sickly, pallid\" suggested by the original Greek, which lends its meaning in words like chlorophyll, the substance that converts light to energy in plants and gives the leaves a green color. This suggests that Death rides a horse that is corpse-like.","isChecked":false,"level":4,"score":"53"},{"author":"CrimsonQueso","body":"Tbf all 4 horsemen have been around for most of human history in much greater numbers until recently. People died of disease, famine, and war in much higher rates 100 years ago, or even 2000 years ago, when the four horsemen were invented","isChecked":false,"level":3,"score":"246"},{"author":"notyouravgredditer","body":"I have seen it in the news I don't know how bad it is but it doesn’t look good","isChecked":false,"level":2,"score":"128"},{"author":"phasers_to_stun","body":"https://www.bbc.com/news/in-pictures-51618188\n\nThey're going to eat all the crops. People who are already starving are going to have even less and the rest of the world is trying to fight Covid. It's not a great situation. This \"article\" is cool though because it talks about deploying ducks to eat the locusts which is neat.","isChecked":false,"level":3,"score":"518"},{"author":"Roland_T_Flakfeizer","body":"What will they get to kill all the ducks though?","isChecked":false,"level":4,"score":"144"},{"author":"Meior","body":"People can hunt them I suppose, more food?","isChecked":false,"level":5,"score":"214"},{"author":"Roland_T_Flakfeizer","body":"Ok, but once all the people are eating the ducks, what will we get to eat all the people?","isChecked":false,"level":6,"score":"219"},{"author":"Meior","body":"The superducks, of course.","isChecked":false,"level":7,"score":"223"},{"author":"Hey--Ya","body":"sounds like some rimworld-ass shit","isChecked":false,"level":8,"score":"68"},{"author":"DiscoTut","body":"A thousand duck-sized horses","isChecked":false,"level":5,"score":"36"},{"author":"AnAdvancedBot","body":"Don't locust storms happen relatively often in certain parts of Africa?","isChecked":false,"level":2,"score":"120"},{"author":"phasers_to_stun","body":"I think it's like every 17-20 years.","isChecked":false,"level":3,"score":"106"},{"author":"dm_me_alt_girls","body":"TIL locusts come back and leave as often as my dad","isChecked":false,"level":4,"score":"69"},{"author":"EviLincoln","body":"That guy that was the second person ever to be cured of HIV","isChecked":true,"level":1,"score":"11065"},{"author":"jlp29548","body":"Technically that happened a long time ago. He’s still cured (as was expected) like 3 years later.","isChecked":false,"level":2,"score":"2926"},{"author":"EviLincoln","body":"You are indeed correct. The radio show I was listening to was just talking about it at great length as if it just happened, so I figured it was recent.","isChecked":false,"level":3,"score":"928"},{"author":"Ongo_Gablogian___","body":"Yeah with diseases like this it is sort of like cancer where you cam test negative but still have a small undetectable amount so they keep checking in case it resurges. So if it stays away for sure then it's a cure, that's why this HIV stuff is reported repeatedly but it's just news confirming he's still cured.","isChecked":false,"level":4,"score":"48"},{"author":"drlqnr","body":"well, still happy for that guy","isChecked":false,"level":4,"score":"26"},{"author":"TheBeardedMann","body":"He was cured of HIV.  He's still cured of HIV, but he was cured of HIV too.","isChecked":false,"level":3,"score":"517"},{"author":"is-this-a-nick","body":"He was cured in very much the same way cutting somebodies leg of cures athletes foot.\n\nThe procedure is waaay more dangerous than having HIV, and the curing was just a side effect of the cancer treatment.","isChecked":false,"level":2,"score":"30"},{"author":"jamescsalmon215","body":"The US government trying to pass an “anti child porn law” that actually just gives them the ability to search through all of our messages\n\nEDIT: If you want to learn more about this act, here’s [a link](https://act.eff.org/action/protect-our-speech-and-security-online-reject-the-graham-blumenthal-bill) to an article with some great information.","isChecked":false,"level":1,"score":"45065"},{"author":"obog","body":"And also bans end-to-end encryption, if you know anything about internet security you know that would be devastating to literally everything that's based online in any way whatsoever","isChecked":false,"level":2,"score":"11889"},{"author":"SpehlingAirer","body":"Wait what? Nobody would be allowed to use end to end encryption????","isChecked":false,"level":3,"score":"4228"},{"author":"obog","body":"Yep, which means that the government (and anyone who's decent at using computers) could get into any person or corporations secrets if they are able to intercept a message. Normally it's not a problem because of end to end encryption.","isChecked":false,"level":4,"score":"4654"},{"author":"things_will_calm_up","body":"And if the government can, anyone can.","isChecked":false,"level":5,"score":"3173"},{"author":"santaliqueur","body":"“We will only let good guys have access”\n\n— Elderly people who don’t understand technology but want access to read all our communication\n\nThis is worse than forcing you to hand over a key to your house to the police. But hey, if you aren’t breaking any laws...","isChecked":false,"level":6,"score":"4164"},{"author":"Irrepressible87","body":">This is worse than forcing you to hand over a key to your house to the police.  \n   \nIt's like outlawing locks on doors.","isChecked":false,"level":7,"score":"2791"},{"author":"Poem_for_your_sprog","body":"\"We just want the world to be *safer*,\" they said -  \n\"And endlessly better for ages ahead!  \nWe just want the world to be *safer* -  \nthat's *it.*\n\n... or maybe we just want to look through your shit.\"","isChecked":false,"level":8,"score":"3498"},{"author":"PatrollMonkey","body":"I love it when Poem for Sprog uses poetry to criticize the government, please do it more often! <3 We love you!","isChecked":false,"level":9,"score":"523"},{"author":"CedarWolf","body":"Not to mention what it would do to online financial transactions. Hey, when you buy stuff online and when you trade stocks, they keep those transactions secure by way of encryption.","isChecked":false,"level":5,"score":"24"},{"author":"captainhukk","body":"it would be allowed to be used, its just back-doors would be required into them, which if you know anything about internet security, will ultimately not only be exploited by the government, but found by other malicious users, which essentially renders the encryption useless","isChecked":false,"level":4,"score":"447"},{"author":"mrchaotica","body":"Encryption with back doors (or more accurately, front doors that the service provider holds the keys to) doesn't count as \"end to end.\"","isChecked":false,"level":5,"score":"235"},{"author":"exatron","body":"Or encryption.","isChecked":false,"level":6,"score":"170"},{"author":"Mcfuggery","body":"They pulled it off successfully with the PATRIOT ACT against terrorists, so why not do it with pedophiles, despite immunity being granted to the rich ones?","isChecked":false,"level":2,"score":"5302"},{"author":"easteriscancelled","body":"what about teens with each other?","isChecked":false,"level":3,"score":"1259"},{"author":"ScoutTheTrooper","body":"That’s still technically illegal","isChecked":false,"level":4,"score":"1407"},{"author":"FBI_Man123","body":"But is a lot different than if an adult did it. There's a difference in the morality of it between teens and between a teen and adult.","isChecked":false,"level":5,"score":"955"},{"author":"wholesome_cream","body":"Trust him, he's the FBI Man ^^","isChecked":false,"level":6,"score":"801"},{"author":"youdubdub","body":"What's not to trust?","isChecked":false,"level":7,"score":"126"},{"author":"MrDrPatrick2You","body":"I believe it was Lincoln who said, \"the information on the world wide web is always the truth.","isChecked":false,"level":8,"score":"190"},{"author":"cheezeyballz","body":"Not to adults. I know a guy who is in his 40s who is a felon for having consensual sex with a 14 year old and he was 16 at the time. Her parents decided to drop the charges but the state proceeded anyway. He has had trouble finding a job or a place to live ever since. No ones sees the context just that he is a felon sex offender. Not to mention, he's black and this was in Texas. (Thought I'd mention it anyway).","isChecked":false,"level":6,"score":"322"},{"author":"S_H_A_N","body":"> Her parents decided to drop the charges but the state proceeded anyway.\n\nYeah.\n\nThat's because it was never their decision. \n\nAnd for the record, I'm with you here. What happened to this man is wrong, almost criminal in its own right. A modern scarlet letter. \n\nBut in a criminal trial, victims do not press or drop charges, ever. It's always going to be Texas (or some state) v The Defendant or The United States v The Defendant.\n\nThis might not sound true to a lot of people, but that's because tv and movies frequently get it wrong, e.g. \"He was beating his wife but she didn't want to press charges so there was nothing we could do, lieutenant.\"\n\nI'm not trying to nitpick -- I just think this is the sort of thing more people should know.","isChecked":false,"level":7,"score":"129"},{"author":"Canadian_Infidel","body":"I've tried to explain that to people and the flat out do not believe me. About things in *real life* no less.","isChecked":false,"level":8,"score":"45"},{"author":"luigithebagel","body":"Doesn't stop the government from filling up those private prisons with young, capable workers unfortunately.","isChecked":false,"level":6,"score":"126"},{"author":"ThePiperMan","body":"Wait, the name of the bill doesn’t actually tell you what it is? /s\n\nFuck those guys","isChecked":false,"level":2,"score":"2083"},{"author":"bretth1100","body":"More common than you think. How do you pass really shitty legislation that’s basically nothing more than a power grab? Give it a wonderful sounding name like anti child porn law or the patriot act. Then come out and say: this bill intends this or intends to achieve that.....don’t talk about what the actual bill is or says, only what the intentions are and make it sound wonderful. Third step is when someone argues against it you say what you hate children? You don’t want to stop child porn? You don’t like patriotism? Don’t you want to get rid of terrorists and feel safe? \n\nWhenever you hear a politician talking about intentions be very skeptical and it’s probably a good idea to find out what the legislation actually says.\n\nEdit: wow thank you for the silver and all the responses, this really blew up more than I expected, even though I haven’t responded I agree with many comments. Thanks","isChecked":false,"level":3,"score":"2100"},{"author":"throwaway1point1","body":"The Patriot Act.\n\nThe name was brilliant branding, as it's a crazy power grab with a lot of nasty shit hidden in there.\n\nBut how do you vote against something labeled \"Patriot\"?","isChecked":false,"level":4,"score":"751"},{"author":"DrPrismarineBluefall","body":"The Patriot Act is one of the most unpatriotic pieces of legislation in this nation.\n\nIt's so much of a misnomer that it's comical.","isChecked":false,"level":5,"score":"283"},{"author":"None","body":"[deleted]","isChecked":false,"level":4,"score":"272"},{"author":"ghostprincecas","body":"It also ruins encryption and basically sacrifices the foundation the Internet is built on","isChecked":false,"level":2,"score":"466"},{"author":"EntireGoose","body":">between this, EU's Article 13, and China's Sesame Credit\n\nWell, we had a good run I suppose. Goodbye, free internet :(","isChecked":false,"level":3,"score":"29"},{"author":"Potato_Boi69","body":"There’s gonna be a very large amount of lawsuits over this seeing as it VIOLATES THE CONSTITUTION","isChecked":false,"level":2,"score":"769"},{"author":"electricshout","body":"So did the patriot act. That was almost 20 years ago. No one has done anything about it.","isChecked":false,"level":3,"score":"740"},{"author":"Emailisnowneeded","body":"They also just \"re-upped\" it","isChecked":false,"level":4,"score":"151"},{"author":"KaiMolan","body":"Even Obama re-upped it and added on Articles 1021 and 1022 to the NDAA in his first term. Its the dangers of letting any organization grow too much political power, our checks and balances don't work anymore and haven't for a long, long, time. \n\nOur two party system has destroyed the original intent of The Constitution, and The Bill of Rights. Lots of arguing allowed, but only along a limited spectrum.","isChecked":false,"level":5,"score":"206"},{"author":"SmartPriceCola","body":"In Scotland -\nFormer First Minister being cleared of rape charges","isChecked":true,"level":1,"score":"762"},{"author":"scottevil110","body":"The government is trying to basically ban encryption and start imprisoning website owners if their users say the wrong things.","isChecked":true,"level":1,"score":"13841"},{"author":"wasting_lots_of_time","body":"Crisis: \\*happens\\*\n\nGovernment: \"Time to start taking more civil liberties from our people!\"","isChecked":false,"level":2,"score":"7594"},{"author":"hieberybody","body":"Never let a good crisis go to waste","isChecked":false,"level":3,"score":"463"},{"author":"scottevil110","body":"I was thinking last night, because I was reading about how South Korea got downright draconian there for a couple of weeks...but it worked.  And most importantly, they GAVE THE LIBERTIES BACK.\n\nIt would be a lot easier to trust the government to take drastic action in times of crisis if you didn't just fucking know they were never giving that shit back.  Maybe if we weren't on year 19 of the god damn PATRIOT act, with the TSA still fondling children and stealing things, it'd be a little easier to welcome the idea of some strict controls to help in times of crisis.\n\nBut when the government has decided that \"forever\" is a time of crisis for the purpose of them fucking you over, then it's more difficult to trust them.","isChecked":false,"level":3,"score":"3587"},{"author":"1boss_hog1","body":"But we've always been at war with Eurasia","isChecked":false,"level":4,"score":"2918"},{"author":"Tdir","body":"Or was it Eastasia?","isChecked":false,"level":5,"score":"888"},{"author":"stressorglasgow","body":"Double plus good, this one.","isChecked":false,"level":6,"score":"490"},{"author":"thereallorddane","body":"*\\[MiniLove has entered the chat\\]*","isChecked":false,"level":6,"score":"95"},{"author":"kindad","body":"Are you an enemy of the state or something? Eastasia has always been our ally, you can literally look at our historical records.","isChecked":false,"level":6,"score":"47"},{"author":"MrPrius","body":"Honestly just listen to the Telescreen","isChecked":false,"level":7,"score":"27"},{"author":"Papaya_flight","body":"'Smith!' screamed the shrewish voice from the telescreen. '6079 Smith W.! Yes, you! Bend lower, please! You can do better than that. You're not trying. Lower, please! That's better, comrade!","isChecked":false,"level":6,"score":"31"},{"author":"MartyMcFly_jkr","body":"You've been clearly been deluded by Goldstein and his followers. Go to room 101 please.","isChecked":false,"level":5,"score":"28"},{"author":"nuclearsummer89","body":"War is peace, \n\nfreedom is slavery, \n\nignorance is strength, \n\nbig brother is watching...","isChecked":false,"level":5,"score":"29"},{"author":"fiji_bongwater","body":"Has something recent happened on this front? I can't seem of find anything about it","isChecked":false,"level":2,"score":"93"},{"author":"cat-meg","body":"It's called the EARN IT Act for easier Googling.","isChecked":false,"level":3,"score":"185"},{"author":"diegoham","body":"Its already spring....","isChecked":false,"level":1,"score":"1743"},{"author":"The-Asshat","body":"Holy shit. You're right.","isChecked":false,"level":2,"score":"137"},{"author":"NforNarcissism","body":"Genocide in Myanmar. It’s been going on for a while and only recently has there been a vote on if it’s a problem.","isChecked":true,"level":1,"score":"1910"},{"author":"LimeSugar","body":"The 2020 Presidential election","isChecked":false,"level":1,"score":"35784"},{"author":"Lateral_Thinking_04","body":"Seriously, who the fuck is going to win?","isChecked":false,"level":2,"score":"3227"},{"author":"jyok33","body":"I really thought trump was gonna win easily, but now with all this stuff who knows what’s gonna happen. Economy turned to shit plus who knows how many people are gonna be dead in the next couple months. Wonder if the blue collar will turn their back on trump","isChecked":false,"level":3,"score":"2236"},{"author":"LongDickOfTheLaw69","body":"Considering the advanced age of every candidate still left in the presidential race, Covid-19 might pick the next president for us.","isChecked":false,"level":4,"score":"1626"},{"author":"KlausVonChiliPowder","body":"Either pick the candidates or pick the voters.","isChecked":false,"level":5,"score":"347"},{"author":"ricardoandmortimer","body":"It's going to change nothing.  If you hated Trump before you aren't going to like his response and won't vote for him (wouldn't have anyway).  If you liked Trump before you probably think he did a good job handling the crisis and the economic downturn is out of his control - so you'll still vote for him.\n\nThe current polls support this theory.","isChecked":false,"level":4,"score":"206"},{"author":"-null","body":"So, does the pandemic help republicans or democrats?\n\n/ducks","isChecked":false,"level":2,"score":"1239"},{"author":"Otto_the_Autopilot","body":"Democrats.  Trump is immune to public opinion so this just gives less time for Biden to dig himself a hole.","isChecked":false,"level":3,"score":"1585"},{"author":"MrHanSolo","body":"Never thought I'd be *thankful* for a pandemic!","isChecked":false,"level":2,"score":"19822"},{"author":"Named_after_color","body":"This comment's going to age real well. Fine vintage.","isChecked":false,"level":3,"score":"6231"},{"author":"Thugnificent646","body":"The only politics I want to hear are which toilet paper barons I'm going to sacrifice my rations to, to get that sweet sweet TP.\n\nOh, grugg the toilet paper baron of the west was slain by the forces of bolbi the toilet paper baron of the east and we are now living within his domain? Don't care as long as my water flavored ration tax isn't raised.","isChecked":false,"level":4,"score":"1416"},{"author":"Aristea84","body":"I'm glad that the term toilet paper baron is entering our lexicon. The silver lining of all of this.","isChecked":false,"level":5,"score":"158"},{"author":"Alicee-","body":"That all the millions of dollars we raised for the people affected by the bush fires in Australian has maybe vanished. I’ve spoken to a few people who’s houses burnt down and they haven’t seen a cent. Where did the money raised go I wonder?","isChecked":true,"level":1,"score":"2966"},{"author":"penislovereater","body":"The money that went to reputable organisations will still be handed out for awhile. Those orgs know that the need lasts a lot longer than the news spotlight and public attention. Even worse for the tourist towns that are now not getting any traffic over Easter and likely until at least summer.","isChecked":false,"level":2,"score":"806"},{"author":"roslya-1234","body":"One of my family members Is involved with the Red Cross. It’s taking a while to give the money to the ones in need as they are shuffling through thousands and thousands of applications  daily and a lot of them are scammers trying to get free money, so trying to decipher that is what is hard. They’ve helped a fair amount of people but it’s just taking a while. All the workers have been trying their hardest. Shame media portrays such a bad picture of their efforts.","isChecked":false,"level":2,"score":"92"},{"author":"melzeboss","body":"Do you mean the $51 million raised by Celeste Barber? I think that’s the fundraiser that attracted the most attention. Big problem is that it was to raise money for the rural fire service specifically and so it can only be used for firefighting equipment, resources and training for volunteer brigades, this will probably be helpful next year, since our fire seasons are expected to get worse. She never intended to raise so much money and probably should have stopped it and began another one for a different cause, like wires, think it just sort of spiralled out of control.","isChecked":false,"level":2,"score":"24"},{"author":"thatsnotgr8m8","body":"The US government wanting to ban end-to-end encryption","isChecked":true,"level":1,"score":"53219"},{"author":"Gevri","body":"Its fucking stupid. What I’ve heard is that companies that continue to use end-to-end encryption will be stripped of their Section 230 protections (they will then be responsible for any illegal shit found on their platform) which will really fuck up every social networking platform because there’s gonna be illegal shit on there. Companies that comply and remove their e2e encryption will keep their Section 230 protections but essentially open up their platform to a host of security vulnerabilities. As a cybersecurity enthusiast, I should point out that a ton of its supporters seem very uninformed on the benefits of e2e encryption. \n\nIt’s a stupid idea.\n\nEdit: For those wondering why the government is even considering this, its because the bill supporters claim it will “bring child predators to justice.” It’s a stupid idea that won’t work and I honestly don’t see how anyone with the slightest bit of clarity could think otherwise.","isChecked":false,"level":2,"score":"13352"},{"author":"NovaThinksBadly","body":"They want them open to security vulnerabilities so its easier for the government to secretly take data from them.","isChecked":false,"level":3,"score":"4577"},{"author":"Torodong","body":"While that is certainly true, even people as dumb as US senators should be able to grasp the idea that if you make a hole in the wall of a bank to let the police in quicker, then bank robbers can also go in through the hole in the wall.  \nIt really is that simple.","isChecked":false,"level":4,"score":"5642"},{"author":"StuntsMonkey","body":"But you're supposed to put a sign over the hole that says, \"Authorized Person's Only\".  That way the bad guys can't use it.","isChecked":false,"level":5,"score":"2677"},{"author":"KingOfAllWomen","body":"You laugh but that disclaimer is on just about every piece of networking equipment i've ever touched. \"If you are not authorized for use, you must disconnect immediately!\"\n\nLike i'm sure the threat actors see that and just immediately close their sessions like \"Oh shit, I almost broke the rule!\"","isChecked":false,"level":6,"score":"1347"},{"author":"StuntsMonkey","body":"I used to be in networking and that was the exact example I was thinking of.","isChecked":false,"level":7,"score":"285"},{"author":"Steelux","body":"I thought that was a necessary warning to ensure unauthorized personnel can be punished for accessing that equipment. With the message there, they can't feign ignorance.","isChecked":false,"level":7,"score":"33"},{"author":"ThisIsAlreadyTake-n","body":"But it's illegal and we all know illegal things never happen. /s","isChecked":false,"level":5,"score":"336"},{"author":"jjake101","body":"Wouldn't this kill online banking?","isChecked":false,"level":2,"score":"2541"},{"author":"throwaway1point1","body":"Really would.\n\nBanking is completely untenable without proper encryption.","isChecked":false,"level":3,"score":"2336"},{"author":"Reacher-Said-Nothing","body":"Online banking does not rely on section 230 protections, so they would continue to use encryption.","isChecked":false,"level":4,"score":"1012"},{"author":"yur_mom","body":"It would kill online commerce.  It would kill people working remotely that need to access their private work network.\n\n\nIt would never happen because it makes no sense and would be impossible to enforce.","isChecked":false,"level":3,"score":"865"},{"author":"bad_at_hearthstone","body":"> It would never happen because it makes no sense and would he impossible to enforce.  \n  \n_laughs in prohibition_","isChecked":false,"level":4,"score":"808"},{"author":"Certified_GSD","body":"This is just like stupid old politicians demanding Apple add a backdoor to iPhones. \"We promise we'll keep the keys safe!\"\n\n\nEncryption can be used for bad things, but that applies to literally anything.","isChecked":false,"level":2,"score":"226"},{"author":"itdoesdnotmatterwho","body":"Call me stupid but would this affect anyone outside of america?","isChecked":false,"level":2,"score":"527"},{"author":"90thbattalion","body":"It very likely would in some way at least since many tech companies are based in the United States","isChecked":false,"level":3,"score":"865"},{"author":"Crozzfire","body":"Not afterwards","isChecked":false,"level":4,"score":"726"},{"author":"Smittywerbenjagerman","body":"Tru\n\nIf the USA banned e2e encryption, I would move my app servers to Mexico and Canada. And my app doesn't even handle sensitive data.\n\nTheres already a ton of infrastructure in Vancouver which would likely serve as the new hub for west coast data centers.","isChecked":false,"level":5,"score":"641"},{"author":"TheMagnificentBean","body":"I work in cybersecurity and this is literally one of the dumbest things you can do for your economy. Every large company is expected to encrypt any data that is personal, confidential, financial, employment, and the list goes on and on. They will refuse to work with other countries, they will refuse to offer lots of online services such as banking. Most jobs that are work from home right now due to COVID require VPN and in-transit encryption, so that would go away and bring up unemployment another 10-15%.\n\nHell, under CCPA regulations in California you are legally compelled to use in-transit encryption. It’s absolutely inane to believe you can ban that and expect all to be well and dandy.","isChecked":false,"level":2,"score":"50"},{"author":"gdude32","body":"What is the argument for this? I’ve only seen people say why it is bad. If it’s so bad, what are the politicians saying to make it seem good?","isChecked":false,"level":2,"score":"24"},{"author":"Dummdukk","body":"Yes the Hong Kong protests are still ongoing.","isChecked":true,"level":1,"score":"5439"},{"author":"inertargongas","body":"The Chinese government is getting more heavy handed now that everyone's attention is focused elsewhere.","isChecked":false,"level":2,"score":"1931"},{"author":"None","body":"[deleted]","isChecked":false,"level":1,"score":"8502"},{"author":"Cormocodran25","body":"Hey, nobody can say he doesn't embody Florida though.","isChecked":false,"level":2,"score":"4938"},{"author":"phasers_to_stun","body":"He didn't win. I think that means he's not Florida *enough*. They needed way more wild animals in their sexcapades. The meth just wasn't enough.","isChecked":false,"level":3,"score":"1670"},{"author":"None","body":"[deleted]","isChecked":false,"level":4,"score":"380"},{"author":"Roland_T_Flakfeizer","body":"Better than a subtle dosing male escort I suppose","isChecked":false,"level":2,"score":"812"},{"author":"MrHanSolo","body":"Wow, that sounds like a South Park episode.","isChecked":false,"level":2,"score":"609"},{"author":"BrainWithAMouth","body":"Maybe not the biggest but ones that could've gotten way more traction:\n\n[Linda Farstein sues Netflix](https://www.nbcnews.com/news/nbcblk/linda-fairstein-sues-netflix-over-portrayal-when-they-see-us-n1163291), claiming they defamed her character with *When They See Us*\n\n[Greenland and Antartica are melting six times faster](https://www.nasa.gov/feature/jpl/greenland-antarctica-melting-six-times-faster-than-in-the-1990s) than they were in the 1990s\n\n[China Pulls Credentials From Journalists At 3 Major U.S. Publications](https://www.npr.org/2020/03/17/817214390/china-pulls-credentials-from-journalists-at-3-major-u-s-publications)\n\n[Australia is recovering somewhat from the disastrous fire season](https://www.npr.org/2020/03/14/810152967/australias-fire-ravaged-forests-are-recovering-ecologists-hope-it-lasts), but there's still the fear the next one could be just as bad or worse\n\n&#x200B;\n\nReply if you'll want more stories\n\n&#x200B;\n\nEDIT: Okay, you wanted more, here's some more:\n\n[Police on Greece’s border with Turkey](https://apnews.com/1186bda6bd2bae0e78dee9743cfad10a) used tear gas and water cannon to repel hundreds of migrants trying to get into the country.\n\n[Tom Brady leaves the Patriots](https://patch.com/massachusetts/foxborough/tom-brady-leave-patriots-continue-career-elsewhere) for the Tampa Bay Buccaneers.\n\nThere was an [attempted mass shooting/assault](https://patch.com/california/losalamitos/garden-grove-cafe-shooter-turns-gun-himself-cops) in Garden Grove, CA\n\n[Teachers union strike concerning failed negotiations](https://www.cnn.com/2020/03/10/us/st-paul-teacher-strike-union-minnesota/index.html)\n\n[Blind man fails citizenship test after being denied Braille](https://www.bbc.com/news/world-us-canada-51760448)\n\nEDIT 2: as u/singandplay65 pointed out, the original \"student protest\" link was about the teachers union striking about failed negotiations. I actually mixed it up with [this](https://q13fox.com/2020/02/17/students-plan-protest-after-gay-teachers-resign-from-catholic-school/) story, which is about students at Kennedy Catholic High School who planned a protest about two gay teachers pressured to resign","isChecked":false,"level":1,"score":"1200"},{"author":"Fennecfox_qween_","body":"The fact scientist discovered a new dinosaur that was the size of a hummingbird and they also found a new planet behind Pluto in our solar system\n\nEdit: thank you to all the kind people who pointed out that the new planet they found is actually an exoplanet","isChecked":false,"level":1,"score":"871"},{"author":"cherry-birdy","body":"Sauce\n\nEdit: ['Reaper of Death' tyrannosaur discovered in Canada](https://www.nationalgeographic.com/science/2020/02/new-reaper-of-death-tyrannosaur-discovered-canada/)\n\n[NASA Planet Hunter Finds its 1st Earth-size Habitable-zone World](https://www.nasa.gov/feature/goddard/2020/nasa-planet-hunter-finds-its-1st-earth-size-habitable-zone-world)\n\nFound those two, but not sure if these are the ones Fennecfox_qween meant. If not I'll fix it right up.\n\nEdit: Got the first one wrong, sorry about that, Fennecfox_qween meant this one - [Forget Batman. New species of bat-winged dinosaur discovered](https://www.usatoday.com/story/news/nation/2019/05/09/dinosaurs-new-bat-winged-dinosaur-found-163-million-year-old-fossil/1151307001/)","isChecked":false,"level":2,"score":"165"},{"author":"trocarkarin","body":"The Great Barrier Reef is getting hit by it's third major bleaching event in the last 5 years.","isChecked":true,"level":1,"score":"227"},{"author":"DisastrousMixture6","body":"In Australia, effectively a war crime our elite forces committed in Afghanistan.\n\n[Here](https://www.abc.net.au/news/2020-03-16/video-shows-afghan-man-shot-at-close-range-by-australian-sas/12028512) is the story from ABC (the Australian Broadcasting Corporation) which features the video and also a blow by blow of the encounter.\n\nThere's a video of a squad of our SAS confronting a man in a field. He is compliant and unarmed. The SAS guy asks 'want me to drop this cunt' a couple of times and is told to radio the superior. He does, but you can't hear the response. He then shoots the man.\n\nThere have been stories breaking in the past of other very questionable or fucked up activity by the SAS in Afghanistan, but (as far as I know) that never had video accompanying it.  The video of this encounter confirms there *wasn't* some misunderstanding or panic...just a cold blooded killing.\n\nIf I may wear my tin foil hat for a moment, it's *terribly* convenient for the government and armed forces that this news broke in the middle of this crisis. A lot of people I know either didn't see this break or only read the headline and assumed it was some kind of misunderstanding.\n\nEdit: added link for those interested","isChecked":false,"level":1,"score":"149"},{"author":"Salkin-","body":"Country leaders trying to secure their position as heads of state for unlimited duration. Example: Russia and Ukraine\n\nEdit: okey guys, like many people have pointed out in the comments Ukraine is not one of the countries pulling this shit. I kinda mixed up Ukraine and Hungary so yeaa that happened🤫","isChecked":false,"level":1,"score":"4386"},{"author":"Beanzie02","body":"Azerbaijan, Turkmenistan, Kazakhstan, Uzbekistan: “It took you this long?”","isChecked":false,"level":2,"score":"1172"},{"author":"PM_ME_UR_BEST_STORY_","body":"\"You guys are having elections?\"","isChecked":false,"level":3,"score":"74"},{"author":"eastsideski","body":"I couldn't find any news about Zelensky or anyone else extending their term. Can you share a link?","isChecked":false,"level":2,"score":"123"},{"author":"prevedpreved","body":"It’s fake news. Zelensky isn’t making equivalent moves to Putin","isChecked":false,"level":3,"score":"106"},{"author":"knowhoakx","body":"Don’t spread misinformation. Where is the sources that Zelensky is trying to do this? Putin you read about everyday in the news, but haven’t seen this information about Ukraine.","isChecked":false,"level":2,"score":"92"},{"author":"silent_as_a_fish","body":"Why Ukraine?","isChecked":false,"level":2,"score":"61"},{"author":"HankSpank","body":"I think he's referring to Yanukovych and is misinformed or copy pasted wrong or something. Zelensky is decreasing in popularity but not for anything like trying to set in place indefinite term limits.","isChecked":false,"level":3,"score":"52"},{"author":"quantaviusg","body":"The DOJ just asked for emergency powers to indefinitely detain people without trial! \n\nThat’s pretty concerning to me?!\n\nIf you’re interested in the details here is a [link to an article.](https://www.politico.com/news/2020/03/21/doj-coronavirus-emergency-powers-140023)","isChecked":false,"level":1,"score":"200"},{"author":"whooo_me","body":"I know this is Covid-19 related, but: The pubs are shut here in Ireland.\n\nThe pubs are shut in Ireland.\n\nYou know when Wyle E Coyote runs off a cliff, and is hanging in mid-air with feet still spinning desperately? That's what this feels like.","isChecked":true,"level":1,"score":"3018"},{"author":"Zetio2255","body":"Sad days for an Irish man , i feel sorry for you .","isChecked":false,"level":2,"score":"231"},{"author":"SteelEpoch","body":"I know what you feel like mate, here in Bavaria (the place with the Oktoberfest) the Beergardens are closed. It's horrible.","isChecked":false,"level":2,"score":"637"},{"author":"Dire87","body":"Fellow Bavarian here. I'm coming up on my 2nd week without physical or even emotional contact. I just sit at home. Work at home. Worry at home. Be depressed at home. I haven't had a beer in 2 weeks. I don't even feel like it. What I wouldn't give for a day in the sun with good friends and a few cold ones now. Maybe a nice lake view. Or mountains. Instead I've been staring at a computer screen for 17 to 18 hours a day, can't really sleep and bury my head in work when I can. And we're looking at another 3 weeks minimum...and then probably at another 4 to 8 weeks of \"don't meet anybody who doesn't live in your household and keep a safe distance\" and I'm like \"sure, I live alone, woopdifuckingdoo\" :(  \n  \nOktoberfest pretty much has to be cancelled this year. No way that can take place. Millions of drunk people, close together. The Maßen alone will be contaminated, let alone the beer. And so many tourists. If there's even going to be flights available, because those are another big risk factor.  \n  \nIt would be a heavy blow for Munich. Just as bars and pubs will have to stay mainly closed throughout the year I assume. Unless someone comes up with a miracle drug or master plan...but the best I've seen is either extreme social distancing until there is a vaccine or a continuous cycle of re-infection, shutdown, reinfection, shutdown -.-","isChecked":false,"level":3,"score":"49"},{"author":"TrustMeImADinosaur","body":"The pubs were closed for Paddy’s Day. If that doesn’t hammer home how serious this situation is, not much else will!","isChecked":false,"level":2,"score":"33"},{"author":"Based_nobody","body":"It's even crazier to know that there are ones that've been open for hundreds of years, and might even have stayed open for both world wars, besides all the others.","isChecked":false,"level":2,"score":"27"},{"author":"IKnowEveryDigitOfPi","body":"EARN IT act","isChecked":false,"level":1,"score":"1425"},{"author":"Skadahmoosh","body":"Maybe, in the science realm of news, the asteroid that will pass by on the 28th of April.","isChecked":false,"level":1,"score":"121"},{"author":"turborambo","body":"The natives in Canada are still mad about the pipeline but no one cares anymore","isChecked":false,"level":1,"score":"835"},{"author":"pastorjpxa","body":"Earn it act\n\nhttps://www.eff.org/deeplinks/2020/03/earn-it-bill-governments-not-so-secret-plan-scan-every-message-online","isChecked":false,"level":1,"score":"1238"},{"author":"Farmerobot","body":"Germany accepting suicide as a basic human right.\n\n[Here's a Reddit post about it](https://www.reddit.com/r/worldnews/comments/fbamz6/germanys_high_court_endorses_right_to_assisted/?utm_medium=android_app&utm_source=share)","isChecked":false,"level":1,"score":"393"},{"author":"SkiwLava","body":"Im moving straight away","isChecked":false,"level":2,"score":"142"},{"author":"HillbillyHenderson","body":"Let us know how it went! \n\n.. oh, that might not work.","isChecked":false,"level":3,"score":"102"},{"author":"SkiwLava","body":"After life is great, they got pizza and shit","isChecked":false,"level":4,"score":"55"},{"author":"juloxx","body":"Isnt the US government trying to take away encryption right now?","isChecked":false,"level":1,"score":"717"},{"author":"bukwirm","body":"Yes, see the [EARN IT act](https://www.eff.org/deeplinks/2020/01/congress-must-stop-graham-blumenthal-anti-security-bill).","isChecked":false,"level":2,"score":"198"},{"author":"Clever_coffee","body":"We’re about to lose the Amazon Rainforest to a perpetual feedback loop that will turn it into savannah.\n\n But nobody is talking about it.","isChecked":false,"level":1,"score":"397"},{"author":"sreacb","body":"The pandemic really covered up the global warming effects. Not to mention the human effects on the planet. This will bite back worse than the pandemic, just a thought.","isChecked":false,"level":2,"score":"158"},{"author":"SirDrEthan1","body":"What happens to earth if all countries follow the Italy shutdown? Didn’t China’s air start to get a little better since there wasn’t billions of people driving about?","isChecked":false,"level":3,"score":"66"},{"author":"Reddit_beard","body":"A few months of reduced emissions wont have a large impact on climate","isChecked":false,"level":4,"score":"52"},{"author":"bs27n0b","body":"[Evidence is building](https://www.sciencedaily.com/releases/2020/03/200306183153.htm) that a major extraterrestrial impact occurred 12,800 years ago that likely caused global destruction.  The impact likely caused the extinction of many large mammal species in North America, including multiple species of elephants/mastodons, Giant Sloths, Giant Bears, Giant Beavers, Camels, etc.  \n\nAt this date, there are many sites around the globe that include nanodiamonds, magnetic spherules and platinum-group metals that are associated with such impacts.  There is also evidence of major burning of forests and other plant material (\"black-mat layer\"), and tons of evidence for [massive flooding in North America](https://inside.mines.edu/UserFiles/File/Geology/Camas_red.pdf), suggesting flood water thousands of feet deep caused dramatic erosional affects in North-eastern portions of the U.S.","isChecked":false,"level":1,"score":"138"},{"author":"spacecampcadet","body":"China trying to extend its reach further into the South China Sea.","isChecked":false,"level":1,"score":"1066"},{"author":"KSP_Player","body":"Thats not news, its always been like that.","isChecked":false,"level":2,"score":"382"},{"author":"spacecampcadet","body":"It has but they have made further aggressive moves within the last week.","isChecked":false,"level":3,"score":"205"},{"author":"blahblahbrandi","body":"The full phone call between Kanye West and Taylor Swift from 2016 leaked and it's been the only thing my Twitter has been talking about. COVID, COVID, COVID, Kanye West is over, COVID.","isChecked":false,"level":1,"score":"254"},{"author":"Experiunce","body":"So did Kanye actually ask her permission and Taylor was BSing or was it the other way around?","isChecked":false,"level":2,"score":"74"},{"author":"blahblahbrandi","body":"In the phone call Kanye's proposed lyric is \"I feel like Taylor Swift might owe me sex\". The actual lyric is \"I feel like me and Taylor might still have sex. Why? I made that bitch famous.\" Taylor is clearly uncomfortable the entire time and just going with it to appease him. He talks her in circles to purposely confuse her and later, in a tweet Kim says \"I did not edit the video, I just showed the parts that fit my narrative\".","isChecked":false,"level":3,"score":"202"},{"author":"Dark_Vengence","body":"That is why kimk is canceled is trending.","isChecked":false,"level":2,"score":"50"},{"author":"None","body":"Prince Andrew being a pedophile. No one talks about that anymore.","isChecked":true,"level":1,"score":"335"},{"author":"ScampAndFries","body":"Prince Charles is isolating in Balmoral with Covid-19.\n\nAndrew is isolating in Windsor with Rebecca, 14.","isChecked":false,"level":2,"score":"175"},{"author":"kourkour","body":"My sister has been living in the UK and I was visiting like a year ago? Before it all came out and we saw a random standup comedy making jokes about that, what I'm saying is the public (in the UK at least) pretty much knew he was a shady creep.","isChecked":false,"level":2,"score":"53"},{"author":"mooseman99","body":"The 2020 census.  I haven’t seen anything about it but I got mine in the mail 2 weeks ago","isChecked":false,"level":1,"score":"45"},{"author":"marshall_zhukov","body":"Major earthquakes happen in capital of Croatia (Zagreb) last Sunday. Earthquakes are still happening and the big part of the city is damaged. A lot of hospitals were also damaged. Our babies were born in a snow, people are left homeless. And the one who are still in their homes are afraid what will happen next.","isChecked":false,"level":1,"score":"42"},{"author":"amicablecricket","body":"Nike, Adidas and Apple products being produced by Uhigurs in concentration camps. \n[Forced labor in concentration camps](https://www.luzernerzeitung.ch/international/vom-folterlager-in-die-fabrik-verrichten-uiguren-zwangsarbeit-fuer-apple-und-co-ld.1199958)","isChecked":false,"level":1,"score":"267"},{"author":"PM_PICS_OF_ME_NAKED","body":"My daughter lost her Peppa Pig doll.\n\nIt's a pretty localized emergency but apparently it takes precedence over everything else.  I'm locked in the bathroom now self isolating, hoping this will all be over soon.","isChecked":false,"level":1,"score":"624"},{"author":"MafiaHen","body":"We have a play house outside in our backyard and my little brother left his Elmo doll in the play house during a storm. The play house flooded and elmo was submerged so we had to go on a rescue mission to get him.","isChecked":false,"level":2,"score":"78"},{"author":"PM_PICS_OF_ME_NAKED","body":"I hope you guys didn't need to call the navy in for assistance.","isChecked":false,"level":3,"score":"59"},{"author":"sleepingupsidedown","body":"Putin makin it legal for him to continue to be president until 2032","isChecked":false,"level":1,"score":"108"},{"author":"SchrammbledEggs722","body":"2036 actually, or at least that's what somebody else said.","isChecked":false,"level":2,"score":"31"},{"author":"watch_over_me","body":"How your liberties and freedoms are being destroyed in the US by both parties getting ready to pass the Patriot Act 2.0, called the EARN IT act. While you're distracted by all this.\n\nYou'd think two parties that hate each other, working together would be news worthy. Especially if it was about to destroy any remaining privacy you had left.\n\nBut I guess not. Continue panicking.","isChecked":false,"level":1,"score":"76"},{"author":"big-trust-woowoo","body":"The concentration camps holding ~2million Muslims in China","isChecked":false,"level":1,"score":"204"},{"author":"alexthegym","body":"The second person in history has been cured of HIV. Not treated, *cured*, as in they no longer have it. This is a huge step in making HIV/AIDS a curable disease. It was a death sentence. If you had it, you could only count your days. After Keith Haring, a very successful artist that died from AIDS, donated a large portion of his net worth to HIV/AIDS research and started the Keith Haring Foundation that focuses on AIDS research and education, it became something people could live with, and was no longer an inevitable death. Now, two people have had their HIV cured. This is the start of something big. If HIV/AIDS can soon be cured as easy as other STIs, then Keith Haring, Freddie Mercury, and everyone else that have died from AIDS complications will be able to rest easy. [2nd Cured Source](https://www.medicalnewstoday.com/amp/articles/2nd-person-cured-of-hiv-thanks-to-stem-cell-transplant) . [Keith Haring Wiki](https://en.m.wikipedia.org/wiki/Keith_Haring) . [Keith Haring Foundation](http://www.haring.com/) EDIT: Spelling","isChecked":false,"level":1,"score":"180"},{"author":"all_fugaz","body":"2020 Presidential election , Afganistán, Syria\nOr China and USA trade war's ... oh and pretty much all of South America","isChecked":false,"level":1,"score":"398"},{"author":"gaylorf","body":"what's going on in South America?","isChecked":false,"level":2,"score":"62"},{"author":"anilsoi11","body":"Kenny Roger's passing.","isChecked":false,"level":1,"score":"383"},{"author":"TacoBellPhD","body":"With all this Covid19 going on, Kenny sure knew when to fold ‘em.","isChecked":false,"level":2,"score":"132"},{"author":"Beanzie02","body":"He picked a fine time to leave us.","isChecked":false,"level":3,"score":"51"},{"author":"ComicWriter2020","body":"Didn’t know a lot of his sons. But I did like coward of the county\n\nEdit: I’m not illiterate. I meant songs.","isChecked":false,"level":2,"score":"34"},{"author":"AngerIncorporated","body":"I didn't know any of his kids. Gambler is a good track.","isChecked":false,"level":3,"score":"28"},{"author":"Mcfozzle","body":"New Zealand recently passing laws legalising abortion.","isChecked":false,"level":1,"score":"129"},{"author":"DingoAteMyKarma","body":"Harvey Weinstein getting convicted and going to prison. I feel like everyone just blew over that one.","isChecked":false,"level":1,"score":"89"},{"author":"Floyd_Pink","body":"And getting coronavirus!","isChecked":false,"level":2,"score":"42"},{"author":"Girls_are_pretty","body":" PornHub premium is currently free for everyone","isChecked":false,"level":1,"score":"1299"},{"author":"Beanzie02","body":"Also the petition to get PornHub criminally investigated for hosting rape and underage content reached 500,000 signatures.\n\nI’ll get downvoted for saying it but it was being talked about before all this hit and would probably be talked about now if it hadn’t.","isChecked":false,"level":2,"score":"714"},{"author":"Bugisman3","body":"In my part of the world, Indonesia's president Joko Widodo, is mourning the death of his mother, aged 77.","isChecked":false,"level":1,"score":"26"},{"author":"Wooganotti","body":"Andrew Gilliam doing drugs with a male prostitute cheating on his wife and family.","isChecked":false,"level":1,"score":"29"},{"author":"obi_wan_jakobee","body":"Mother and daughter in colorado who owned a funeral home being sued for illegally selling human remains","isChecked":false,"level":1,"score":"28"},{"author":"squalorparlor","body":"I think the Hong Kong protests would still be pretty big","isChecked":false,"level":1,"score":"89"},{"author":"SamaritanPrime","body":"Tom Brady has quit the New England Patriots and signed with the Tampa Bay Buccaneers.","isChecked":true,"level":1,"score":"1092"},{"author":"TJeffersonsBlackKid","body":"All the insane shit going on, this is the one thing that I am still struggling to wrap my mind around.\n\nMaybe because I have always imagined what it would be like to have a worldwide crisis and there is some degree of fascination to actually see it happen but there is just no place in my brain to imagine Tom Brady on the Tampa Bay Fucking Buccaneers.","isChecked":false,"level":2,"score":"478"},{"author":"None","body":"[deleted]","isChecked":false,"level":3,"score":"289"},{"author":"TacoBellPhD","body":"Gisele just wanted to wear more bikinis","isChecked":false,"level":4,"score":"106"},{"author":"Lynch_King","body":"He would be a fool to stop her","isChecked":false,"level":5,"score":"102"},{"author":"IsilZha","body":"I think there's an obvious angle here:  Brady wanted to move to Florida.  lol","isChecked":false,"level":3,"score":"54"},{"author":"CedarWolf","body":"\\*shrugs\\* A lot of old folks retire in Florida. I guess it makes sense.","isChecked":false,"level":2,"score":"49"},{"author":"The_UnApologist","body":"Tom Brady now plays for Tampa Bay.\n\nTony Ferguson is FINALLY gonna fight Khabib Nurmagomedov. \n\nThat last one is actually the biggest kick in the face as far as I'm concerned. These two have never fought. Khabib is 28-0, Tony hasn't lost a fight in 8 years. They've been scheduled to fight each other FOUR other times, some crazy shit has happened and the fight was called off. So they finally schedule it for a fifth time and a fucking *global pandemic* breaks out and is now in danger of cancelling their fight a *FIFTH* time. It's huge news. Dana says the fight is still on, but if things get REALLY bad in the US over the next few weeks, nobody will give a shit anyway.\n\nKhabib vs Tony is quickly turning into a more accursed UFC version of Floyd Mayweather *not* fighting Manny Pacquaio for too long.","isChecked":false,"level":1,"score":"49"}],"id":"foslu3","submissionData":{"author":"MrHanSolo","body":"","score":"106892","subreddit":"AskReddit","title":"If Covid-19 wasn’t dominating the news right now, what would be some of the biggest stories be right now?"},"url":"https://www.reddit.com/r/AskReddit/comments/foslu3/if_covid19_wasnt_dominating_the_news_right_now/?sort=top"}